{"id":1906,"date":"2017-10-26T05:45:42","date_gmt":"2017-10-26T05:45:42","guid":{"rendered":"http:\/\/jarvee.com\/?p=1906"},"modified":"2017-10-26T05:45:42","modified_gmt":"2017-10-26T05:45:42","slug":"how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee","status":"publish","type":"post","link":"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/","title":{"rendered":"How To Grow Your Instagram Accounts Like a Pro With JARVEE"},"content":{"rendered":"<p>According to the latest reports, 50% of Instagram users follow at least one business account. Not only that, but <a href=\"http:\/\/www.wordstream.com\/blog\/ws\/2017\/04\/20\/instagram-statistics\">60% of users<\/a> say they learned about a new product or service on Instagram. <\/p>\n<p>Instagram reached the <a href=\"https:\/\/techcrunch.com\/2017\/04\/26\/instagram-700-million-users\/\">700 million monthly active users<\/a> milestone this year, and their growth rate is speeding up. Instagram Stories, which helped boost this growth, eclipsed Snapchat in daily active users and is still growing. There will be no surprise when Instagram reaches 1 billion monthly active users mark. <\/p>\n<p>These are impressive numbers that should make even the most skeptical of marketers thinking of adding Instagram to their marketing mix. This social platform can be your opportunity to get creative and represent your brand with visual storytelling and attract an entirely new market. <\/p>\n<p><b>Long story short: If you are not on Instagram, you should be.<\/b><\/p>\n<p>Let&#8217;s see how to start Instagram Marketing without having to stay up all night, every single day in order to build up your profile. <\/p>\n<p>This tutorial will help you get started with Instagram automation &#8211; the smart way. You will learn how to get faster and better results in less time. By adding these strategies and tools to your marketing, you will start with a significant competitive advantage over your peers. <\/p>\n<h3>Create Content That Customers Will Love<\/h3>\n<p>Even if your business is not revolved around crafty pictures, you can still get creative and create content that will attract your potential customers. For example, you can have a mix of business advice and motivational quotes that resonate with your followers. Your job is to figure out what your customers would like to see, and then you can use JARVEE to do the rest, from scheduling your content and posting it at the perfect times to finding potential customers.<\/p>\n<p>One way to find out what your customers would love to see on Instagram is to do a competitive research and see what other businesses in your niche are posting. <\/p>\n<p>Once you know what content to create for your audience, you can start &#8230; well&#8230; creating it. 🙂 This might sound like a lot of work (and headaches), but actually, it can be quite easy these days with the abundance of online tools for crafting visual content. I like to use Canva for all my designs because it offers me access to over a million of high-quality images and hundreds of easy-to-use templates to choose from. No need for expensive designers. Here is a <a href=\"http:\/\/jarvee.com\/how-to-use-canva-to-create-high-quality-instagram-posts\/\">simple tutorial on how to use Canva to create amazing content for your Instagram marketing<\/a> in the less amount of time possible.<\/p>\n<h3>Use JARVEE To Automate Your Instagram Marketing<\/h3>\n<p>On Instagram, you can start off by posting twice per day, and even more if you can keep up with creating the content. The good news is that if you set up JARVEE as we are about to show you, your only concern will be to create the content that will be added to your campaign.<\/p>\n<p>The most time-saving JARVEE trick that you can use for Instagram Marketing (and all the other social networks where you want to post images) is that you can add a folder where you keep your images and JARVEE will automatically extract the pictures and share them at the specified intervals. Every new photo added to this folder will be automatically extracted and added to your scheduled campaign. That&#8217;s pretty neat, right? <\/p>\n<p>All you have to do is to create your campaign, set up your images folder and then keep adding your creations to the folder. The best part is that you can use a Dropbox folder, that will synchronize your photos on multiple devices. You can add photos from your phone, your laptop, your tablet, all to the same folder. You can even share the folder with the rest of your team members, and have them all contribute. <\/p>\n<p>So, let&#8217;s start with creating the JARVEE campaign for your Instagram Marketing.<\/p>\n<h3>Schedule All Your Instagram Posting With JARVEE<\/h3>\n<p>Before creating a scheduling campaign for your Instagram Marketing, we need to create a destination list where we will add all your social accounts where you want to post your visual content to. This is very helpful in case you want to share the same images to other accounts, either Instagram or Pinterest, Twitter, even Facebook accounts. <\/p>\n<p>To create a destination list you need to:<\/p>\n<ul>\n<li>Go to Destination List tab<\/li>\n<li>Click on Add New Destination List<\/li>\n<li>Give your destination a descriptive name<\/li>\n<li>Add your Instagram account<\/li>\n<\/ul>\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list.jpg\" alt=\"\" width=\"1123\" height=\"414\" class=\"aligncenter size-full wp-image-1927\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list.jpg 1123w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list-300x111.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list-768x283.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list-1024x378.jpg 1024w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list-600x221.jpg 600w\" sizes=\"(max-width: 1123px) 100vw, 1123px\" \/><br \/>\nYou can add your Twitter account too, or Pinterest boards, even other social networks if you want. But for this tutorial, we will focus on Instagram.<\/p>\n<p>Now let&#8217;s see, step-by-step, how to create your first campaign to schedule your Instagram posting.<\/p>\n<ul>\n<li><b>Step 1 &#8211; Create a Standard Campaign<\/b><br \/>\nThe standard campaign is the best option for your Instagram Marketing because you can choose how many posts you want to have per day and JARVEE will set up optimized timers for you. No need to worry about the exact hour and minute for your post, it&#8217;s enough to set up a time interval and the number of posts per day.\n<\/li>\n<\/ul>\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-standard-campaign.jpg\" alt=\"\" width=\"634\" height=\"421\" class=\"aligncenter size-full wp-image-1928\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-standard-campaign.jpg 634w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-standard-campaign-300x199.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-standard-campaign-600x398.jpg 600w\" sizes=\"(max-width: 634px) 100vw, 634px\" \/><\/p>\n<ul>\n<li><b>Step 2 &#8211; Add your visual content<\/b><br \/>\nThis is where the fun part begins. Like I said before, you can set up a <b>Monitoring folder<\/b> where you will add your Instagram pictures, and JARVEE will extract them and add them to your campaign to be posted at the right time for your audience.\n<\/li>\n<\/ul>\n<ul>\nGo to <b>What To Publish<\/b> and click on <b>MONITOR FOLDERS<\/b>.<br \/>\nClick on the Browse button to add the folder where you want to add your photos. <\/p>\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-monitored-folder.jpg\" alt=\"\" width=\"879\" height=\"558\" class=\"aligncenter size-full wp-image-1929\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-monitored-folder.jpg 879w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-monitored-folder-300x190.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-monitored-folder-768x488.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-monitored-folder-600x381.jpg 600w\" sizes=\"(max-width: 879px) 100vw, 879px\" \/><\/p>\n<p>Define a template for your future posts. Now, this is important because you want to make the most of your posts while automating this process as efficient as possible.<br \/>\n<img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/monitored-folder.jpg\" alt=\"\" width=\"1234\" height=\"651\" class=\"aligncenter size-full wp-image-1931\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/monitored-folder.jpg 1234w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/monitored-folder-300x158.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/monitored-folder-768x405.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/monitored-folder-1024x540.jpg 1024w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/monitored-folder-600x317.jpg 600w\" sizes=\"(max-width: 1234px) 100vw, 1234px\" \/><\/p>\n<p>When defining your template, you can use tokens like <b>[FILENAME]<\/b> &#8211; which means that JARVEE will replace this token with the picture&#8217;s file name, making easier for you to customize all your posts. So make sure to save your files with the caption you want to add to your photos. <\/p>\n<p>Another interesting token you can use is <b>[COMMENT]<\/b> &#8211; everything after this token will be posted as the first comment to your photo. This is very helpful if you want to use hashtags to help people discover your photos. Instagram lets you add up to 30 hashtags to your photos, but if you add them all into the caption not only that your post will look spammy, but people will be distracted from the message you want to transmit. If you add all your hashtags into the first comment, then your posts will look clean, and your photos will still be discoverable by Instagrammers.<\/p>\n<p>So the best strategy here is to research your hashtags, find the most relevant ones for your content, and the most popular ones in your niche and add them to your template. <\/p>\n<p>In the end, your template should look like this:\n<\/ul>\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/post-template.png\" alt=\"\" width=\"420\" height=\"114\" class=\"aligncenter size-full wp-image-1930\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/post-template.png 420w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/post-template-300x81.png 300w\" sizes=\"(max-width: 420px) 100vw, 420px\" \/><\/p>\n<ul>\nBut remember to save your photos with the caption you want to use as the filename. <\/p>\n<p>After you finished crafting your template click on <b>ADD FOLDER<\/b>.<\/p>\n<p>Of course, you can add as many folders you want with different templates. You can have your &#8220;quotes&#8221; folder, &#8220;business advice&#8221; folder, &#8220;behind the scenes photos&#8221; folder and so on. Each with different hashtags.<\/p>\n<p>To start extracting photos from your folders, you need to click on the <b>START<\/b> action next to the folders you want to use. JARVEE will then retrieve the existing pictures and add them to the Posts List. Each time a new picture will be added to the folder, JARVEE will add it to the Posts List.<\/p>\n<p>You can also choose to send all the photos to Drafts, in case you want to sort them out before sending to the Post lists. In this case, you will need to check the Drafts tab weekly (or every once in a while) to make sure your campaign has enough posts in the Post List.\n<\/ul>\n<ul>\n<li><b>Step 3 &#8211; Choose your destination list <\/b>\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/where-to-publish.jpg\" alt=\"\" width=\"681\" height=\"410\" class=\"aligncenter size-full wp-image-1932\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/where-to-publish.jpg 681w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/where-to-publish-300x181.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/where-to-publish-600x361.jpg 600w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/where-to-publish-480x290.jpg 480w\" sizes=\"(max-width: 681px) 100vw, 681px\" \/><\/p>\n<p>Go to <b>Where To Publish<\/b> and select the destination list you created above for your Instagram accounts.\n<\/li>\n<li><b>Step 4 &#8211; Set up timers for your Instagram posts<\/b>\n<p>Go to <b>When To Publish<\/b> and choose the number of posts you want to have per day. You can start with 2 or 3 posts per day, and increase this number over time. <\/p>\n<p>I usually choose to &#8220;Randomize publishing timers each day&#8221;, &#8220;Randomize the number of posts each day&#8221; and &#8220;Rotate days&#8221; to make it look more natural.\n<\/li>\n<\/ul>\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/when-to-publish.jpg\" alt=\"\" width=\"817\" height=\"468\" class=\"aligncenter size-full wp-image-1933\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/when-to-publish.jpg 817w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/when-to-publish-300x172.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/when-to-publish-768x440.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/when-to-publish-600x344.jpg 600w\" sizes=\"(max-width: 817px) 100vw, 817px\" \/><\/p>\n<ul>\n<li><b>Step 5 &#8211; Review your posts and then start the campaign<\/b><br \/>\nTo review your posts and make sure your template is working ok, go to the <b>Posts List<\/b> tab. <\/p>\n<p>If everything is ok, you can go to the <b>Overview<\/b> tab and start your campaign. Make sure to give your campaign a descriptive name before starting it, so you can easily recognize it.<\/p>\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/standard-campaign.jpg\" alt=\"\" width=\"1109\" height=\"479\" class=\"aligncenter size-full wp-image-1934\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/standard-campaign.jpg 1109w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/standard-campaign-300x130.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/standard-campaign-768x332.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/standard-campaign-1024x442.jpg 1024w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/standard-campaign-600x259.jpg 600w\" sizes=\"(max-width: 1109px) 100vw, 1109px\" \/><\/p>\n<\/li>\n<\/ul>\n<p>That&#8217;s it: you now have in place an entirely automated system that will take your photos from your folders and post them to your Instagram with customized captions and hashtags. <\/p>\n<h3>Add more content to your profile with the Repost tool<\/h3>\n<p>Here&#8217;s a great method that can help you strike two birds with one stone: search for great content on Instagram from Instagrammers in your niche with similar numbers of followers or slightly higher, and repost their content to your profile.<\/p>\n<p>First, you will have great content to keep your audience engaged. And second, this is considered a &#8220;shout-out&#8221; in Instagram communities, which means that a good deal of the people you shout-out will return the favor and repost some of your content to their feeds. This will help you reach a new audience and grow your accounts faster.<\/p>\n<p>With JARVEE&#8217;s Repost tool you can do this on autopilot:<br \/>\n<b>#1 Set Up The Tool&#8217;s Settings <\/b><\/p>\n<ul>\n<li>go to the <b>Tools<\/b> section in JARVEE and choose the Instagram account you want to grow using this method<\/li>\n<li>click on the <b>Repost<\/b> tab<\/li>\n<li>choose the Settings for reposting content on Instagram:<\/li>\n<li>choose the number of minutes to wait between each repost operation, how many reposts you want to have per operation and the time to wait between each repost<\/li>\n<li>I suggest to start with a maximum of 2 to 5 reposts per day and slowly increase the number<\/li>\n<li>After you select the hours for your repost and the post type: images or videos, you can choose to delete the repost after several hours. This is a limited time shout-out, and it practiced a lot with excellent results. To be more efficient with this method you should notify the people you are reposting about your shout-out and the interval you&#8217;re doing it, so they&#8217;ll know to return the favor.<\/li>\n<li>next, make sure that the post you want to share is recent enough (I usually choose posts within the last 15 days) <\/li>\n<li>you might want to share only those posts that already have some likes or comments<\/li>\n<li>you can also set up a list of keywords to exclude posts containing them<\/li>\n<li>Finaly add your template for the post&#8217;s caption. You can use spin syntax and tokens such as: [USERNAME], [POSTURL] or [ORIGINALPOST CAPTION] that will be replaced with the corresponding info at the time of posting. Or you can use the [COMMENT] token, just like for your own posts, and add hashtags in the first comment. You can use as template something like this: {Reposted from [POSTURL]|Posted by @[USERNAME]} but it would be best if you create a more complex spin text for this.\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/repost-tool.jpg\" alt=\"\" width=\"1328\" height=\"787\" class=\"aligncenter size-full wp-image-1935\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/repost-tool.jpg 1328w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/repost-tool-300x178.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/repost-tool-768x455.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/repost-tool-1024x607.jpg 1024w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/repost-tool-600x356.jpg 600w\" sizes=\"(max-width: 1328px) 100vw, 1328px\" \/><\/p>\n<\/li>\n<\/ul>\n<p><b>#2 Choose The Sources<\/b><br \/>\nAfter you figure out all your settings, you need to go to the <b>Source<\/b> sub-tab to choose a method to search for posts to share. <\/p>\n<p>These are the methods you can use to find posts:<\/p>\n<ul>\n<li> add a list of keywords and repost based on these keywords<\/li>\n<li>add a list of accounts (just add valid usernames, one per line) and repost from their content. This is very useful if you know the influencers you want to reach<\/li>\n<li>repost from the followers or followings of certain Instagram accounts. This is useful if you want to target friends of competitive accounts in your niche.<\/li>\n<li>you can simply choose to repost popular post<\/li>\n<li>or repost based on certain locations<\/li>\n<li>or you can even target specific posts, if you add their URL one by one<\/li>\n<\/ul>\n<h3>Get more Instagram followers using the JARVEE Tools<\/h3>\n<p>The reciprocity principle states that people use to return other people the favor. So, applied to social media this means that if you follow other people, the chances are that they will follow you back (at least most of them). Same goes for likes or comments. <\/p>\n<p>So a good strategy to grow your accounts fast is to search for people in your industry and follow them. A very good percentage of them will follow you back. After a few days, you can unfollow those that didn&#8217;t follow you back. Rinse and repeat. You can do this manually, but it will take you a lot of time. So the best way is to use JARVEE&#8217;s tools like Follow and Unfollow. <\/p>\n<p>On Instagram, there are more chances that a person will follow you back if, after following you also like their latest photos. Through our testing, we noticed that you increase your chances if you like the latest 3 &#8211; 5 photos or even better if you comment on the latest 3 to 5  photos. <\/p>\n<p>Let&#8217;s see how to use the <b>Follow tool in JARVEE<\/b> to do all this:<\/p>\n<ul>\n<li>go to the <b>Tools<\/b> section in JARVEE and click on the <b>Follow<\/b> tab<\/li>\n<li>Click on the <b>Settings<\/b> sub-tab where you can refine your search<\/li>\n<li>Start with setting up how much time to wait between each follow operation and how many people to follow per operation. If you are just beginning you should start slow, following around 8 to 20 people per operation is more than enough. <\/li>\n<li>Now make sure you follow people with a profile picture, with a minimum number of posts and a bio. Otherwise, you will risk following inactive or spam accounts<\/li>\n<li>You can also set up a list of keywords to ignore people with these keywords in their bio or username<\/li>\n<li>Next, I usually set the tool to search for people that posted within the last 30 days (to ensure I&#8217;m not following inactive users), and I want to avoid private users.<\/li>\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/follow-tool.jpg\" alt=\"\" width=\"1183\" height=\"1081\" class=\"aligncenter size-full wp-image-1936\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/follow-tool.jpg 1183w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/follow-tool-300x274.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/follow-tool-768x702.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/follow-tool-1024x936.jpg 1024w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/follow-tool-600x548.jpg 600w\" sizes=\"(max-width: 1183px) 100vw, 1183px\" \/><\/p>\n<li>Now, like I said above, you can set up the Follow tool to like the latest posts after follow (I choose to like between 3 and 5 posts) and leave a comment on the last post. This will increase the chances that the user will follow you back. But, make sure you use spin syntax and get creative with the comments, so they don&#8217;t look too spammy (you know the comments I&#8217;m talking about 😉 ). <\/li>\n<li>After you figured out all the settings, you need to go to the <b> Follow Sources<\/b> tab <\/li>\n<li>Here you can select a method to search for people to follow.\n<p>You can search people by keywords, or you can target the followers or followings of specific accounts in your niche. You can even target people that follow your own followers or simply add the accounts you want to follow one by one. <\/p>\n<p>Another method to search for people to follow is to target people that interact with the posts of certain accounts (for example you want people that like or comment on your posts, or to a competitor&#8217;s posts) and lastly, you can follow people based on their location.<\/p>\n<p>You don&#8217;t have to use all these methods at once (although you can:P). Just start with the one you feel more comfortable with and you can test other methods later.\n<\/li>\n<li>After you have the settings and the sources, you can go on and Start the Follow tool.<\/li>\n<\/ul>\n<p>The <b>Unfollow tool<\/b> works hand in hand with the Follow Tool. So you might want to start this one too. You just have to set up a number of days to wait before unfollowing those people that did not follow you back. I usually wait about 5 days.<br \/>\n<img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/unfollow-tool.jpg\" alt=\"\" width=\"941\" height=\"710\" class=\"aligncenter size-full wp-image-1937\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/unfollow-tool.jpg 941w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/unfollow-tool-300x226.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/unfollow-tool-768x579.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/unfollow-tool-600x453.jpg 600w\" sizes=\"(max-width: 941px) 100vw, 941px\" \/><\/p>\n<p>Similar to the Follow tool, there are two other tools that you can use: <b>Like<\/b> and <b>Comment<\/b>. You can search for posts in your niche and like or leave a comment. People will notice your account and check it out. These tools are pretty similar to the Follow tool, but if you need more guidance, you can check out <a href=\"http:\/\/jarvee.com\/video-tutorials-jarvee-social-media-automation-software\/\">our video tutorials<\/a>.<\/p>\n<h3>Let your clients be the first to know about your offers with the Contact tool<\/h3>\n<p>Even with your carefully planned Marketing strategy in place, most of your followers might miss a good deal of your content. But they followed you because they want to be the first to know when you release something new, or you have a giveaway, contest or a promotional offer. You can make sure they still get your offers even if they are not 24\/7 on Instagram, by using the Contact tool and send them Direct Messages. This way, they will get notifications and any promotional material right in their inbox. <\/p>\n<p>To use the <b>Contact Tool<\/b>, you need to go to the usual place in the Tools section, click on the Instagram account you want to use to contact its followers and click on the <b>Contact<\/b> tab.<\/p>\n<p>Here you can notice other sub-tabs: Extract Users, Auto-Extract, Use Extracted Users, Send Message To New Followers, Auto-Reply To New Messages and Send Messages.<\/p>\n<p>In the first sub-tab, you just need to click on the EXTRACT USERS button and JARVEE will start retrieving the followers of the accounts you enter in the text field. If you want to automatically extract new followers to the targeted accounts, you need to use the second sub-tab: Auto-Extract. Here, you need to add the targeted accounts in the text field (like for the first sub-tab) and then click on the &#8220;Start&#8221; button. You can customize when to run this tool or how many users to extract on each run.<\/p>\n<p>After the first part of this process is done, the extraction of the followers, you need to go to the Use Extracted Users tab. Here, you will see the list of all your followers. You need to select the ones that you want to contact. <\/p>\n<p>Then, in the same tab, in the ADD MESSAGES TO SELECTED USERS area, add the message you wish to send. You can use spin syntax for this if you want to change things up a bit. You can also use token such as [FULLNAME], [FIRSTNAME] or [LASTNAME] if you want to customize your message. These token will be replaced with the corresponding information. <\/p>\n<p><img loading=\"lazy\" src=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/contact-tool.jpg\" alt=\"\" width=\"916\" height=\"589\" class=\"aligncenter size-full wp-image-1938\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/contact-tool.jpg 916w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/contact-tool-300x193.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/contact-tool-768x494.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/contact-tool-600x386.jpg 600w\" sizes=\"(max-width: 916px) 100vw, 916px\" \/><\/p>\n<p>After finishing your message click on the ADD TO SEND MESSAGES LIST button to send it to the messages list that you will manage in the next step. Don&#8217;t worry; this will not send your message to your followers. We will do this in the next step.<\/p>\n<p>Now, the final step: click on the Send Messages tab. Here you will see the messages you plan to send and the delays for your messages. It&#8217;s best to have some delays in place, to avoid sending too many messages in a short period of time. The default settings are a great starting point. <\/p>\n<p>When ready you can click on the Start button.<\/p>\n<p>That&#8217;s it; you now know how to promote your business on Instagram like a Pro. Of course, we have more incredible tools like this, if you want to check them out, you can watch our <a href=\"http:\/\/jarvee.com\/video-tutorials-jarvee-social-media-automation-software\/\">video tutorials<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to the latest reports, 50% of Instagram users follow at least one business account. Not only that, but 60% of users say they learned about a new product or service on Instagram. Instagram reached the 700 million monthly active users milestone this year, and their growth rate is speeding up. Instagram Stories, which helped [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[25],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Grow Your Instagram Accounts Like a Pro With JARVEE<\/title>\n<meta name=\"description\" content=\"JARVEE can help you grow your Instagram accounts faster and better than any other automation tool at the moments, with only real and engaged followers!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Grow Your Instagram Accounts Like a Pro With JARVEE\" \/>\n<meta property=\"og:description\" content=\"JARVEE can help you grow your Instagram accounts faster and better than any other automation tool at the moments, with only real and engaged followers!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2017-10-26T05:45:42+00:00\" \/>\n<meta property=\"og:image\" content=\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"16 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list.jpg\",\"contentUrl\":\"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list.jpg\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#webpage\",\"url\":\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/\",\"name\":\"How To Grow Your Instagram Accounts Like a Pro With JARVEE\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#primaryimage\"},\"datePublished\":\"2017-10-26T05:45:42+00:00\",\"dateModified\":\"2017-10-26T05:45:42+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"description\":\"JARVEE can help you grow your Instagram accounts faster and better than any other automation tool at the moments, with only real and engaged followers!\",\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How To Grow Your Instagram Accounts Like a Pro With JARVEE\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How To Grow Your Instagram Accounts Like a Pro With JARVEE","description":"JARVEE can help you grow your Instagram accounts faster and better than any other automation tool at the moments, with only real and engaged followers!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/","og_locale":"en_US","og_type":"article","og_title":"How To Grow Your Instagram Accounts Like a Pro With JARVEE","og_description":"JARVEE can help you grow your Instagram accounts faster and better than any other automation tool at the moments, with only real and engaged followers!","og_url":"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/","og_site_name":"Jarvee","article_published_time":"2017-10-26T05:45:42+00:00","og_image":[{"url":"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list.jpg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"16 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#primaryimage","inLanguage":"en-US","url":"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list.jpg","contentUrl":"http:\/\/jarvee.com\/wp-content\/uploads\/2017\/10\/add-to-destination-list.jpg"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#webpage","url":"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/","name":"How To Grow Your Instagram Accounts Like a Pro With JARVEE","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#primaryimage"},"datePublished":"2017-10-26T05:45:42+00:00","dateModified":"2017-10-26T05:45:42+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"description":"JARVEE can help you grow your Instagram accounts faster and better than any other automation tool at the moments, with only real and engaged followers!","breadcrumb":{"@id":"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"How To Grow Your Instagram Accounts Like a Pro With JARVEE"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/1906"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=1906"}],"version-history":[{"count":7,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/1906\/revisions"}],"predecessor-version":[{"id":1940,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/1906\/revisions\/1940"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=1906"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=1906"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=1906"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}