{"id":2557,"date":"2018-01-21T10:48:21","date_gmt":"2018-01-21T10:48:21","guid":{"rendered":"https:\/\/jarvee.com\/?p=2557"},"modified":"2018-01-28T12:57:33","modified_gmt":"2018-01-28T12:57:33","slug":"10-books-social-media-marketers-should-read-this-year","status":"publish","type":"post","link":"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/","title":{"rendered":"10 Books Social Media Marketers Should Read This Year"},"content":{"rendered":"<h2>#1 <a href=\"http:\/\/www.amazon.com\/Positioning-Battle-Your-Al-Ries\/dp\/0071373586\/\">Positioning by Al Ries &amp; Jack Trout<\/a><\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/positioning-book.jpg\" alt=\"\" width=\"500\" height=\"579\" class=\"aligncenter size-full wp-image-2600\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/positioning-book.jpg 500w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/positioning-book-259x300.jpg 259w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/p>\n<p>This is one of those great classic books in marketing, but it’s the first book that helps you understand how to deal with communicating to skeptics and the media over-run public. It mostly describes and talks about the most revolutionary way to approach the need to have a “position” in future and prospective customers’ mindset. It tells a tale that reflects how a company has its own strengths and weaknesses and even addresses those of competitors. With this book, you’ll learn not just how to use the most advanced and popular ad techniques but will help you better perfect the art of capturing the biggest market shares and on how to become an infamous household name.<\/p>\n<h3>Things to look out for in this book:<\/h3>\n<ul>\n<li>The use of the most advanced and popular ad techniques, but will help you better perfect the art of capturing the biggest market shares and on how to become an infamous household name.<\/li>\n<li>Building a strong strategy around your competitors weaknesses<\/li>\n<li>How to reposition your strong competitors and create their weak areas<\/li>\n<li>How to use your current position at its best and most advantageous state<\/li>\n<li>Choosing the best name for your product\/brand<\/li>\n<li>Being able to determine why and when less could be more<\/li>\n<li>Hone the ability to analyze recent trends that can affect you<\/li>\n<\/ul>\n<h2>#2 <a href=\"http:\/\/www.amazon.com\/Epic-Content-Marketing-Different-Customers\/dp\/0071819894\/\">Epic Content Marketing by Joe Pullizzi<\/a><\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Epic-Content-Marketing.png\" alt=\"\" width=\"500\" height=\"633\" class=\"aligncenter size-full wp-image-2599\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Epic-Content-Marketing.png 500w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Epic-Content-Marketing-237x300.png 237w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/p>\n<p>Being the founder of CMI or the Content Marketing Institute, one of the most popular content marketing educational resources for brands, it is assuring to say that Joe Pulizzi knows what he’s talking about in terms of content marketing. Having one of the fastest growing business since it started, he has the best advice about how to get things like this done right.<\/p>\n<p>This book takes you through a step by step guide in the process of developing a story that will not just inform but also entertain your customers. Simply speaking, he shows you how to get them to act without really having to instruct them in doing so. This book gives you an upper hand in positioning your business.<\/p>\n<p>Seeing as Pulizzi is a trusted expert in this field of sorts, to get a hang onto how he does it so well he shares his six most important principles:<\/p>\n<ul>\n<li>Your content should and must fill those unmet needs and answers the questions of your customers<\/li>\n<li>In delivering content, you must do so consistently<\/li>\n<li>You should have content written in your own voice, with added humor<\/li>\n<li>Instead of giving balanced reports, express opinions; the good kind<\/li>\n<li>Avoiding sales speak is a must, take notice that it will destroy your contents value<\/li>\n<li>Always aim to produce and share the best and only the best of your content related to your niches<\/li>\n<\/ul>\n<h2>#3 <a href=\"http:\/\/www.amazon.com\/Youtility-Smart-Marketing-about-Help\/dp\/1591846668\/\">Youtility: Why Smart Marketing Is about Help Not Hype by Jay Baer<\/a><\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/youtility-book.png\" alt=\"\" width=\"453\" height=\"495\" class=\"aligncenter size-full wp-image-2598\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/youtility-book.png 453w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/youtility-book-275x300.png 275w\" sizes=\"(max-width: 453px) 100vw, 453px\" \/><\/p>\n<p>This book focuses mainly on the customer, and not just that but also on the need and the importance of marketing to help customers. It’s all about building value for your clients. Brands always promise their users something. This book reminds us that our customers value these promises and the experience enough to want to buy the merchandise.<\/p>\n<p>Some people can consider it value proposition, but in honesty, customers will need to get something out of our marketing. This book gives you a modern view of two core marketing values. It teaches us that helpfulness is not what makes up a brand, but it can be one of the best methods.<\/p>\n<h3>To achieve Youtility, the book makes note of the 3 different facets one should consider:<\/h3>\n<ul>\n<li><b>Provide Self-Serve Information<\/b> – Simply because customers prefer to help themselves to information before purchasing something rather than talking to a sales person.<\/li>\n<li><b>Practice Radical Transparency<\/b> &#8211; Answering customer questions in an open, comprehensive and detailed manner helps you gain there trust.<\/li>\n<li><b>Have Real-Time Relevancy<\/b> &#8211; Customers crave real-time information, which can be served through mobile friendly content and apps.<\/li>\n<\/ul>\n<h2>#4 <a href=\"http:\/\/www.amazon.com\/Tribes-We-Need-You-Lead\/dp\/1591842336\/\">Tribes: We Need You to Lead Us by Seth Godin<\/a><\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Tribes-Seth-Godin.jpg\" alt=\"\" width=\"1200\" height=\"801\" class=\"aligncenter size-full wp-image-2597\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Tribes-Seth-Godin.jpg 1200w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Tribes-Seth-Godin-300x200.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Tribes-Seth-Godin-768x513.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Tribes-Seth-Godin-1024x684.jpg 1024w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Tribes-Seth-Godin-600x401.jpg 600w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<p>The book argues over the fact that change can best be effected by a tribe. So think about it, our innovators are the ones who assemble similar individuals and get us excited about the products. Godin explains that these “tribes” are within our corporation, and anyone can be a leader; though sometimes are usually kept from their own potential due to fear and criticism.<\/p>\n<p>The book’s helpful tips are perfected with the help case studies which explain that: “we can be leaders if we want, tribes are the way of the future and change is good” This book is a game-changer, that helps your mind pull up something you’ve read from it.<\/p>\n<h2>#5 <a href=\"http:\/\/www.amazon.com\/How-Customers-Think-Essential-Insights\/dp\/1578518261\/\">How Customers Think: Essential Insights into the Mind of the Market by Gerald Zaltman<\/a><\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/How-Customers-Think.jpg\" alt=\"\" width=\"331\" height=\"499\" class=\"aligncenter size-full wp-image-2596\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/How-Customers-Think.jpg 331w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/How-Customers-Think-199x300.jpg 199w\" sizes=\"(max-width: 331px) 100vw, 331px\" \/><\/p>\n<p>This book provides a great new thought to understanding why and how customers buy. It shows us how despite resources spent on marketing research, it’s a little fact that 80% of offerings fail. Why? Because patterns have become so predictable. The usual and conventional how-to is this: customers want something, a company creates it, but when it’s available – customers don’t buy it.<\/p>\n<p>This is simply because of the fact that customers don’t actually know what they want. Gerald Zaltman gives us an explanation to this puzzle and concludes that, at some point, customers do know. But because our own marketing&#8217;s most overused tools like surveys, questionnaires, and focus groups have become such conventional practices, they no longer dig deeply enough to help them discover and express what it is they truly want.<\/p>\n<p>This book is mind-opening, because of the fact that it argues that 95 percent of thinking happens in our unconscious. That’s why when it comes down to unearthing your customers&#8217; desires, it requires us to understand so much more that is the &#8220;mind of the market”.<\/p>\n<p>Zaltman offers perpetual insights into what happening within the complicated system of our mind, brain, body, and society. He gives us a closer illustration of how leading companies are &#8220;mining the unconscious&#8221; while providing us with  remarkable results due to the following:<\/p>\n<ul>\n<li>Development of research questions that speak to our consumers unconscious minds.<\/li>\n<li>Evocable and valuable meaning through a customer&#8217;s brand communications.<\/li>\n<li>Measurement of consumer reactions to certain marketing and advertising strategies.<\/li>\n<li>The building of what reflects a market to help boost a customer’s satisfaction, loyalty, and sales.<\/li>\n<li>Understanding how our own minds work and how we can come up with new creative things.<\/li>\n<li>The realization of the fact that the mind of the market is waiting to be explored, and it’s a competition of who gets there first.<\/li>\n<\/ul>\n<h2>#6 <a href=\"http:\/\/amzn.to\/1Vr7PeE\">Jab, Jab, Jab, Right Hook: How to Tell Your Story in a Noisy Social World<\/a> by Gary Vaynerchuk<\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Jab-Jab-Jab-Right-Hook.png\" alt=\"\" width=\"800\" height=\"400\" class=\"aligncenter size-full wp-image-2595\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Jab-Jab-Jab-Right-Hook.png 800w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Jab-Jab-Jab-Right-Hook-300x150.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Jab-Jab-Jab-Right-Hook-768x384.png 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Jab-Jab-Jab-Right-Hook-600x300.png 600w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>Gary Vaynerchuk brilliantly writes a book that is both educational and entertaining. Jab, Jab, Jab, Right Hook: How to Tell Your Story in a Noisy Social World is packed with timely information about web marketing, outstanding content and social media. <\/p>\n<p>Whether you&#8217;re an entrepreneur, small business owner or a marketer to a Fortune 500 company, this book is a must-read for you. Trust me, once you start it you can&#8217;t put it down until the end! <\/p>\n<p>In this book, you will learn how to create shareable, relevant and attention-grabbing content that will ensure brand growth through word of mouth. <\/p>\n<p>Gary breaks down today&#8217;s major social media platforms with great detail. He walks you through all the features, the demographics and what content works for each platform to make sure you understand how to best benefit from them. There are tons of examples for each social network, from big or small companies, complete analysis of good and not-so-good posts to learn from.<\/p>\n<p>In this book, you&#8217;ll also learn how to create outstanding content and to prepare a context for the right hook.  <\/p>\n<p>The characteristics of a perfect right hook are:<\/p>\n<ul>\n<li>It makes the call to action simple and easy to understand.<\/li>\n<li>It&#8217;s perfectly crafted for mobile, as well as all digital devices.<\/li>\n<li>It respects the nuances of the social network for which you are making the content.<\/li>\n<\/ul>\n<p><\/p>\n<h2>#7 <a href=\"http:\/\/amzn.to\/1Id1VE7\">The Power of Visual Storytelling: How to Use Visuals, Videos, and Social Media to Market Your Brand<\/a> by Ekaterina Walter and Jessica Gioglio <\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/The-Power-of-Visual-Storytelling.jpg\" alt=\"\" width=\"318\" height=\"318\" class=\"aligncenter size-full wp-image-2594\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/The-Power-of-Visual-Storytelling.jpg 318w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/The-Power-of-Visual-Storytelling-150x150.jpg 150w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/The-Power-of-Visual-Storytelling-300x300.jpg 300w\" sizes=\"(max-width: 318px) 100vw, 318px\" \/><\/p>\n<p>We live in an age where there is no shortage of user-generated content, especially visual content. With the rise of the mobile devices, taking and sharing a photo or video online has never been easier. Users can record their memories and emotions and share them with their loved ones in real-time through social media channels.<\/p>\n<p>The human brain process images more quickly than text: &#8220;Visuals are processed 60,000 times faster than text by the human brain and 90% of information transmitted to the brain is visual.&#8221;<\/p>\n<p>Ekaterina Walter and Jessica Gioglio bring to the table years of hands-on experience, making &#8220;The Power of Visual Storytelling&#8221; an invaluable resource and a must read for all the marketers and social media teams out there. <\/p>\n<p>The book is loaded with incredible case studies from leading brands that illustrate best practices in visual marketing and storytelling. After an overview of all the types of visuals that marketers can benefit from, the authors introduce you to the key elements of visual storytelling:<\/p>\n<ul>\n<li>Embrace Visual Imagery<\/li>\n<li>Personalize, Don’t Spray<\/li>\n<li>Make Yourself Useful<\/li>\n<li>Be Human<\/li>\n<li>Tell a Story<\/li>\n<li>Be Shareworthy in Everything You Do<\/li>\n<li>Live in the Moment<\/li>\n<\/ul>\n<p>Each element is explained with colorful stats and pictures that reinforce the power of the visuals when telling a story. <\/p>\n<p>The authors paint the current status of all the social networks and give incredible tips for engaging on each platform: Pinterest, Youtube, Facebook, Twitter, Instagram, Tumblr, SlideShare, and Google+. All the ideas are backed up by the case studies from thought leaders in the field. <\/p>\n<p>Next, you will learn all the steps involved in developing a visual storytelling map, from setting up your goals to shaping your visual story and crafting stunning visuals to meet your goals. <\/p>\n<p><\/p>\n<h2>#8 <a href=\"http:\/\/amzn.to\/1CPoq67\">Inbound Marketing, Revised and Updated: Attract, Engage, and Delight Customers<\/a> by Brian Halligan and Dharmesh Shah<\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Inbound-Marketing.jpg\" alt=\"\" width=\"333\" height=\"500\" class=\"aligncenter size-full wp-image-2593\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Inbound-Marketing.jpg 333w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Inbound-Marketing-200x300.jpg 200w\" sizes=\"(max-width: 333px) 100vw, 333px\" \/><\/p>\n<p>Inbound Marketing, written by the co-founders of HubSpot, Brian Halligan, and Dharmesh Shah, is a great starting point for all the digital marketers at the beginning of their journey. It is a very good primer on getting found online, attract leads and convert them into loyal customers. If you&#8217;re an experienced inbound marketer, you may find this book a good opportunity to refresh some basic concepts in web marketing and social media.<\/p>\n<p>The book is written in a simple, comprehensive format with plenty of useful visuals and case studies for each chapter. The authors get straight to the point and deliver the basic concepts of inbound marketing in short, easy to read, chapters. <\/p>\n<p>Everything you need to know about designing your website, creating remarkable content and getting your content found by the target audience, is described in detail in the first chapters of the book. At the end of each chapter, you will have action items to get to practice everything you learn. <\/p>\n<p>You get to learn basic concepts about SEO and how to get higher in the Google search results. Also, all the social media platforms are described in a beginner level detail to make sure you get the most out of their features. <\/p>\n<p>Next you&#8217;ll learn how to attract, nurture leads and convert them into customers, how to measure and improve your strategy through testing, and of course how to create your winning inbound marketing team. <\/p>\n<p>Knowing the tools and the basic concepts of inbound marketing are crucial for anyone starting a new business and trying to get their content in front of the potential customers. <\/p>\n<p><\/p>\n<h2>#9 <a href=\"http:\/\/amzn.to\/1TOFVrp\">The Art of Social Media: Power Tips for Power Users<\/a> by Guy Kawasaki and Peg Fitzpatrick <\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/the-art-of-social-media.jpg\" alt=\"\" width=\"500\" height=\"667\" class=\"aligncenter size-full wp-image-2603\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/the-art-of-social-media.jpg 500w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/the-art-of-social-media-225x300.jpg 225w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/p>\n<p>If you&#8217;re looking for valuable, actionable tips that will help you make meaningful connections online and bring value to your community, this book is for you. The Art of Social Media: Power Tips for Power Users is for social media marketers, entrepreneurs, business owners or anyone who want to go PRO in social media. The book is packed with advanced insights, tips, and tricks that help you build a consistent and valuable online presence.<\/p>\n<p>This is not your usual &#8220;how-to&#8221; book. Using an easy to follow and unique writing style with a little humor to make it even more entertaining, Guy Kawasaki and Peg Fitzpatrick, give us a complete map of social media. You get to learn from the expertise of someone like Guy, who has over 1.45 million followers on Twitter alone. And you also get to experience the authors&#8217; unique personalities on each page of the book. It&#8217;s like talking to your mentors in your living room. <\/p>\n<p>All the powerful tips and tools are described in great detail throughout the book with useful case studies and images. You start by learning how to present yourself in the social space, how to be a mensch (a kind and honorable person who does the right thing the right way) and how to perfect your posts. You move to learn how to integrate your social media to your blogging and become a true marketing pro. And finally, you&#8217;ll learn how to get more followers and expand your reach. <\/p>\n<p>The Art of Social Media is a reference guide for anyone dealing with social media on a daily basis. <\/p>\n<p><\/p>\n<h2>#10 <a href=\"http:\/\/amzn.to\/1COtojv\">Growth Hacker Marketing: A Primer on the Future of PR, Marketing, and Advertising<\/a> by Ryan Holiday <\/h2>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Growth-Hacker-Marketing-by-Ryan-Holiday.jpg\" alt=\"\" width=\"400\" height=\"386\" class=\"aligncenter size-full wp-image-2591\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Growth-Hacker-Marketing-by-Ryan-Holiday.jpg 400w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/Growth-Hacker-Marketing-by-Ryan-Holiday-300x290.jpg 300w\" sizes=\"(max-width: 400px) 100vw, 400px\" \/><br \/>\nGrowth Hacking is a scientific approach to marketing, focusing on the &#8220;who the customers are&#8221; and &#8220;where they are&#8221;. Ryan Holiday describes famous case studies of how startups applied growth hacker tactics to become the today&#8217;s multi-billion dollars companies.<\/p>\n<p>The days of taking the &#8220;Hollywood&#8221; approach to marketing (expensive events, billboards and everything involved in traditional marketing) are over. Today you can reach your audiences without spending a small fortune, but with clever tactics and the right product, that people actually want. <\/p>\n<p>Throughout this book, you&#8217;ll get to learn from the many examples of real startups that successfully applied growth hacking tactics and went viral. You&#8217;ll learn how to find your own growth hacks and how to achieve virality. <\/p>\n<p>Unlike the old ways of marketing a product, growth hacking isn&#8217;t a campaign with a deadline. It&#8217;s a continuous process of optimization. You need to constantly track your results, to improve and iterate to survive.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>#1 Positioning by Al Ries &amp; Jack Trout This is one of those great classic books in marketing, but it’s the first book that helps you understand how to deal with communicating to skeptics and the media over-run public. It mostly describes and talks about the most revolutionary way to approach the need to have [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[23],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>10 Books Social Media Marketers Should Read This Year - Jarvee<\/title>\n<meta name=\"description\" content=\"If you work in social media, or you are an entrepreneur trying to promote your business, these books are for you!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"10 Books Social Media Marketers Should Read This Year - Jarvee\" \/>\n<meta property=\"og:description\" content=\"If you work in social media, or you are an entrepreneur trying to promote your business, these books are for you!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-01-21T10:48:21+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-01-28T12:57:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/positioning-book.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/positioning-book.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/positioning-book.jpg\",\"width\":500,\"height\":579},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#webpage\",\"url\":\"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/\",\"name\":\"10 Books Social Media Marketers Should Read This Year - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#primaryimage\"},\"datePublished\":\"2018-01-21T10:48:21+00:00\",\"dateModified\":\"2018-01-28T12:57:33+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"description\":\"If you work in social media, or you are an entrepreneur trying to promote your business, these books are for you!\",\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"10 Books Social Media Marketers Should Read This Year\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"10 Books Social Media Marketers Should Read This Year - Jarvee","description":"If you work in social media, or you are an entrepreneur trying to promote your business, these books are for you!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/","og_locale":"en_US","og_type":"article","og_title":"10 Books Social Media Marketers Should Read This Year - Jarvee","og_description":"If you work in social media, or you are an entrepreneur trying to promote your business, these books are for you!","og_url":"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/","og_site_name":"Jarvee","article_published_time":"2018-01-21T10:48:21+00:00","article_modified_time":"2018-01-28T12:57:33+00:00","og_image":[{"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/positioning-book.jpg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/positioning-book.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/positioning-book.jpg","width":500,"height":579},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#webpage","url":"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/","name":"10 Books Social Media Marketers Should Read This Year - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#primaryimage"},"datePublished":"2018-01-21T10:48:21+00:00","dateModified":"2018-01-28T12:57:33+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"description":"If you work in social media, or you are an entrepreneur trying to promote your business, these books are for you!","breadcrumb":{"@id":"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/10-books-social-media-marketers-should-read-this-year\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"10 Books Social Media Marketers Should Read This Year"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2557"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=2557"}],"version-history":[{"count":10,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2557\/revisions"}],"predecessor-version":[{"id":2617,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2557\/revisions\/2617"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=2557"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=2557"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=2557"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}