{"id":2571,"date":"2018-01-19T18:37:22","date_gmt":"2018-01-19T18:37:22","guid":{"rendered":"https:\/\/jarvee.com\/?p=2571"},"modified":"2018-01-19T18:37:22","modified_gmt":"2018-01-19T18:37:22","slug":"use-hashtags-facebook-twitter-g-pinterest-instagram","status":"publish","type":"post","link":"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/","title":{"rendered":"Why And HOW To Use Hashtags On Facebook, Twitter, G+, Pinterest And Instagram"},"content":{"rendered":"<p>You might have seen the infamous hastag (#) around, it started to show up on all the social sites, because as soon as they saw it was a good idea all of them implemented it. There are many ways it can be used and most people use it for its entertainment purpose of just to search for something they are interested in. However, if used correctly and constantly it can be of great help to your business and over time your posts will start bringing in a lot more targeted traffic and interested customers.<\/p>\n<p>So, it&#8217;s a good thing that the permanent evolution of social media and the internet has thought about this new method of giving Facebook, Instagram and not only, a different perspective!<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/use-the-hashtag.png\" alt=\"use-the-hashtag\" width=\"369\" height=\"236\" class=\"aligncenter size-full wp-image-2572\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/use-the-hashtag.png 369w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/use-the-hashtag-300x192.png 300w\" sizes=\"(max-width: 369px) 100vw, 369px\" \/><\/p>\n<p><strong>The hashtag<\/strong> is the best tool to find out what your followers care to be informed of. It is ordinarily associated with Twitter but used as often by other social networks and sites. It shows us exactly the news we care to be aware of, in real time as the event takes place.<\/p>\n<p>A hashtag is a word or phrase prefixed with the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Number_sign\" target=\"_blank\">number sign (&#8220;#&#8221;)<\/a> as in messages on social networking services such as Facebook, Google+, Instagram, Twitter, or VK where they can be tagged by entering &#8220;#&#8221; before them, or as they appear in a sentence, for example &#8220;New performers announced for #2014 MTV Music Awards&#8221;.<\/p>\n<p>A search for the hashtag brings back a set of results connected to it, by its contain. A hashtag cannot be linked to pictures or messages from different platforms.<\/p>\n<p>For those who have firstly heard now of the HASHTAG it would be &#8220;interesting&#8221; to hear that they are off the map J because due to its worldwide use, the word &#8220;hashtag&#8221; was even added to the <a href=\"http:\/\/www.oed.com\/\" target=\"_blank\">Oxford English Dictionary<\/a> in June 2014.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/the-tampa-bay-social-media-command-center.png\" alt=\"the-tampa-bay-social-media-command-center\" width=\"295\" height=\"273\" class=\"aligncenter size-full wp-image-2573\" \/><\/p>\n<p>The number sign (which is another name for hashtag) first appeared in 1970 to underline a special meaning, then, it was used with IRC networks to label groups and topics. This number inspired <a href=\"https:\/\/twitter.com\/chrismessina\" target=\"_blank\">Chris Messina<\/a> to propose the system to be used on <strong>Twitter<\/strong> to tag different persons or subjects of interest. Since 2009 Twitter began to hyperlink in tweets to Twitter search results for the hashtagged word.<\/p>\n<p>The quantity of it is evenly important as the type of hashtags we use. Two hashtags are considered enough when adding a location to the discussion. Three hashtags are too much. Twitter warns that adding hashtags to unrelated tweets, could cause an account to be even suspended. Instagram on the other hand allows up to 30 hashtags to be used with any image you post. That doesn&#8217;t mean your followers would like that though.<\/p>\n<p>For the non-believers I have some good points supporting this idea of &#8220;hashtag&#8221;:<\/p>\n<p><strong>1. I can use it as a listening tool to track a conversation<\/strong> which I am interested in and also to merge with other people’s interests, this allowing you to find your way to blend in more easily. This could also be a way to help yourself identify the most important participants.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/using-hastags-to-track-a-conversation.png\" alt=\"using-hastags-to-track-a-conversation\" width=\"393\" height=\"319\" class=\"aligncenter size-full wp-image-2574\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/using-hastags-to-track-a-conversation.png 393w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/using-hastags-to-track-a-conversation-300x244.png 300w\" sizes=\"(max-width: 393px) 100vw, 393px\" \/><\/p>\n<p>To understand better – figure yourself before a meeting with an important client.<\/p>\n<p>What do you do?<\/p>\n<p>You <a href=\"https:\/\/www.google.com\/\" target=\"_blank\"><strong>Google<\/strong><\/a> the person and not at the least the company he works for;<\/p>\n<p>You try to find similarities or even common ground with the person of interest;<\/p>\n<p>You look into his prior activities;<\/p>\n<p>You keep in mind his weaknesses and try to combine all these into a beautiful exposing of the facts when taking stand in a discussion or when trying to loosen up a tense situation<\/p>\n<p><strong>2. I can find out where my subject is heading to in a discussion and for how long it stays active. <\/strong>Let&#8217;s say for example that my activity is placed in the tourism field and I want to be found all over the world with the best offers and services promoted, I can hashtag my efforts by pin-pointing an event taking place at my place of work, as per example – new wellness club available services, on <strong>Facebook.<\/strong><\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/try-the-new-wellness-club-hastag.png\" alt=\"try-the-new-wellness-club-hastag\" width=\"468\" height=\"273\" class=\"aligncenter size-full wp-image-2575\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/try-the-new-wellness-club-hastag.png 468w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/try-the-new-wellness-club-hastag-300x175.png 300w\" sizes=\"(max-width: 468px) 100vw, 468px\" \/><\/p>\n<p><strong>3. I can detect negative perception and meet the clients expectations<\/strong><\/p>\n<p>By using my hashtag, I’ll be able to see negative reaction, questions, or I could simply debate over my post being able to involve targeted people for changing their perspective. Each one of the above can be very useful in my research or feed-back.<\/p>\n<p>I can influence by sending positive signals on a message that is dangerously influenced by negative opinions.<\/p>\n<p>I can state my point in a positive attitude and try to change people’s first impressions<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/influence-people-with-a-positive-attitude-using-hastags.png\" alt=\"influence-people-with-a-positive-attitude-using-hastags\" width=\"405\" height=\"230\" class=\"aligncenter size-full wp-image-2576\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/influence-people-with-a-positive-attitude-using-hastags.png 405w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/influence-people-with-a-positive-attitude-using-hastags-300x170.png 300w\" sizes=\"(max-width: 405px) 100vw, 405px\" \/><\/p>\n<p><strong>Take care though<\/strong> You may find yourselves in weird situations if you don’t do your research thoroughly and the effect can be even more than weird, actually really and not solely embarrassing.<\/p>\n<p>To understand what I mean I bring to your attention the example of DiGiornno’s hashtag fail on Twitter, the company posted a commercial for selling pizza, without researching a little before and used a hashtag   that was commonly used for domestic violence. The result came down on them as a lightning and they had to apologize all night for not doing their homework properly and for committing such a damaging error in a blink of an eye. See bellow the extras:<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/digiorno-twitter-hastag-fail.png\" alt=\"digiorno-twitter-hastag-fail\" width=\"392\" height=\"305\" class=\"aligncenter size-full wp-image-2577\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/digiorno-twitter-hastag-fail.png 392w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/digiorno-twitter-hastag-fail-300x233.png 300w\" sizes=\"(max-width: 392px) 100vw, 392px\" \/><\/p>\n<p>So it’s simple… but not less important by its simplicity! Other brands have made this mistake and endured a social media pressure and exposure, effects damaging their image and reputation pretty snappy.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/research-what-the-hastag-is-about-before-using-it.png\" alt=\"research-what-the-hastag-is-about-before-using-it\" width=\"390\" height=\"491\" class=\"aligncenter size-full wp-image-2578\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/research-what-the-hastag-is-about-before-using-it.png 390w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/research-what-the-hastag-is-about-before-using-it-238x300.png 238w\" sizes=\"(max-width: 390px) 100vw, 390px\" \/><\/p>\n<p>Second of all, remember that it is most important and it is a part of the process, to apologize immediately and honestly! It makes the hit being picked up with less intensity and force, let’s say – like using a silencer.<\/p>\n<p>These hashtags are free shortcuts and quick navigating tools on the social web. Just put them to work! Their purpose is to be snipers and to take their best shots at the targets involved.<\/p>\n<p>Train your brain to use 1-2 #Hashtags in all your social posts and you will soon notice the difference in your account&#8217;s reach and activity<\/p>\n<p>There are the hashtags that a lot of people use and there are brand ones or just ones invented by individuals that never took off. Don&#8217;t let this put you off coming up with your own unique one though. Mix it up, try using some of the most used ones along with one that is your brand name or your invention.  The most commonly used hashtags on <a href=\"http:\/\/instagram.com\/\" target=\"_blank\">Instagram<\/a> for example, are: #love (664,559,278), #instagood (301,923,656), #me (285,515,784), #tbt (257,637,034), #follow (248,197,245) and the list can go on but it would become boring for you to follow up with all of them so I resume to these first from the Top Five.<\/p>\n<p>Use hashtags on all your social media accounts, each is different, each can help you in a different way. Did you know that <strong>Pinterest<\/strong> generates four times more money per click than Twitter?<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/pinterest-generates-4-times-more-money-per-click-than-twitter.jpg\" alt=\"pinterest-generates-4-times-more-money-per-click-than-twitter\" width=\"236\" height=\"190\" class=\"aligncenter size-full wp-image-2579\" \/><\/p>\n<p><strong>Pinterest hashtags are different from other social networks… but why?<\/strong><\/p>\n<p>First, Hashtags are only clickable in a Pin description. It will do no good putting them in your username or board titles<\/p>\n<p>Hashtags behave like keywords to bring all of the Pins using the same hashtag together. They are most effective when they’re unique to your brand.<\/p>\n<p>Using a unique hashtag, may help track some of your Pins.<\/p>\n<p>Pinterest search supports hashtags but with one amendment: for example, if you search a hashtag like #apples you will have results with this word showing in the description but also results pointing to URL\/pages tied to the Pin. It’s important to consider this when you’re naming your images and pages.<\/p>\n<p><strong>How does this information affect your future activity on social networks and how do you plan to use the hashtags here, knowing now the mechanism of its functioning?<\/strong><\/p>\n<p>Let’s quickly foray amongst the sites, just to make a general image about the most common social networks activities and their hashtags usability: for starters I can offer some assistance by posting this short tutorial from <strong>Youtube<\/strong>. It won’t take long and it will be very helpful, a lot of good tips in a very shot time, packed with goodies.<br \/>\n<iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/mNRdqhM_jWI?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p>On <strong>Vine<\/strong>, a <a href=\"http:\/\/bits.blogs.nytimes.com\/2013\/06\/03\/vine-twitters-new-video-tool-hits-13-million-users\/\">13 million users<\/a> site, hashtags like #howto, #loop and #magic are like mottos: everyone starts out using them.<\/p>\n<p>On <strong>Tumblr <\/strong>you can just create a post and then enter the tags, as in the image bellow -very easy and rewarding I might say. Here, posts have a special “Tag” section where you can enter tags. The hash symbol is inserted automatically. Hashtags included in the main content of a post do not become links automatically.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/how-to-use-hashtags-on-tumblr.png\" alt=\"how-to-use-hashtags-on-tumblr\" width=\"423\" height=\"269\" class=\"aligncenter size-full wp-image-2580\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/how-to-use-hashtags-on-tumblr.png 423w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/how-to-use-hashtags-on-tumblr-300x191.png 300w\" sizes=\"(max-width: 423px) 100vw, 423px\" \/><\/p>\n<p><strong>Flickr <\/strong>allows you to bring up to 75 tags to a single photo or video. That&#8217;s a lot, but if they allow so many it could be useful to use them sometimes in your uploads. Test it out and see how it goes.<\/p>\n<p>If you can to go for the most commonly used hastags, you can use <a href=\"https:\/\/www.hashtags.org\/\" target=\"_blank\">this site here<\/a> to help you find powerful hashtags that will generate traffic. There are also a lot of other sites like it that do the same thing, if you&#8217;re already using one and like it you can stick with it.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/flickr-logo-made-out-of-@.png\" alt=\"flickr-logo-made-out-of-@\" width=\"451\" height=\"145\" class=\"aligncenter size-full wp-image-2581\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/flickr-logo-made-out-of-@.png 451w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/flickr-logo-made-out-of-@-300x96.png 300w\" sizes=\"(max-width: 451px) 100vw, 451px\" \/><\/p>\n<p>Kickstarter brings you statistics on how the hashtags are used. See bellow where you can find the quotes on their site<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/stats-about-kickstarter-and-using-it.png\" alt=\"stats-about-kickstarter-and-using-it\" width=\"374\" height=\"382\" class=\"aligncenter size-full wp-image-2582\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/stats-about-kickstarter-and-using-it.png 374w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/stats-about-kickstarter-and-using-it-294x300.png 294w\" sizes=\"(max-width: 374px) 100vw, 374px\" \/><\/p>\n<p>For a <a href=\"http:\/\/mashable.com\/social-media\/\">social media<\/a> novice, like many today, hashtags may seem confusing but they are actually necessary and helping to ease your involvement and for your quick theoretical instruction. They belong to the way we communicate online, and it is important to know how to use them, plus, they can be a lot of fun.<\/p>\n<p>With this beginner&#8217;s guide, you will be using hashtags like a professional in no time.<\/p>\n<p>To conclude all the above let’s have a final overview on the discussed aspects and let’s point out the major issues in &#8220;hashtagging&#8221;:<\/p>\n<p><strong>1. Remember<\/strong>: Spaces are a definite no-no, even if your hashtag contains multiple words – just stick them together and only use CAPITAL letters at the beginning of words<\/p>\n<p><strong>2. Acknowledge<\/strong>: Numbers are supported but punctuation marks are not, therefore exclamation points, question marks, commas, periods and apostrophes are out of the question. Not to mention all the others punctuation forms…<\/p>\n<p><strong>3. Keep in mind<\/strong>: The @ symbol does something completely different. On Twitter if used before a person’s handle will redirect you directly to him also informing that he has been contacted by you. A hashtag will not do this.<\/p>\n<p>So if you are trying to reach someone directly, don’t use a hashtag.<\/p>\n<p><strong>4. Get creative<\/strong>: There is no definite list of hashtags. Just create a brand new hashtag simply by putting the hash before a phrase or word, and if it hasn&#8217;t been used before<em> &#8211; <\/em><em>what do you know<\/em>! &#8211; You have your own hashtag created. Isn’t it nice?<\/p>\n<p><strong>5. And do not forget<\/strong>. These hashtags were created mainly for entertainment purposes, but can be extremely powerful if you put them to work for you.<\/p>\n<p>Finishing off in a humorous note, check out this funny video about over using hashtags:<\/p>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/trn8f8-wTag?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p>How about you? Are you using hashtags or not? Did this make up your mind on their importance and will you start to use them? Share your thoughts on the matter and also your own personal creation ( what&#8217;s #yourownhastag) ?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You might have seen the infamous hastag (#) around, it started to show up on all the social sites, because as soon as they saw it was a good idea all of them implemented it. There are many ways it can be used and most people use it for its entertainment purpose of just to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2574,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[23],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How and why to use hashtags on your favorite Social Platforms<\/title>\n<meta name=\"description\" content=\"Check out what all the fuss is about the hastags, what they&#039;re useful for and why you should use them. They&#039;re easy to use and really make a difference!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How and why to use hashtags on your favorite Social Platforms\" \/>\n<meta property=\"og:description\" content=\"Check out what all the fuss is about the hastags, what they&#039;re useful for and why you should use them. They&#039;re easy to use and really make a difference!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-01-19T18:37:22+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/using-hastags-to-track-a-conversation.png\" \/>\n\t<meta property=\"og:image:width\" content=\"393\" \/>\n\t<meta property=\"og:image:height\" content=\"319\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/using-hastags-to-track-a-conversation.png\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/using-hastags-to-track-a-conversation.png\",\"width\":393,\"height\":319,\"caption\":\"using-hastags-to-track-a-conversation\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#webpage\",\"url\":\"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/\",\"name\":\"How and why to use hashtags on your favorite Social Platforms\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#primaryimage\"},\"datePublished\":\"2018-01-19T18:37:22+00:00\",\"dateModified\":\"2018-01-19T18:37:22+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"description\":\"Check out what all the fuss is about the hastags, what they're useful for and why you should use them. They're easy to use and really make a difference!\",\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Why And HOW To Use Hashtags On Facebook, Twitter, G+, Pinterest And Instagram\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How and why to use hashtags on your favorite Social Platforms","description":"Check out what all the fuss is about the hastags, what they're useful for and why you should use them. They're easy to use and really make a difference!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/","og_locale":"en_US","og_type":"article","og_title":"How and why to use hashtags on your favorite Social Platforms","og_description":"Check out what all the fuss is about the hastags, what they're useful for and why you should use them. They're easy to use and really make a difference!","og_url":"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/","og_site_name":"Jarvee","article_published_time":"2018-01-19T18:37:22+00:00","og_image":[{"width":393,"height":319,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/using-hastags-to-track-a-conversation.png","type":"image\/png"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/using-hastags-to-track-a-conversation.png","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/using-hastags-to-track-a-conversation.png","width":393,"height":319,"caption":"using-hastags-to-track-a-conversation"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#webpage","url":"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/","name":"How and why to use hashtags on your favorite Social Platforms","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#primaryimage"},"datePublished":"2018-01-19T18:37:22+00:00","dateModified":"2018-01-19T18:37:22+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"description":"Check out what all the fuss is about the hastags, what they're useful for and why you should use them. They're easy to use and really make a difference!","breadcrumb":{"@id":"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/use-hashtags-facebook-twitter-g-pinterest-instagram\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Why And HOW To Use Hashtags On Facebook, Twitter, G+, Pinterest And Instagram"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2571"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=2571"}],"version-history":[{"count":1,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2571\/revisions"}],"predecessor-version":[{"id":2583,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2571\/revisions\/2583"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/2574"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=2571"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=2571"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=2571"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}