{"id":2619,"date":"2018-02-02T19:13:48","date_gmt":"2018-02-02T19:13:48","guid":{"rendered":"https:\/\/jarvee.com\/?p=2619"},"modified":"2018-02-02T19:13:48","modified_gmt":"2018-02-02T19:13:48","slug":"thoughts-social-media-advertising","status":"publish","type":"post","link":"https:\/\/jarvee.com\/thoughts-social-media-advertising\/","title":{"rendered":"Thoughts About Social Media Advertising"},"content":{"rendered":"<p>by: Bratulescu Valentin<\/p>\n<p>It is no longer a secret that today’s marketing campaigns cannot be successful without the inclusion of digital advertising. Today, every business organization will mention its social media pages as its primary contact detail. This has not only revolutionized the media industry but also chatted a different path for digital advertisement. According to eMarketer (2017), the expenditure on newspaper advertisements was overtaken by the Internet advertisements in the year 2013. In the year 2016, for instance, the United States alone spent approximately $72.09 billion on digital ads. This figure is expected to surpass $113 billion by 2020 (eMarketer, 2017). Based on these figures, it is apparent that social media advertising is fast edging out the traditional modes of advertisements. Indeed, the world of advertising is headed for interesting times.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising.jpg\" alt=\"thoughts on social media advertising\" width=\"896\" height=\"494\" class=\"aligncenter size-full wp-image-2621\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising.jpg 896w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising-300x165.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising-768x423.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising-600x331.jpg 600w\" sizes=\"(max-width: 896px) 100vw, 896px\" \/><\/p>\n<p>Many social media users will agree that one of the most influential players in digital advertisement is Facebook, a clear testimony that social media advertising has indeed occupied the front seat in the world of digital advertisements. As a matter of fact, Facebook captures 35.4% of the overall display of advertising expenditure in the United States. In the third quarter of 2016, the total Facebook revenue from social ads was $6.8 billion (eMarketer, 2017). Twitter and Snapchat brought in $545 million and $367 million social media advertising revenue respectively over the same period (eMarketer, 2017). It is therefore, possible to conclude that businesses are heavily investing in social media advertising platforms now than ever before (Khang, Ki, &amp; Ye, 2012).<\/p>\n<p>Social media advertising is the art of using social networking sites such as Facebook, Twitter, Instagram, and Snapchat to enhance visibility and engage audience. Advertisers usually leverage on the demographic information of users before targeting their advertisements appropriately. To be effective, social media advertising must combine the present options of targeting such as behavioral, socio-psychographic, and geotargeting to get detailed information about the targeted group. This kind of advertising allows the distribution of ads to users in accordance with the information collected from the profiles of the targeted groups. Therefore, it can be concluded that social media advertising can only work for those businesses that have developed the appropriate strategies for the ads (Khang, et. al, 2012).<\/p>\n<p>Businesses use social media advertising to locate new potential clients by relying on the information shared by users themselves to identify their interests. Unlike paid search on websites that reactively target users who search certain terms, social media advertising targets relevant users proactively even before they commence their search. In simple terms, social networks rely on the behavior of users to develop an advertisement strategy for them. This is achieved through the use of various unique features such as advanced options of targeting, reliable tracking conversion, and prevalence on mobile devices that social networks possess. This enhances their convenience to advertisers (Quesenberry, 2016). From the foregoing it is apparent that the behavior of social media users in their various platforms determines consumer preferences, which advertisers seek to exploit.<\/p>\n<h2><center>Advanced Targeting Options<\/center><\/h2>\n<p>There is no denying that social media networks are capable of gathering huge amounts of user data as compared to other online platforms. Therefore, social media advertising can target a business’ audience using broader and diverse ways. It has stretched beyond geographic data and general demographics to open up doors to connection and behavioral-based targeting methods and thereby creating deeper interests. Apparently, the advanced targeting options enhance the relevance of a business’ ads to its users. Additionally, it offers a personalization level that other advertising channels cannot achieve. According to Quesenberry (2016), there are four options for advanced targeting. They include interest targeting, connection or behavioral targeting, custom targeting and look-alike targeting.<\/p>\n<h3>Interest Targeting <\/h3>\n<p>This is meant to reach particular audiences by examining their activities, skills, and interests that they have reported themselves. The pages that the users have engaged with are also fundamental aspects of their interests. Apparently, interest targeting is usually akin to keyword targeting, and this explains why some platforms allow the entering of both. Facebook, Twitter, LinkedIn, and Pinterest all offer interest ranging from general such as the automobile industry to a specific product like the convertibles (Taşkıran &amp; Yilmaz, 2015). Therefore, it can be concluded that the manner in which social media users engage online is fundamental for the decision-making processes of advertisers.<\/p>\n<h3>Connection or Behavioral Targeting<\/h3>\n<p>Behavioral targeting is where a business can reach clients based on their behaviors of purchasing or intents of device usage. Connection targeting allows a company to reach people who share some particular connection to the business’ app, event, page, or group. These two targeting types rely on the past behavior to assist in determining a user’s intent. Facebook, Twitter, Instagram, and LinkedIn provide this (Okazaki &amp; Taylor, 2013). Thus, social media has succeeded in building virtual communities where people meet to share a lot. Smart advertisers have turned these communities as market places.<\/p>\n<h3>Custom Targeting<\/h3>\n<p>This is where a business uploads a list of phone numbers, usernames, email addresses, and users’ IDs to reach its audiences. Facebook refers to its custom targeting as Custom Audiences while Twitter refers to it as Tailored Audience. Both rely on the same idea, which portends that, if a firm has a known group of audiences it would like to target, it only uploads them and aim at them directly as long as the social media network can match the uploaded data with their actual profiles. This is mainly provided for by Facebook and Twitter (Okazaki &amp; Taylor, 2013).<\/p>\n<h3>Lookalike Targeting<\/h3>\n<p>This one is used to reach people who share similar characteristics with those that a business’ audiences have interest in. With Lookalike targeting, a company can extend its custom audience to reach similar and new users. Indeed, lookalike targeting is ideal for companies that are out to expand their horizons through the acquisition of new clients through the use of social media advertising. It is primarily offered by Facebook and LinkedIn (Okazaki &amp; Taylor, 2013). However, not all audiences with lookalike features on social media have the same interests and tastes. This might not be a so convincing approach.<\/p>\n<h2><center>Improved Conversion Tracking<\/center><\/h2>\n<p>The new options for targeting users opens up more doors for tracking the performance of a business’ campaign of social media advertising. Indeed, investments in social media advertisements should bring forth fruits to justify the expenditure. Incidentally, these fruits could only be realized if appropriate tracking is done. Whereas there exist many ads success measurements methods such as pay-per-click, the website conversion tracking is the one that is mostly used by social media networks. If social media advertisements are configured appropriately, they have the potential of driving a user to take up some actions that are measurable. This can include registering for an event or purchasing a product. The users can then proceed and report on the effectiveness of the advertisement contributed to driving such conversions (Taşkıran &amp; Yilmaz, 2015).<\/p>\n<p>For conversion tracking to be effective, a business must add a snippet of code to its website’s page from where the conversion will occur. This implies that some amount of extra effort and technical ability would be required for this. This will allow for the attribution of all conversions on that particular page upon which the business runs its adverts. Through conversion tracking, a company becomes smarter about the amount of money it spends on its adverts and strategy. It is a waste of investments for an advertisement to receive a lot of clicks but without conversions. Clicks are apparently being paid for. Conversion tracking delivers information that will allow business people to optimize their copy of adverts and targeting in a better way (Frandsen, Walters, &amp; Ferguson, 2014). From this observation, it is possible to infer that social media advertising strategies must be tracked to ensure that they deliver results that they were intended for.<\/p>\n<h2><center>Mobile Dominance<\/center><\/h2>\n<p>In the United States, 60% of time spent on digital media is done through tablets and smartphones (eMarketer, 2017). This means that the next big movement in the world of digital advertisements will be to reach users with mobile devices. Apparently, the most appropriate native option towards this endeavor is social media advertising. Mobile phone or tablet users are also spending many hours a day checking their Facebook, Twitter, LinkedIn, Instagram, Pinterest, and Snapchat. Therefore, advertising to them within these social media platforms is one of the most appropriate ways of reaching them without disrupting their activities. Luckily, all these social media platforms have developed mobile apps that enhance users’ convenience and experiences. Indeed, available data back this fact. In the year 2014, mobile advertising accounted for 68 and 84% of Facebook and Twitter revenues respectively (Quesenberry, 2016).<\/p>\n<p>Based on the observations laid here above, it is now evident that social media advertisements have several advantages. I, therefore, call upon any serious business person to leverage on it. Some of these benefits include easy to track campaigns, ability to use customer information to drive conversions and traffic, guaranteed return on investments on individual campaigns, and a wide variety of targeting options. Targeting options include likes, income brackets, age, location, and interests. Besides, as compared with other mediums for advertising, social media are very cheap (Taşkıran &amp; Yilmaz, 2015).<\/p>\n<p>On the flipside, social media advertisements have their own downside too. Incidentally, majority of the audiences on social media platforms are usually irrelevant ones. This means if you misconstrue your many followers on Twitter, for instance, as potential clients for your products, you may end wasting funds on ads. Additionally, although adverts are easy to create, when they are left without tracking their performance, the business can run into losses. Incidentally, a lot of time and attention is required for social media advertising to maximize results. Moreover, potential customers could be turned off if an advert is shown too much and early. This is referred to as ad fatigue. Besides, social media advertising requires upfront and huge investments in terms of figuring out the content, copy and visuals combination (Okazaki &amp; Taylor, 2013). From the foregoing, it is clear that, although social media advertising comes with several advantages, we must also take utmost care and thorough research when using social networks for advertisements.<\/p>\n<p>&nbsp;<\/p>\n<h3>References<\/h3>\n<p>eMarketer. (2017, Mar. 20). Advertisers Investing More in Facebook, Natch: Instagram, LinkedIn are also seeing increases in social ad spending. <em>eMarketer<\/em>. Retrieved from: <a href=\"https:\/\/www.emarketer.com\/Article\/Advertisers-Investing-More-Facebook-Natch\/1015463\">https:\/\/www.emarketer.com\/Article\/Advertisers-Investing-More-Facebook-Natch\/1015463<\/a><\/p>\n<p>Frandsen, M., Walters, J., &amp; Ferguson, S. G. (2014). Exploring the Viability of Using Online Social Media Advertising as a Recruitment Method for Smoking Cessation Clinical Trials. <em>Nicotine &amp; Tobacco Research, 16 (2)<\/em>, 247–251. doi: 10.1093\/ntr\/ntt157<\/p>\n<p>Khang, H., Ki, E.-J., &amp; Ye, L. (2012). Social Media Research in Advertising, Communication, Marketing, and Public Relations, 1997–2010. <em>Journalism &amp; Mass Communication Quarterly, 89(2)<\/em>. <a href=\"http:\/\/journals.sagepub.com\/doi\/abs\/10.1177\/1077699012439853\">http:\/\/journals.sagepub.com\/doi\/abs\/10.1177\/1077699012439853<\/a><\/p>\n<p>Okazaki, S., &amp; Taylor, C. R. (2013). Social media and international advertising: theoretical challenges and future directions. <em>International Marketing Review, 30(1)<\/em>, 56-71. <a href=\"http:\/\/www.emeraldinsight.com\/doi\/abs\/10.1108\/02651331311298573\">http:\/\/www.emeraldinsight.com\/doi\/abs\/10.1108\/02651331311298573<\/a><\/p>\n<p>Quesenberry, K. A. (2016). <em>Social media strategy: marketing and advertising in the consumer revolution.<\/em> Lanham: Rowman &amp; Littlefield. <a href=\"http:\/\/www.worldcat.org\/title\/social-media-strategy-marketing-and-advertising-in-the-consumer-revolution\/oclc\/921249578\">http:\/\/www.worldcat.org\/title\/social-media-strategy-marketing-and-advertising-in-the-consumer-revolution\/oclc\/921249578<\/a><\/p>\n<p>Taşkıran, N. O., &amp; Yilmaz, R. (2015). <em>Handbook of research on effective advertising strategies in the social media age.<\/em> Hershey, PA: Business Science Reference. <a href=\"https:\/\/books.google.co.ke\/books?id=32fCCAAAQBAJ&#038;printsec=frontcover&#038;dq=Handbook+of+research+on+effective+advertising+strategies+in+the+social+media+age&#038;hl=en&#038;sa=X&#038;ved=0ahUKEwjW4eTPr4LZAhUIBcAKHXuxDmQQ6AEIJzAA#v=onepage&#038;q=Handbook%20of%20research%20on%20effective%20advertising%20strategies%20in%20the%20social%20media%20age&#038;f=false\">https:\/\/books.google.co.ke\/books?id=32fCCAAAQBAJ<\/a><\/p>\n<hr>\n<p><strong>NOTE:<\/strong> This is the winning article of our <a href=\"https:\/\/jarvee.com\/jarvee-coms-essay-writing-competition\/\">Essay Writing Competition<\/a>. Congratulations Bratulescu Valentin, from &#8220;Liceul Elena Cuza, Bucuresti&#8221; and thank you for participating and contributing with such a great article! We&#8217;ll contact you shortly with more details on how to receive the prize.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>by: Bratulescu Valentin It is no longer a secret that today’s marketing campaigns cannot be successful without the inclusion of digital advertising. Today, every business organization will mention its social media pages as its primary contact detail. This has not only revolutionized the media industry but also chatted a different path for digital advertisement. According [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2621,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[23],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Thoughts About Social Media Advertising - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/thoughts-social-media-advertising\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Thoughts About Social Media Advertising - Jarvee\" \/>\n<meta property=\"og:description\" content=\"by: Bratulescu Valentin It is no longer a secret that today’s marketing campaigns cannot be successful without the inclusion of digital advertising. Today, every business organization will mention its social media pages as its primary contact detail. This has not only revolutionized the media industry but also chatted a different path for digital advertisement. According [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/thoughts-social-media-advertising\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-02T19:13:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"896\" \/>\n\t<meta property=\"og:image:height\" content=\"494\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising.jpg\",\"width\":896,\"height\":494,\"caption\":\"thoughts on social media advertising\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#webpage\",\"url\":\"https:\/\/jarvee.com\/thoughts-social-media-advertising\/\",\"name\":\"Thoughts About Social Media Advertising - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#primaryimage\"},\"datePublished\":\"2018-02-02T19:13:48+00:00\",\"dateModified\":\"2018-02-02T19:13:48+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/thoughts-social-media-advertising\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Thoughts About Social Media Advertising\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Thoughts About Social Media Advertising - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/thoughts-social-media-advertising\/","og_locale":"en_US","og_type":"article","og_title":"Thoughts About Social Media Advertising - Jarvee","og_description":"by: Bratulescu Valentin It is no longer a secret that today’s marketing campaigns cannot be successful without the inclusion of digital advertising. Today, every business organization will mention its social media pages as its primary contact detail. This has not only revolutionized the media industry but also chatted a different path for digital advertisement. According [&hellip;]","og_url":"https:\/\/jarvee.com\/thoughts-social-media-advertising\/","og_site_name":"Jarvee","article_published_time":"2018-02-02T19:13:48+00:00","og_image":[{"width":896,"height":494,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/thoughts-on-social-media-advertising.jpg","width":896,"height":494,"caption":"thoughts on social media advertising"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#webpage","url":"https:\/\/jarvee.com\/thoughts-social-media-advertising\/","name":"Thoughts About Social Media Advertising - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#primaryimage"},"datePublished":"2018-02-02T19:13:48+00:00","dateModified":"2018-02-02T19:13:48+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/thoughts-social-media-advertising\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/thoughts-social-media-advertising\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Thoughts About Social Media Advertising"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2619"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=2619"}],"version-history":[{"count":7,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2619\/revisions"}],"predecessor-version":[{"id":2629,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2619\/revisions\/2629"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/2621"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=2619"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=2619"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=2619"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}