{"id":2673,"date":"2018-02-10T03:20:44","date_gmt":"2018-02-10T03:20:44","guid":{"rendered":"https:\/\/jarvee.com\/?p=2673"},"modified":"2019-07-31T10:50:47","modified_gmt":"2019-07-31T10:50:47","slug":"social-medias-influence-todays-youth","status":"publish","type":"post","link":"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/","title":{"rendered":"Social Media&#8217;s Influence on Todays Youth"},"content":{"rendered":"<p>by: Clara Watson<\/p>\n<p>Are you are on social media? Are you constantly checking your notifications? You’re probably thinking to yourself, “Duh how else am I supposed to keep in touch with the people I don&#8217;t like enough to talk to in real life.” As a teen, I know social media plays a big part in our lives. Social media is a way for people to connect with each other without actually being there in person. Even though social media is the number one source of pop culture today, it can also be problematic and create negative effects on teenagers’ social, mental, emotional, and physical health.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2674\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth.jpg\" alt=\"social media influence on todays youth\" width=\"787\" height=\"609\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth.jpg 787w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth-300x232.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth-768x594.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth-600x464.jpg 600w\" sizes=\"(max-width: 787px) 100vw, 787px\" \/><\/p>\n<p>A major factor is teens’ obsessive need to always be in touch. With Snapchat, Twitter, Instagram, and even Facebook, teens are in constant communication. While many will argue that it is important to have this connection outside of face-to-face interaction, studies have said that eliminating in-person communication can impair critical social skills. But what does this <em>really<\/em> mean? When teens receive messages via social media, all they see is a screen. They can’t see the person on the other side. They are oblivious to the other person’s reaction. Body language, facial expression, even tone of voice, are removed from the conversation. This is why teens choose to send that risky message or that mean reply, things they wouldn&#8217;t ever say to someone’s face. Of course, this creates a problem. Not only are the simplest parts of communication invisible, but it has become easier and easier to hide behind a mask on social media. Social media allows anyone to be anonymous, identity erased. Cyberbullies can create fakes accounts, which allows the bully to say anything without facing consequences. Statistics say that one half of teens have been victims of bullying online and one third have sent rude or harassing comments via social media, (Teens, Social Media &amp; Technology Overview 2015). When teens don&#8217;t know the person harassing them it is harder to ask for help or tell an adult.<\/p>\n<p>Now, we have talked about how easy it is to hide identity online. If teens can do it, so can that 40 year old guy sitting in his basement. 82% of sexual advances made on minors are over social media. Social media has created no boundaries, (Cyber Safety). With fake accounts and false names, pretty much anyone can &#8220;slide into your dms”. This creates a problem when talking about personal information. When a teenager posts a picture in front of their school, they might not think anything of it, but with one click of a button a predator could know their exact location. While rates of predators online have been decreasing over the past few years, teens have also become more nonchalant about the information they are posting.<\/p>\n<p>Social media is also creating problems in school. Especially when it comes to procrastination. Now, I’ll be the first to admit that I struggled with doing homework. Particularly with starting it. If I could sit down and begin, I could get it done, but I get distracted easily — usually social media is to blame. Research conducted by Stop Procrastination reveals I’m not the only one. Their survey concluded 74% of students polled admitted that social media fueled their procrastination and 64% revealed social media alerts distract them while studying, (Social Media Cited as Largest Source of Procrastination). Not only was social media reported the number one cause of poor work ethic, but 44% of students reported that social media decreased the overall quality of their work. What is even worse, teens often don’t even realize the time they are wasting. They think — “oh let me just check this one notification it will only take a second” —  but 30 mins later they will be 34 weeks into their crushes Instagram trying not to like any pictures. Social media is the number one distraction when it comes to getting homework done.<\/p>\n<p>To magnify the problem, social media also creates a disturbance in the classroom. Teens’ phones are constantly with them. Sometimes resisting the impulse to check their phone can be extremely difficult, even 20 minutes into math class. This creates issues in school when students miss important information due to lack of paying attention.<\/p>\n<p>Studies have shown that the connection teens have to social networking is practically like an addiction. Four out of five users asked, reported negative side effects after being disconnected for 24 hours, (Teens, Social Media &amp; Technology Overview 2015). Today teens feel pressured to be available all the time. Studies say that social media is increasing the rate of anxiety amongst teenagers, anxiety to always maintain constant communication with our peers. We live in a world of hyper-connection. When teenagers feel as if they are out of touch or being ignored they freak out. Not only does the impulse to always be plugged in create anxiety, but what about the content of these networking sites?<\/p>\n<p>Last summer I joined Twitter. I’ll admit I was a bit late to hop on the bandwagon. For those first couple months I used twitter without much thought, every now and then tweeting and retweeting, but then I started getting annoyed. I followed specific things, mostly my friends, a few celebrities, and that occasional relatable post account, but in reality I had no control of what I was scrolling through. I found myself looking at retweet upon retweet of things I didn&#8217;t really care about. Not only that, but I was constantly bombarded ad after ad. It really become a problem when I was wasting my time endlessly scrolling down through junk just to see the few things that mattered to me. Teens have no control over the things posted via social media.<\/p>\n<p>Throughout pop culture, social media is becoming the number one platform for advertising. Companies use social media to market products to teens. Not only are there pop up ads mixed in with networking feeds, but companies are becoming sneakier. Companies have started targeting majorly followed accounts and people on social media, and paying them to subtly advertise their products. Teens might not even know when they are looking at an ad. A big social media star might posts a picture of them wearing all nike with a caption saying, “all ready to run in my new Nike athletic wear”. It’s not the typical format, but it’s exactly the same as looking at a magazine ad. Not only are teens oblivious to the fact that many of these photos are staged, but they don’t realize how well these ads actually work.<\/p>\n<p>Sadly, this can also lead to complications with appearance and body image. Today, teens are hounded through social media with the stereotypes of what they are “supposed” to look like. Stick skinny models, buff men, beautiful faces, flawless skin, etc. These are the types of pictures teens’ see on their social medias. Girls particularly, are more affected by this. Girls are pressured to be perfect, to have perfect hair, perfect smile, perfect clothes, perfect body, etc. Most of these standards are unrealistic, but on social media, unrealistic is not an option. More and more girls, and even guys, are developing eating disorders in order to meet these extreme expectations (Is Social Media Giving Your Teen a Negative Body Image?).  On social media image is <em>everything<\/em>. Mental health of teenagers has been on a downhill spiral since social media was invented.<\/p>\n<p>Depression is also largely influenced by social media. While social media isn&#8217;t always to blame for the roots of depression, it can definitely make things worse. Depression creates feelings of worthlessness, emptiness. It can make it hard to get out of bed in the morning, or to even be around people. Teens with depression often isolate themselves. With social media, isolation becomes easier than ever. A bigger problem arises when social media accounts glamorize depression. While being able to relate to people dealing with the same issues as you is beneficial, often accounts can encourage depression. Social media has redefined mental illness. Eating disorders, depression, self harm, are all uplifted, post after post brainwashing teens with false propaganda. They “say DON’T talk to someone,” “don&#8217;t get help”. This is NOT what teens should be hearing. Mental illness is NOT something to ignore. It’s NOT something to encourage. And it’s definitely NOT something social media should be glamorizing.<\/p>\n<p>While social media has good aspects, it also has a lot of downfalls. Of course, telling teens to sign off of social media all together is impractical, but they do need to pay more attention to the role social media plays in their lives. Teens need to learn how to cope the negative side effects of social media so they can start focusing on the benefits.<\/p>\n<p><strong>Works Cited<\/strong><br \/>\nEhmke, Rachel. &#8220;Get Informed.&#8221; Teens and Social Media. Child Mind Institute. 14 Aug. 2015. Web. 10 Nov. 2015.<\/p>\n<p>Knorr, Caroline. &#8220;Is Social Media Giving Your Teen a Negative Body Image?&#8221; Is Social Media Giving Your Teen a Negative Body Image? Common Sense Media. 28 Apr. 2014. Web. 09 Nov. 2015.<\/p>\n<p>Lenhart, Amanda. &#8220;Teens, Social Media &amp; Technology Overview 2015.&#8221; Pew Research Center. Pew Internet. 9 Apr. 2015. Web. 9 Nov. 2015.<\/p>\n<p>Smith-Walters, Maisie. &#8220;The Fallout from a Social Media Bombshell &#8211; BBC News.&#8221; BBC News. BBC Publisher. 07 Nov. 2015. BBC. Web. 09 Nov. 2015.<\/p>\n<p>Udorie, June Eric. &#8220;Social Media Is Harming the Mental Health of Teenagers.&#8221; The Guardian.<br \/>\nGuardian Publisher Internet. 2014. Web. 03 Dec. 2014<\/p>\n<hr \/>\n<p><strong>NOTE:<\/strong> This is a an article that took part in our <a href=\"https:\/\/jarvee.com\/jarvee-coms-essay-writing-competition\/\">Essay Writing Competition.<\/a> It was selected to be one of the essays that compete for the second prize. Congratulations!<\/p>\n<p><strong>Student details:<\/strong><br \/>\nName: Clara Watson<br \/>\nAge: 17<br \/>\nHigh School Currently Enrolled:Coronado High School<br \/>\nExpected College of Enrollment: Western Washington University<br \/>\nA few words from the author:<\/p>\n<blockquote><p>I chose the subject of &#8220;social media&#8217;s influence on todays youth&#8221; for my essay. I decided to go with this prompt because in my psychology class we are currently learning about social media and teens. I also chose this prompt because as a teen on social media, I have a lot of personal experience in the subject as well. I felt like having first hand experience would add to my ethos when writing my essay. I love the psychology of social media and this prompt was perfect for me because I was able to address multiple aspects rather than some of the other prompts that were more specific. Thank you so much for the this opportunity and your time. It is very nice of your company to offer a scholarship, college is very expensive and any amount helps. I look forward to seeing who wins. Thanks again for the opportunity to participate.<\/p><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>by: Clara Watson Are you are on social media? Are you constantly checking your notifications? You’re probably thinking to yourself, “Duh how else am I supposed to keep in touch with the people I don&#8217;t like enough to talk to in real life.” As a teen, I know social media plays a big part in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2674,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[2,23],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Social Media&#039;s Influence on Todays Youth - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Social Media&#039;s Influence on Todays Youth - Jarvee\" \/>\n<meta property=\"og:description\" content=\"by: Clara Watson Are you are on social media? Are you constantly checking your notifications? You’re probably thinking to yourself, “Duh how else am I supposed to keep in touch with the people I don&#8217;t like enough to talk to in real life.” As a teen, I know social media plays a big part in [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-10T03:20:44+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-07-31T10:50:47+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"787\" \/>\n\t<meta property=\"og:image:height\" content=\"609\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth.jpg\",\"width\":787,\"height\":609,\"caption\":\"social media influence on todays youth\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#webpage\",\"url\":\"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/\",\"name\":\"Social Media's Influence on Todays Youth - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#primaryimage\"},\"datePublished\":\"2018-02-10T03:20:44+00:00\",\"dateModified\":\"2019-07-31T10:50:47+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Social Media&#8217;s Influence on Todays Youth\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Social Media's Influence on Todays Youth - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/","og_locale":"en_US","og_type":"article","og_title":"Social Media's Influence on Todays Youth - Jarvee","og_description":"by: Clara Watson Are you are on social media? Are you constantly checking your notifications? You’re probably thinking to yourself, “Duh how else am I supposed to keep in touch with the people I don&#8217;t like enough to talk to in real life.” As a teen, I know social media plays a big part in [&hellip;]","og_url":"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/","og_site_name":"Jarvee","article_published_time":"2018-02-10T03:20:44+00:00","article_modified_time":"2019-07-31T10:50:47+00:00","og_image":[{"width":787,"height":609,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-influence-on-todays-youth.jpg","width":787,"height":609,"caption":"social media influence on todays youth"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#webpage","url":"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/","name":"Social Media's Influence on Todays Youth - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#primaryimage"},"datePublished":"2018-02-10T03:20:44+00:00","dateModified":"2019-07-31T10:50:47+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/social-medias-influence-todays-youth\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/social-medias-influence-todays-youth\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Social Media&#8217;s Influence on Todays Youth"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2673"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=2673"}],"version-history":[{"count":4,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2673\/revisions"}],"predecessor-version":[{"id":4933,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2673\/revisions\/4933"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/2674"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=2673"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=2673"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=2673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}