{"id":2679,"date":"2018-02-10T17:00:09","date_gmt":"2018-02-10T17:00:09","guid":{"rendered":"https:\/\/jarvee.com\/?p=2679"},"modified":"2018-02-13T03:12:52","modified_gmt":"2018-02-13T03:12:52","slug":"online-democratic-revolution","status":"publish","type":"post","link":"https:\/\/jarvee.com\/online-democratic-revolution\/","title":{"rendered":"An Online Democratic Revolution"},"content":{"rendered":"<p>by: Travis Godfrey<\/p>\n<p>Throughout history, human societies have been faced with challenges and problems of many varieties. Thankfully, on the whole human societies have been ingenious enough to work through problems and reach reasonable solutions. Social media now presents a problem. Social Media has become incredibly powerful and has enormous influence into the lives of billions of people. Human societies are now presented with the problem of how to deal with the power of social media. It may be tempting to think of this as a new problem. However, for millennia thinkers, public men and women, and ordinary citizens have thought and debated how to most fairly order a society, and how to promote the wholesome use of power, rather than the despotic and tyrannical use of power. Social media has outgrown its beginning as a benign communications product and has become immensely powerful, thus requiring democratization.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2680\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution.jpg\" alt=\"an online democratic revolution\" width=\"756\" height=\"389\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution.jpg 756w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution-300x154.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution-600x309.jpg 600w\" sizes=\"(max-width: 756px) 100vw, 756px\" \/><\/p>\n<p>Power is the ability to affect enduring change in one’s surroundings. Superficially, power seems to simply exist in reality. Everyday choices are able to be made by power. Most individuals do not accrue enough power to change anything beyond everyday choices. However, power is not nor has ever been distributed equally throughout human society, and to think that it ever could be distributed equally is illusory. However, there have evolved systems in human society to account for the unequal distributions of power that manifest in human society. Trade is one such system. Through trade, individuals exchange products for products or products for economic power (commonly referred to as capital). Trade represents a human system for extracting benefit from the existence of different types of power in society. Beginning in ancient Athens and the Roman Republic, human society began to experiment with a method to ensure that the concentration of power in kingship or government was as good and as fair as humanly possible. This was called democracy, coming from the Greek <em>demos<\/em> meaning people and <em>kratia<\/em> meaning power. The concept of democracy assumes that in society there is normally a concentration of power vested in something generally called the government. However, democratic ideologies assert that this concentration of power should ultimately be owned by the people of a society, and that this power can only be wielded in the name of the people. The emergence of representative democracy in the West represents the West’s correct identification of the best way to deal with the inevitable concentration of power in a society. Democracy has, in no small way, contributed to the West’s ascendency in science, economic prosperity, and relative well-being compared to the rest of the world and history. The democratic approach to power has had enormously beneficial consequences in the countries and societies in which it was implemented. In an era of demagoguery and a general amnesia about why democracy is worth fighting for, it is important to identify undemocratic concentrations of power and reasonably bring democratization.<\/p>\n<p>Very few things have changed the world in such a relatively small amount of time than social media. Furthermore, very few things in human history have accrued so much power and influence over such a small amount of time like social media has. The essence of social media, particularly in its infancy, is communication. It provided an efficient and exciting way to transmit information about anything to a large amount of people very quickly. All of the recipients of this information could then engage with the originator and with one another reciprocally (sadly this information is often in the genre of late-night intoxicated club photographs, but is nonetheless information). Social media started out like this, as a product, and the social media companies themselves were simply trading the use of their communication services while the consumers (mostly unwittingly) traded for this service by consenting to their exposure to advertising and the collection of their personal data, to personalize the advertising they recieve. The creators of the most popular social media platforms quickly found themselves greatly enriched both financially, and with enormous power. Their power has grown as the presence of social media has become more pervasive. At the beginning, when social media was used mostly for personal communications, the power that social media organizations had consisted of being able to subject each member of the network to special messaging from the platform or use your personal information for advertising purposes. Now however, the role that social media plays in society has vastly outgrown its infantile status as another method of communication. Now, social media is the primary way that hundreds of millions of people get their information about current affairs, business, education, and politics. Social media has also now become of the primary places for public debate to occur. In many instances, social media networks are now the marketplaces of ideas, and speaking of marketplaces, the commercial and economic significance of social media grows daily.<\/p>\n<p>Why is there a need for democratization? Democratization is now manifestly needed because of the power that social media has accrued, particularly concerning fundamental democratic rights. Formerly, the government and the courts were the guardians of, for example, freedom of expression. Now however, because so much expression, speech, and exchange of ideas happens on social media, and considering that the government has very little or no power to protect democratic freedoms as employed on social media, social media networks themselves need to take up the mantle. These organizations do not have the legitimacy to perform these tasks unless they are democratically empowered to make those decisions.<\/p>\n<p>What would a democratized social media look like? Here are a few possibilities to ensure that the control of the power of social media is in the hands of the citizen. Firstly, and to the ire of many conservative-leaning individuals, social media companies could be nationalized. This would mean that social media organizations become state-owned enterprises. However, this is a very problematic proposal. Many of the largest social media networks are not able to be confined to one particular state. If the United States, for example, nationalized Facebook, governments and citizens from all over the world would take offense at the overreach of the United States government into the lives of foreign citizens. Social media is simply too international for any one government to assume ownership, despite having the organization based on its shores. Additionally, the nationalization of social media would dramatically increase the power and influence of the government, something which is also worth avoiding. Furthermore, it is also doubtful whether or not a nationalized social media network would be financially sustainable. Social media organizations have a highly fluid and dynamic product, and thus would not fair well in dense government bureaucracy. Considering also that social media is of the primary places where political debate and the exchange of ideas occur, putting it under control of a government would seem to be at cross-purposes with the desire to have a free and unbiased marketplace of ideas. A government in control of social media would have to fight a strong temptation to manipulate social media for its purposes, electoral or otherwise. Finally, nationalization would not be the best course of action because democratic societies have already been trying to ensure that the privacy of citizens is not unlawfully infringed upon by the government. Opening the door to social media by nationalization would erase personal privacy. Government intervention is not the solution to the undemocratic power concentration in social media.<\/p>\n<p>How then can the democratization of social media come about? The most straightforward proposal, nationalization, obviously will not work. Instead, democratic control of the power of social media can be achieved in a much more direct way. Stated simply, the members of a social media network should become the electorate and positions such as CEO and President should be termly, elected positions. The framework is already in place. Major information technology organizations already have the digital infrastructure to facilitate democratic processes such as elections. In this way, the leadership of the major social media networks would be accountable to the membership&#8211;or electorate&#8211;to ensure the best user experience as desired by the membership<\/p>\n<p>Under such a scheme, social media networks with a membership of over 50 million, would be required to institute a democratization of the leadership in the interests of ensuring that the control of concentrated societal power remains with the citizens. When a network is of sufficient size, the leadership positions would become elected positions, with a term of three or four years. Whether or not any member, or only high ranking employees would have candidacy eligibility would be a matter for the individual networks to determine. However, in the interest of democracy, the most democratic approach would be that any member is eligible to run. Thus, the membership of the network would have control over what kind of social media site it should be<\/p>\n<p>Democracy is one of the greatest discoveries ever made by humankind. Since, its discovery, it has been persistently threatened, and those threats remain today. Social media has accrued enough unaccountable power for it to have become a threat to the democratic functioning of society. Democratization is the solution. All that remains is for the current holders of power to recognize the threat to democracy their organizations present, and facilitate an online democratic revolution.<\/p>\n<hr \/>\n<p><strong>NOTE:<\/strong> This is a an article that took part in our <a href=\"https:\/\/jarvee.com\/jarvee-coms-essay-writing-competition\/\">Essay Writing Competition.<\/a> It was selected to be one of the essays that compete for the second prize. Congratulations!<\/p>\n<p><strong>Student details:<\/strong><br \/>\nName: Travis Godfrey<br \/>\nAge: 20<br \/>\nCurrent University: University of Oxford, Mansfield College. 1st year of study<br \/>\nA few words from the author:<\/p>\n<blockquote><p>I chose the subject of the power of social media because I am increasingly concerned about the unchecked influence that social media organizations have on public debate, the free exchange of ideas, and the kind of information that we are exposed to. I think that if we in society begin to realize this and think about some of the possibilities for amending the problem, we may actually be able to do something.<\/p><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>by: Travis Godfrey Throughout history, human societies have been faced with challenges and problems of many varieties. Thankfully, on the whole human societies have been ingenious enough to work through problems and reach reasonable solutions. Social media now presents a problem. Social Media has become incredibly powerful and has enormous influence into the lives of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2680,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[2],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>An Online Democratic Revolution - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/online-democratic-revolution\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"An Online Democratic Revolution - Jarvee\" \/>\n<meta property=\"og:description\" content=\"by: Travis Godfrey Throughout history, human societies have been faced with challenges and problems of many varieties. Thankfully, on the whole human societies have been ingenious enough to work through problems and reach reasonable solutions. Social media now presents a problem. Social Media has become incredibly powerful and has enormous influence into the lives of [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/online-democratic-revolution\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-10T17:00:09+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-02-13T03:12:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"756\" \/>\n\t<meta property=\"og:image:height\" content=\"389\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/online-democratic-revolution\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution.jpg\",\"width\":756,\"height\":389,\"caption\":\"an online democratic revolution\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/online-democratic-revolution\/#webpage\",\"url\":\"https:\/\/jarvee.com\/online-democratic-revolution\/\",\"name\":\"An Online Democratic Revolution - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/online-democratic-revolution\/#primaryimage\"},\"datePublished\":\"2018-02-10T17:00:09+00:00\",\"dateModified\":\"2018-02-13T03:12:52+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/online-democratic-revolution\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/online-democratic-revolution\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/online-democratic-revolution\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"An Online Democratic Revolution\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"An Online Democratic Revolution - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/online-democratic-revolution\/","og_locale":"en_US","og_type":"article","og_title":"An Online Democratic Revolution - Jarvee","og_description":"by: Travis Godfrey Throughout history, human societies have been faced with challenges and problems of many varieties. Thankfully, on the whole human societies have been ingenious enough to work through problems and reach reasonable solutions. Social media now presents a problem. Social Media has become incredibly powerful and has enormous influence into the lives of [&hellip;]","og_url":"https:\/\/jarvee.com\/online-democratic-revolution\/","og_site_name":"Jarvee","article_published_time":"2018-02-10T17:00:09+00:00","article_modified_time":"2018-02-13T03:12:52+00:00","og_image":[{"width":756,"height":389,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/online-democratic-revolution\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/an-online-democratic-revolution.jpg","width":756,"height":389,"caption":"an online democratic revolution"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/online-democratic-revolution\/#webpage","url":"https:\/\/jarvee.com\/online-democratic-revolution\/","name":"An Online Democratic Revolution - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/online-democratic-revolution\/#primaryimage"},"datePublished":"2018-02-10T17:00:09+00:00","dateModified":"2018-02-13T03:12:52+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/online-democratic-revolution\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/online-democratic-revolution\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/online-democratic-revolution\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"An Online Democratic Revolution"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2679"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=2679"}],"version-history":[{"count":2,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2679\/revisions"}],"predecessor-version":[{"id":2710,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2679\/revisions\/2710"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/2680"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=2679"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=2679"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=2679"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}