{"id":2683,"date":"2018-02-11T17:40:48","date_gmt":"2018-02-11T17:40:48","guid":{"rendered":"https:\/\/jarvee.com\/?p=2683"},"modified":"2018-02-11T17:40:48","modified_gmt":"2018-02-11T17:40:48","slug":"instagram-ads-101-anatomy-winning-ad","status":"publish","type":"post","link":"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/","title":{"rendered":"Instagram Ads 101: The Anatomy of An Winning Ad"},"content":{"rendered":"<p>In case you’re familiar with Facebook Ads, it’s pretty easy to get started with Instagram Ads. <\/p>\n<p>Instagram Ads are in fact run through Facebook’s Advertising platform. So you can’t run ads on Instagram without actually having a Facebook Business Account.<\/p>\n<p>The first question that comes to mind is…<\/p>\n<p><b>Why choose Instagram Ads then, when brands have an impressive organic engagement already?<\/b><\/p>\n<p>First of all, even though impressive compared to other social networks, <b>the organic reach of brands’ posts dropped since the algorithm change adopted by Instagram last year<\/b>. So, even though it is still the most engaging social platform, some of the organic posts of your brand account might be missed by a good part of your followers.<\/p>\n<p>Next, if you want to access a whole bunch of new people overnight, without having to work on growing your account (that usually takes time and dedication), you might want to consider Instagram ads. Growing your account with a huge following and engagement rates can happen very fast if you put in the work, but must certainly will not happen overnight. So if you have a product that you need to get to market quickly, you need to get started with Instagram Ads.<\/p>\n<p>Another benefit of using Instagram Ads is that you can scale up overnight if that’s what you want. If you have an advertising campaign that is working and you want to double the number of people that are seeing your ads, you can do that overnight or from time to time. For example, if you are spending $100 per day on your winning ads today, you can add up and spend $200 per day starting tomorrow, $500 per day starting the day after and so on.<\/p>\n<p>The last advantage of using Instagram Ads is the ability to control who can see your ads. You can choose to show your ad only to 35-year-old women living in San Francisco that like Michael Kors. Or 44-year-old men from Australia interested in golf.<\/p>\n<p>With Instagram Ads, you can target different people with different ads depending on their interests, location, demographic data and so on. You can customize your ads’ message, image or even landing page, to make it more personal, thus more efficient. That’s powerful targeting.<\/p>\n<p>In addition to the reasons mentioned above in favor of using the Instagram Advertising platform to promote your business, we should mention the fact that their advertising platform was already tested and perfected by Facebook. Usually, when a platform is just starting with advertising, they need a lot of testing and improving until they get it right. Not the case for Instagram. Facebook already spent millions of dollars on their advertising platform to make it better.<\/p>\n<h3>How does an Instagram Ad look like?<\/h3>\n<p>I’m sure you’ve seen it on your Instagram feed. You can’t miss it. Since their advertising floodgates opened, Instagram started showing ads once every about six photos or so.<\/p>\n<p>Basically, what makes an Instagram Ad different from a regular post is the “Sponsored” under the username, because all the social platforms are required to disclose their ads, and the CTA button under the image. When you click on the 3-dots button in the upper right corner of the ad, you will see different actions from a normal Instagram post: Hide This and About Instagram Adverts.<\/p>\n<h3>How to create winning Ads?<\/h3>\n<p>Let&#8217;s start by listing the components of an Ad:<\/p>\n<ul>\n<li><b>TARGET<\/b>: who sees your ads<\/li>\n<li><b>MESSAGE<\/b>: what are you showing<\/li>\n<li><b>OFFER<\/b>: what are you offering<\/li>\n<\/ul>\n<p>At the intersection of these 3 is the sweet spot for winning ads. So, to get it right in advertising you need the <b>RIGHT offer with the RIGHT message in front of the RIGHT people<\/b>. If you know your target audience, how to communicate your message and what are their problems or needs, you have all the ingredients for a winning ad. This applies to any type of advertising, on Instagram, Facebook or any other platform.<\/p>\n<p><i>But you need to start with the right mindset…<\/i><\/p>\n<p>You should always remember that no one was born an expert in Instagram Ads. <b>It takes time and experience<\/b>. Every time you do a new campaign you’re adding experience under your belt. So, expect to lose money with your first campaigns. It’s not you, it’s just part of the game.<\/p>\n<p>Just give yourself some time for learning.<\/p>\n<p>Don’t add all your money to the first campaign! Plan ahead, think about the time and the budget you are willing to put in for learning and damage control the situation. Start small and gradually add more money as you are getting more confident in your skills.<\/p>\n<h3>The Offer<\/h3>\n<p>The offer component of an ad is basically a value exchange between you and your prospect customer. To make sure you identify the best offer for your potential customers, you first have to think about what they really want. The truth is that they don’t want to buy things. People don’t want a new dress or a teeth whitening service; they want to feel beautiful. They want to buy the feeling they get when they wear that new dress or when they smile with those perfect teeth.<\/p>\n<p>So first you must identify who your customer is. <b>Who buys your product?<\/b><\/p>\n<p>After you narrow down your potential audience, think about what they want or need. <b>What problem are they having?<\/b><\/p>\n<p>The last step is to figure out how to solve their problem and give them what they want. That is your offer and you need to get it right if you want to have results.<\/p>\n<p>This calls for a bit of research. Google is your friend. You can start by analyzing your competitors and see what types of posts and ads they do.<\/p>\n<h3>The Banner<\/h3>\n<p>The first thing that people will see on the photo-sharing platform about your ad is the banner itself. There are 3 types of Instagram ads depending on the banner type you choose to use: <\/p>\n<ul>\n<li>Instagram photo ads<\/li>\n<li>video ads<\/li>\n<li>and carousel ads.<\/li>\n<\/ul>\n<p>No matter the type of the banner you choose, if you want a significantly high return on your ad spend, they all must comply with the following rules:<\/p>\n<ul>\n<li><b>CLARITY<\/b>: the image alone should make it clear what the ad is about.<\/li>\n<li><b>SIMPLICITY<\/b>: the banner should be simple enough to not distract the user with all the colors or background noise.<\/li>\n<li><b>APPEAL<\/b>: the banner needs to stand out in the Instagram feed to be effective.<\/li>\n<\/ul>\n<p>Follow these 3 rules and you will have effective banners to play with.<\/p>\n<h3>The Copy<\/h3>\n<p>Similar to the rules of an effective banner from above, to create a winning copy for your ad you must follow these golden rules:<\/p>\n<ul>\n<li><b>CLARITY<\/b>: You should aim for a clear and concise copy instead of a wall of text. Your primary goal is to make it easy for the user to understand your message. So you need to use their language and terms they can easily understand when constructing your message.<\/li>\n<li><b>CALL TO ACTION<\/b>: Don’t forget to tell your users what to do in case they like what you are offering. Having a clear call to action in your message is extremely powerful, so don’t overlook it.<\/li>\n<li><b>SPEAK DIRECTLY TO SOMEONE<\/b>: Some marketers often forget that in front of the phone’s screen is just a person, not the entire targeted audience. That’s why it’s more efficient to think that you are talking with someone in front of you to make your messages more personal.<\/li>\n<li><b>URGENCY<\/b>: This one is self-explanatory. If you create urgency in your messages, you will have a better conversion rate, making your offer more appealing to your users.<\/li>\n<\/ul>\n<p><i>Examples of clear and efficient Instagram Ads:<\/i><br \/>\n<img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/headspace-ad.png\" alt=\"\" width=\"294\" height=\"500\" class=\"aligncenter size-full wp-image-2684\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/headspace-ad.png 294w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/headspace-ad-176x300.png 176w\" sizes=\"(max-width: 294px) 100vw, 294px\" \/><br \/>\nThe Headspace ad makes great use of contrasting warm colors without complicating the banner. The bright red color they use would most likely get you to stop your scrolling, and notice the ad. There’s a perfect use of emotional words that stand out, like anxiety or happier.<br \/>\n<img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/airbnb-ad.jpg\" alt=\"\" width=\"274\" height=\"500\" class=\"aligncenter size-full wp-image-2685\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/airbnb-ad.jpg 274w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/airbnb-ad-164x300.jpg 164w\" sizes=\"(max-width: 274px) 100vw, 274px\" \/><br \/>\nThe Airbnb ad is the best example of a simple ad. You don’t need more than 2 seconds to understand what is about. It’s a beautiful interior design shot, a place available to rent on Airbnb, with the price tag and the Book Now call to action. That’s it, no other message is necessary.<\/p>\n<p>Here are more examples of ads that stand out.<br \/>\n<img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/other-ig-ads.jpg\" alt=\"\" width=\"690\" height=\"385\" class=\"aligncenter size-full wp-image-2686\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/other-ig-ads.jpg 690w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/other-ig-ads-300x167.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/other-ig-ads-600x335.jpg 600w\" sizes=\"(max-width: 690px) 100vw, 690px\" \/><\/p>\n<h3>Ads Targeting<\/h3>\n<p>Targeting is crucial in your ads creation, because if the wrong people see your ads, then your campaign won’t do so well. It’s the <i>“find the right people to see your ads”<\/i> part in the magic formula. The good news is that the Facebook advertising platform can be very specific with targeting. The more refined the targeting, the better. With the Facebook advertising platform you can target based on:<\/p>\n<ul>\n<li>Demographics: gender, age<\/li>\n<li>Location: if you have a local business you can target people near your business, or if you know exactly where your customer is you can target one suburb or an entire country or continent.<\/li>\n<li>Interests: you can target based on who they follow like for example, celebrities, publications, brands, events and so on. If you like or follow something on Facebook, you can use that on Instagram when creating your ads audiences.<\/li>\n<\/ul>\n<p>To identify the interests of your followers start with Google or Amazon. Search for celebrities in your niche, brands, books, magazines, events. Keep a spreadsheet with at least 10 of each and add them in your targeting filters on Facebook. You will use them when creating your ad campaign in the Audience building section.<\/p>\n<p>For example, if your niche is in sports, let’s say European football… you can go to Google and search for “soccer players” or &#8220;football players &#8221; and you have right there a list of the most liked and followed celebrities in this niche. You’ll see celebrities like Cristiano Ronaldo, Lionel Messi, Neymar, and so on. You can just copy and paste the list into your spreadsheet.<br \/>\n<img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/footbal-players.png\" alt=\"\" width=\"690\" height=\"164\" class=\"aligncenter size-full wp-image-2687\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/footbal-players.png 690w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/footbal-players-300x71.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/footbal-players-600x143.png 600w\" sizes=\"(max-width: 690px) 100vw, 690px\" \/><\/p>\n<p>When you have around ten celebrities on your list, you can move to brands. You can use Google for this too, or you can try Amazon this time and search for sport equipment brands for example. You can search for “football shoes” or &#8221; football clothes&#8221; on Amazon and you will see a list of products some more popular than others. Notice the brands and add them to your list.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/footbal-shoes.png\" alt=\"\" width=\"607\" height=\"500\" class=\"aligncenter size-full wp-image-2688\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/footbal-shoes.png 607w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/footbal-shoes-300x247.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/footbal-shoes-600x494.png 600w\" sizes=\"(max-width: 607px) 100vw, 607px\" \/><\/p>\n<p>Next, you need to search for publications, like magazines, blogs or books, and so on, until you have a pretty big list of all the interests your target audience might have.<\/p>\n<h3>Landing Pages<\/h3>\n<p>These are the websites you use to send all the traffic to. <b>A landing page is where the people that see your ads land when they click on the ad<\/b>. This means you did a pretty good job with the banner, the offer, and the copy, you enticed your visitors to click through, and now you must convince them to take the final action on your landing page. This makes the landing page a direct continuation of your ad. It’s the place where people come to get what you promised in your offer. So, the landing pages you choose to use can determine the success or failure of your campaign.<\/p>\n<p>You might ask yourself <i>“Do I really need a landing page? Why can’t I just use my website?”<\/i><\/p>\n<p>Most of the times a business website has too much information that will distract your potential customers. To make the ad more successful you need to offer your visitors just the amount of information necessary to make a conversion. They just want to know how to get the offer you promised them in the ad.<\/p>\n<p>In a company website, there are too many elements, too many things are happening: information about the company, the products or services you’re selling, a blog, social media links and so on. A simple Landing Page can be more effective in communicating your message. So when deciding on a landing page, think of the 3 seconds rule: <b>if you can’t figure out what is it about in just 3 seconds, then it’s too complicated.<\/b><\/p>\n<p>Designing web pages can be difficult or expensive. That’s why the best approach would be to use online tools with easy visual interfaces that let you create webpages in minutes without having to code something on your site.<\/p>\n<p><a href=\"https:\/\/www.leadpages.net\/\">LeadPages<\/a> is one of these tools that can help you create effective landing pages without the headaches associated with web design. It’s a simple to use online tool, perfect for beginners. You have tons of templates to choose from that you can edit with a few clicks. You’ll just have to add a catchy image or banner, your offer and a subscribe form or a button or whatever is necessary to help the user get what you are offering. You can create super clean standalone pages. After you design your page using their templates you just have to publish it and that’s it, you can start using the page in your ads.<\/p>\n<p>What you need to have in mind when creating a landing page for Instagram ads is that <b>all your visitors will end up on your page from a mobile device<\/b>, considering that Instagram ads are available only on mobile devices for the time being. This means that your images, colors, copy, buttons and all the elements in the page need to be designed with the mobile first strategy in mind. <b>Your landing page needs to be mobile friendly<\/b>. With LeadPages you can actually check how your website will look on a mobile device before publishing.<\/p>\n<p>If you have an e-commerce website, and you want to sell your products through Instagram ads, then your product page is actually your landing page. You don’t need to add an extra step here. If your ad makes it clear that you are selling that particular product, your visitors will expect to see the product page so they can buy it after clicking the ad.<\/p>\n<h3>5 Most Common Mistakes When Creating Ads<\/h3>\n<p>Creating ads campaigns can be a tough task. There is no magic formula in creating winning ads from the start. In the beginning, you’ll lose some money, let’s call it “tuition” money until you learn to optimize your ads and have a good eye on what an ad should look like to have good results. Even after years of practice you can get it wrong sometimes. That’s a lot of pressure that can lead to mistakes.<\/p>\n<p>To avoid these mistakes, you first need to know the most common ones, to know what to expect and to damage control from the start.<\/p>\n<p>Here are the top mistakes that if you recognize and avoid, you’ll have a huge advantage over other marketers in your field.<\/p>\n<p><b>Giving up to Early<\/b><br \/>\nYou need to give yourself some adjusting and learning time. Sometimes you can get lucky and create a winning campaign from the start, but that’s not always the case. Most marketers lose some money and have a few bad campaigns until they learn the game. Once you get this pressure away from you, you’ll be more relaxed, something that will help you being more creative.<\/p>\n<p><b>Going Too Hard Too Early<\/b><br \/>\nYou don’t have to go all in. Start testing on a smaller budget at first. Give yourself the chance to do a few campaigns before you run out of budget. That’s the only way you’ll learn.<\/p>\n<p><b>Not Testing<\/b><br \/>\nYou always need to A\/B test your ads if you want to improve. Even if your campaigns are having a good ROI you could leave money on the table if you are not testing several variations and improve based on your test results.<br \/>\nNot Tracking Conversions<br \/>\nThis is similar to not testing above… If you’re not tracking your conversions you’re flying blind. You don’t know where and how to optimize.<\/p>\n<p><b>Optimizing Too Often<\/b><br \/>\nOptimizing is amazing but if you’re doing it too often your results might not be relevant. You need to let your campaigns run for at least 2 to 3 days before assessing your results and optimizing your campaigns.<\/p>\n<h3>Wrapping it up<\/h3>\n<p>As you can imagine there’s a lot more to talk about Instagram ads, how to use them correctly and how to optimize everything so you have a good ROI. This is just to get you started and show you that it’s not that hard to create your first campaign.<\/p>\n<p>The more you’ll work with this the more you’ll understand. So good luck if you want to try it!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In case you’re familiar with Facebook Ads, it’s pretty easy to get started with Instagram Ads. Instagram Ads are in fact run through Facebook’s Advertising platform. So you can’t run ads on Instagram without actually having a Facebook Business Account. The first question that comes to mind is… Why choose Instagram Ads then, when brands [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[25],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Instagram Ads 101: The Anatomy of An Winning Ad - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Instagram Ads 101: The Anatomy of An Winning Ad - Jarvee\" \/>\n<meta property=\"og:description\" content=\"In case you’re familiar with Facebook Ads, it’s pretty easy to get started with Instagram Ads. Instagram Ads are in fact run through Facebook’s Advertising platform. So you can’t run ads on Instagram without actually having a Facebook Business Account. The first question that comes to mind is… Why choose Instagram Ads then, when brands [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-11T17:40:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/headspace-ad.png\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/headspace-ad.png\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/headspace-ad.png\",\"width\":294,\"height\":500},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#webpage\",\"url\":\"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/\",\"name\":\"Instagram Ads 101: The Anatomy of An Winning Ad - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#primaryimage\"},\"datePublished\":\"2018-02-11T17:40:48+00:00\",\"dateModified\":\"2018-02-11T17:40:48+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Instagram Ads 101: The Anatomy of An Winning Ad\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Instagram Ads 101: The Anatomy of An Winning Ad - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/","og_locale":"en_US","og_type":"article","og_title":"Instagram Ads 101: The Anatomy of An Winning Ad - Jarvee","og_description":"In case you’re familiar with Facebook Ads, it’s pretty easy to get started with Instagram Ads. Instagram Ads are in fact run through Facebook’s Advertising platform. So you can’t run ads on Instagram without actually having a Facebook Business Account. The first question that comes to mind is… Why choose Instagram Ads then, when brands [&hellip;]","og_url":"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/","og_site_name":"Jarvee","article_published_time":"2018-02-11T17:40:48+00:00","og_image":[{"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/headspace-ad.png"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/headspace-ad.png","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/headspace-ad.png","width":294,"height":500},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#webpage","url":"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/","name":"Instagram Ads 101: The Anatomy of An Winning Ad - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#primaryimage"},"datePublished":"2018-02-11T17:40:48+00:00","dateModified":"2018-02-11T17:40:48+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/instagram-ads-101-anatomy-winning-ad\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Instagram Ads 101: The Anatomy of An Winning Ad"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2683"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=2683"}],"version-history":[{"count":1,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2683\/revisions"}],"predecessor-version":[{"id":2689,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2683\/revisions\/2689"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=2683"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=2683"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=2683"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}