{"id":2804,"date":"2018-02-21T20:19:22","date_gmt":"2018-02-21T20:19:22","guid":{"rendered":"https:\/\/jarvee.com\/?p=2804"},"modified":"2018-02-21T20:19:22","modified_gmt":"2018-02-21T20:19:22","slug":"power-social-media","status":"publish","type":"post","link":"https:\/\/jarvee.com\/power-social-media\/","title":{"rendered":"The Power of Social Media"},"content":{"rendered":"<p>By Shizah Kashif<\/p>\n<p>Where is the world right now?<\/p>\n<p>For me and every millennial reading this, it’s in the virtual dimensions encapsulated by the rectangles in our palms. Or the TFTs on our desks, if you’re old school.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today.jpg\" alt=\"The Power of Social Media Today\" width=\"656\" height=\"355\" class=\"aligncenter size-full wp-image-2805\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today.jpg 656w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today-300x162.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today-600x325.jpg 600w\" sizes=\"(max-width: 656px) 100vw, 656px\" \/><\/p>\n<p>In any case, we all live and thrive on the fibres of the internet that course through the vast worlds of social media, where we all bemoan our troubles, seek attention, seek for things that have already sought attention, flounder our lives, portray the versions of ourselves that we are not able to actually achieve and above all, squander our time, incessantly.<\/p>\n<p>The power of social media is an unprecedented tether to our existence in today’s technological era, our every breath compressed into a post online, lying in a cloud service somewhere.<\/p>\n<p>Social media pulls the reins in the gladiator race that has become our life in this century, where everyone battles to outshine the other, beseeching validation and acceptance online while reality awaits outside the caged doors; the reality of <em>actually<\/em> living.<\/p>\n<p>It is a very widely acknowledged truth that the tsunami of the social media has swept away many facets of traditional life. Our attitude towards interaction have changed, ideals and morals altered to suit our tastes, class and privilege have been degraded into meaningless labels with the freedom and vastness it offers to the 7 billion and growing population of the planet.<\/p>\n<p>But are our social lives the only thing it’s changed?<\/p>\n<p>Look at our headlines.<\/p>\n<p>Look at the world’s biggest powers.<\/p>\n<p>Look at the magnificent power struggle that shifted from the streets of the DNC to the tweeting halls of Twitter.<\/p>\n<p>Social media is pulling the strings on how our governments are run, our people think and see, and how they should react.<\/p>\n<p>If you thought Donald Trump had a bigger and better nuclear button, it’s social media that has the biggest one of all.<\/p>\n<p>As a Pakistani Muslim growing up in an emerging economy, much of the hate speech that circulates around the social media webs finds its target in my battered bones. Whether it’s a privileged white male legitimising the bombing of a mosque on CNN because of religious insecurity and physical ‘sketchiness’ of Muslims, or another, richer, privileged white man sitting in the White House, hollering out federal notices against 3.3 million of his people that uncoincidentally share my religious and cultural ethnicity, the hate always finds its way. And that is one of the many anecdotes all of us have to share of the power that social media concedes into the hands of unworthy hands that should be hitherto, kept as far away as possible from it.<\/p>\n<p>This power allows one person to take others into their hands, change their mould, pin them up with tiny labels, bellow out their incriminations at the passers-by and wait for the tide of bitter and hateful judgements to follow in the wake of his remodelling. This remodelling has built on old stereotypes, strengthening thoughts the millennium had shown signs of progressing ahead of, feeding conservatives with fodder to hate on the liberals, riling up liberals to clap back on the conservatives, pitch up passive aggressive wars between countries that barely got on before and resultantly, ingrain deeper divisions in society. The Facebook we all made accounts on years ago is no longer a channel for sharing things with family and friends, but has become an undercover agent of controversy and hate. Innocent people are shamed and blatantly accused of crimes they could never even fathom doing, cultures are being appropriated due to the relatively greater sense of privilege some cultures hold over others and the youth is being pushed into wars with themselves.<\/p>\n<p>Teenagers. The most vulnerable of the social media vagrants, yet also the most crucial. We teenagers have been given the key to the world with no idea where to go; our minds still naïve and forming opinions of its own is often intercepted by interested parties who wish to use us for their ulterior motives. This includes religiously radicalising young people, blackmailing others and many a times, aggravating them into having an online outburst which provides enough fuel to divide the youth enough to nullify any good.<\/p>\n<p>However, that does not mean <em>all<\/em> the buttons of social media have wreaked havoc. Some are merely pointless, but still powerful enough to make ripples across millions of users, viewers and stir up passing debates on television. Every generation requires an agreeable diversion from the more consequential and sometimes, grave realities of life, and social media, if not agreeably, but conveniently slides up its billions of users with a good juicy scandal or stupefying event right when it is needed. The matter may not even be interesting enough if someone had mentioned it to you in a chat at the office or the coffee shop, but the sheer curiosity which has fuelled many of social media’s small stunts to become world trending topics has enough power to occupy a pedant’s mind for long enough to miss out on the big things that should instead be talked of. It could range from something as ludicrous as a dog climbing a tree to save a cat, to the more recent and disturbingly fresh video of a reckless young homeless boy in India who has succumbed to drugs and gloats about his addiction to the Indian journalist who discovered him. The latter is one viral thread that had my own mind preoccupied with harrowing images of such a child’s life, but had provided a completely polar effect on most of the people my age; the drug-addicted boy’s tribulations had become a meme for the wider internet. The insensitivity that followed the young boy, Kamlesh’s interview by the millennial generation had me recoiling from most of my friends for a good few days; laughing and jeering at the misfortune of an orphan child who no ambitions but the desire to smoke a joint in one of the world’s largest populations while enjoying their own entitled privilege in front of their mobile screens plays a strong metaphor for the illusion that most of us choose to enjoy instead of the backstage reality that it hides. On this point, social media plays a pivotal role; on one hand, it rightfully lifts the veil over the windows we don’t look out and helps spread social realisations for those things we deny ourselves and yet, is strongly tainted with the frivolous ‘dark humour’ that has made its fame in the millennial generation.<\/p>\n<p>I usually like to coin it as the ‘<em>mistress of internet conspiracies’<\/em>.<\/p>\n<p>Dark humour is perhaps the worst part of social media; the lack of supervision and ineffectiveness of internet laws in places which direly require them have given users an unsolicited liberty to offend openly, freely and unapologetically. Why? Because the internet is a free entity and your freedom of expression is your right.<\/p>\n<p>This one human law has become the bane of online humour; it has given ‘meme makers’ the confidence to publish and advocate crude, insensitive material online, ranging all the way from legitimising sexual assault, humouring child abuse, post highly racist jokes, being disrespectful about the deaths of famous people and increasingly seen on pages now, being Islamophobic while also condemning it. Though many argue that it is all in ‘good’ humour or that if one can’t stomach the severity of the joke, he shouldn’t view them, dark humour has become a trend many people feel they must unwillingly conform to. It has become a defence mechanism to any and every international scandal, news, headline, lawsuit and event imaginable that shakes our channels, and has not served as the respite from drama many people perceive it to be but has aggravated the smallest of issues into world trending phenomena that at times are senseless beyond belief.<\/p>\n<p>It is also quite ridiculous when one realizes how many of these stories have been planted by our own governments and leaders to distract us from the grander scheme of things that they sneak into doing behind our bent backs, hunched over screens. Our preoccupations are just the result of a political scheme, at best, aimed to disconcert our attention to something trivial than something of consequence. It has almost become a non-drugged pill of submission we unknowingly swallow every time a post with ‘10k likes’ presents itself to us on our feeds. And we never seem to tire of this hold on our attention.<\/p>\n<p>However, the power of these meme pages and makers must not be understated. They, like all content online, are part of large digital communities that control the seriousness of matters that concern political gamechangers, social developments and our moral compass. They have ability to alter people’s opinions, especially if they have a viral streak, and have bee traced back to many international states conducting slander operations. If the 2016 Presidential Elections weren’t a breathing illustration of the power of social media, I wouldn’t know what else to cite.<\/p>\n<p>But modern humourists aren’t the only influential presences on social media.<\/p>\n<p>The world today is reeling from a constant flux of change; changing policies, changing leaders, changing rhetoric, changing victims, changing assailants, changing crimes and changing good and bad. All the prerequisite facts of life are put to great scrutiny under the eye of the billion-or-so held magnifying glass of social media, that digs into the most set of opinions and still yields a battlefield to pit people against on. Conspiracies, terrorist recruitment programs, election rigging, disguised slander and other vehement activities that shouldn’t make their way onto a God-loving, law-abiding citizen’s home screen on Facebook are filling up and clogging the breathing space the internet had so altruistically offered us on a plate of binary codes some years ago; the danger is imminent. Criminals, terrorists, sexual predators, religious extremists and cult recruiters prowl our parental-locked social media accounts; are we safe from them?<\/p>\n<p>It seems that that isn’t an option any longer.<\/p>\n<p>Social media is an enterprise, and like all enterprises, it thrives on a steady supply of banknotes, no matter how sketchy the source. This source comes from anonymous dealers in client information; client information being the personal information, such as email addresses, locations, even hobbies and culinary preferences of the millions of unsuspecting social media users, your grandmother included. Our lives online are sold as products to agencies that either exploit our likes and dislikes to bolster their products, like that annoying hair exfoliating advertisement that keeps showing up on your Instagram feed without you ever having asked for it, or sell them even further for even sketchier people, any of whom could be professional axe murderers or really just Star Wars cults, that then filter through the lists given to them and shortlist and gradually contact a selected few for whatever their purpose.<\/p>\n<p>Though the arguments suggesting the power of social media is largely in favour of negative effects, it will be false to say that the collective power of the people online have not reaped any sweet fruits.<\/p>\n<p>Social media works wonders, and can turn your fate upside down by a few clicks on certain buttons. A couple thousands shares and likes, or tweets, if Twitter is your preferred platform, and your name is plastered in every corner of the wide web. You have Go Fund Me pages raise millions in support of local citizens in need, or even to lend hands across borders and oceans to help educate children in war torn countries. From the people of the world coming together to learn about a cancer patient’s tragic story to them working together to make his or her last days truly memorable, social media paints many beautiful chapters into its flawed book.<\/p>\n<p>We are the ones, ultimately, who have the power that we have vested into these engines we blame for our problems. All the way from politics to the little cat that got stuck on a tree, it is we who decide what we give enough importance to maybe change the world for a few minutes, or for years to come. Whether we talk about global warming strategies or exchange tips on how to cook the perfect chicken escalope, social media will be an ever-present vessel of communication for the entire world. But you choose what you communicate into it and what you allow to be right. It is a matter of our own moral rectitude.<\/p>\n<hr>\n<p><strong>NOTE:<\/strong> This is a an article that took part in our <a href=\"https:\/\/jarvee.com\/jarvee-coms-essay-writing-competition\/\">Essay Writing Competition.<\/a> It was selected to be one of the essays that compete for the second prize. Congratulations!<\/p>\n<p><strong>Student details:<\/strong><br \/>\nName: Shizah Kashif<br \/>\nAge: pending<br \/>\nSchool: pending<br \/>\nA few words from the author:<\/p>\n<blockquote><p>pending<\/p><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>By Shizah Kashif Where is the world right now? For me and every millennial reading this, it’s in the virtual dimensions encapsulated by the rectangles in our palms. Or the TFTs on our desks, if you’re old school. In any case, we all live and thrive on the fibres of the internet that course through [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2805,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[2],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Power of Social Media - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/power-social-media\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Power of Social Media - Jarvee\" \/>\n<meta property=\"og:description\" content=\"By Shizah Kashif Where is the world right now? For me and every millennial reading this, it’s in the virtual dimensions encapsulated by the rectangles in our palms. Or the TFTs on our desks, if you’re old school. In any case, we all live and thrive on the fibres of the internet that course through [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/power-social-media\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-21T20:19:22+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"656\" \/>\n\t<meta property=\"og:image:height\" content=\"355\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/power-social-media\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today.jpg\",\"width\":656,\"height\":355,\"caption\":\"The Power of Social Media Today\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/power-social-media\/#webpage\",\"url\":\"https:\/\/jarvee.com\/power-social-media\/\",\"name\":\"The Power of Social Media - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/power-social-media\/#primaryimage\"},\"datePublished\":\"2018-02-21T20:19:22+00:00\",\"dateModified\":\"2018-02-21T20:19:22+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/power-social-media\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/power-social-media\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/power-social-media\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Power of Social Media\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Power of Social Media - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/power-social-media\/","og_locale":"en_US","og_type":"article","og_title":"The Power of Social Media - Jarvee","og_description":"By Shizah Kashif Where is the world right now? For me and every millennial reading this, it’s in the virtual dimensions encapsulated by the rectangles in our palms. Or the TFTs on our desks, if you’re old school. In any case, we all live and thrive on the fibres of the internet that course through [&hellip;]","og_url":"https:\/\/jarvee.com\/power-social-media\/","og_site_name":"Jarvee","article_published_time":"2018-02-21T20:19:22+00:00","og_image":[{"width":656,"height":355,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/power-social-media\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/The-Power-of-Social-Media-Today.jpg","width":656,"height":355,"caption":"The Power of Social Media Today"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/power-social-media\/#webpage","url":"https:\/\/jarvee.com\/power-social-media\/","name":"The Power of Social Media - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/power-social-media\/#primaryimage"},"datePublished":"2018-02-21T20:19:22+00:00","dateModified":"2018-02-21T20:19:22+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/power-social-media\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/power-social-media\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/power-social-media\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"The Power of Social Media"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2804"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=2804"}],"version-history":[{"count":1,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2804\/revisions"}],"predecessor-version":[{"id":2806,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2804\/revisions\/2806"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/2805"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=2804"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=2804"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=2804"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}