{"id":2807,"date":"2018-02-22T03:41:02","date_gmt":"2018-02-22T03:41:02","guid":{"rendered":"https:\/\/jarvee.com\/?p=2807"},"modified":"2018-02-22T03:41:02","modified_gmt":"2018-02-22T03:41:02","slug":"impact-social-media-interpersonal-relationships-3","status":"publish","type":"post","link":"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/","title":{"rendered":"The impact of social media on interpersonal relationships"},"content":{"rendered":"<p>by Aya Ali Al Zayat<\/p>\n<blockquote><p>“I fear the day that technology will surpass our human interaction. The world will have a generation of idiots.”<\/p><\/blockquote>\n<p>&#8211; Albert Einstein<\/p>\n<p>&nbsp;<\/p>\n<p>The growth of social media has been one of the most significant characteristics of this century. Facebook, Instagram, Twitter, Weibo and many, many other social network services are having an impact on billions of people every day. The debates that result from the continuous growth of social media often concern the decrease of interpersonal relationships and all problems deriving from it. In this essay both sides of the coin will be pictured, along with personal experience and research to explain the good and bad effects of social media on human interactions and relationships.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-and-interpersonal-relationships.jpg\" alt=\"social media and interpersonal relationships\" width=\"583\" height=\"430\" class=\"aligncenter size-full wp-image-2809\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-and-interpersonal-relationships.jpg 583w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-and-interpersonal-relationships-300x221.jpg 300w\" sizes=\"(max-width: 583px) 100vw, 583px\" \/><\/p>\n<p>The original idea of social media was to connect people &#8211; mainly adults, and offer them a platform for communicating with each other anywhere in the world, as long as they had internet access. This idea was very noble and appealed to many people, hence the exponential growth of social media types and platforms in a short time span. Additionally, these platforms helped improve family ties and even made job hunting easier. All of this, however, was foreshadowed when children started using social media for playing games and mostly just wasting hours on memes, vines and other funny content. Social media quickly started losing its original point and morphed into something useless and even dangerous. Instead of connecting people who lost contact or don&#8217;t live close to each other and helping family and work colleagues share information more quickly, social network services became a source of entertainment and abuse, with its user being mostly young people.<\/p>\n<p>Popularity on social media rapidly became a goal everyone wanted to obtain. People became willing to do unimaginable things to get more views or likes or friends. As a result, childhood friends might grow apart because of their social status, children might get kidnapped because someone saw their photo online or found out where they would be going out in the evening, and people might receive death threats and get blackmailed. While these things occurred even before the creation of social media, the number of these kinds of problems increased and keeps increasing with the “help” of social media. Some of the perpetrators of cyberbullying even do it out of fun and scar many people for life. The problem is so severe that in some cases the victims committ suicide because of the way they are treated. Fake accounts make the bullying easier and even identity theft became a bigger issue than before.<\/p>\n<p>All these issues were worrying, so social media developers did manage to enforce more rules and started deactivating and erasing fake and rule-violating accounts, but it was not and still is not enough because this problem is still alarming.<\/p>\n<p>After giving examples of more well-known “global” issues, in the next part personal experiences and examples of the impact of social media on own life and relationships will be presented and discussed.<\/p>\n<p>Living near a playground, I have noticed that each year, fewer children come to play or hang out in the outdoors. I remember a time when the children from the same building played in front of it, instead of the playground, because it was overflowing with children and none of the swings or the benches were available. I remember playing football, basketball, volleyball, hide-and-seek and even some of our own made-up games over the summer, while sledding and snowballing in the winter. After having such a nice childhood playing outside and enjoying the weather, I feel bad for the new generation of children who will not experience such joy in one-on-one human interactions among their peers. Even though rnow schools do offer these kinds of interactions, they cannot completely capture the enjoyment of spending time playing and talking with friends about anything and everything.<\/p>\n<p>What astounds me is the fact that my brother, who is five years younger than me, leads a very different life from the one I had when I was his age. Unlike me, he interacts with his friends through Xbox live on other online game platforms. It is quite sad to see young children become obese or have other defects because of their lack of physical activity or their lack of vitamin D from the Sun.<\/p>\n<p>I acknowledge that through these online game platforms you can meet many different types of people, and even make friends with some of them, but it is hard to know if the person’s profile picture is even their own, let alone their personality and true intentions. This particular problem becomes even greater when the game platform uses avatars and doesn’t check the players’ personal information.<\/p>\n<p>But, social media does have many good sides to it. Having family all over the world, it was not easy keeping in touch with them before the Internet. Usually we talked once or twice a year and never actually saw each other. Maintaining family ties was very hard, but with the spreading of social media this task became easier to accomplish. Even holiday greetings through Facebook are a great way of communicating with our relatives who live on another continent. But, while social media sites help us connect with our distant family, it can also distance us from our immediate family. When was the last time your whole family had a meal together? When was the last time you played a board game together or did anything together? The fault is not only the children&#8217;s and because of them spending countless hours on their computer or mobile phones, because adults also get dragged into the cyber world and forget to spend time with their family.<\/p>\n<p>Unfortunately, I have witnessed many people sitting together in a cafe but not talking at all. When I was younger, I used to hear stories of people meeting at the bus or while walking. Now, the only thing anyone wants is the link to your Facebook or Instagram profile. People close themselves and live in whole different, imaginary worlds of Twitter and Tumblr instead of facing the world. Why are there so many introverted people now? A part of the reason for sure is the way our social lives have changed. Instead of trying to accept people, it has become much easier to gang up on them and insult them, especially since it is harder to see the negative impacts of harsh words and actions on the Internet. A child that insults someone else on any basis would probably feel bad if they saw that perso  start crying. But the cries cannot be seen through a co puter screen, but the impacts stay the same, if not worse.<\/p>\n<p>I admit communication with my middle school friends now only happens through social media, because we lead very different lives and have different schedules. On the other hand, I believe that our friendships would be stronger if we saw each other and talked face-to-face. People I used to call my friends for nine years are now reduced to rare messages on the holidays and generic birthday wishes. We drifted apart, but I am happy to hear from them from time to time, even if it is through online messages.<\/p>\n<p>As Malay Shan said: <em>“Social media sites create an illusion of connectivity,” <\/em>because friends and followers on social media sites are mostly strangers and if we do not want to become strangers with our current friends, we must log off of social media for a while and spend some quality time with them. The main problem is that after some time, people stop distinguishing social media from real life. They start believing everything they see there and only something that is shared through social media can ve acknowledged. If you had not posted photos of your newborn baby, nobody will congratulate you. If you had not posted photos of your summer vacation, nobody will believe you. Apart from this, people also start obsessing with meaningless things, like when someone sees theur message but does not respond immediately, when someone likes their picture but then changes their mind or even when someone is online and for how long. Instead of spending their time on much more useful things, like going to the library, people spend hours and hours every day scrolling through their news feed and absorbing millions of units of mostly useless information. As a consequence, people are getting lazier, more stressed and tired.<\/p>\n<p>Unfortunately, nowadays social network services are mostly used only for useless or unethical purposes. If we continue going down this path, perhaps our children will forget how to talk or feel the basic of human emotions. Perhaps they will meet online and have a family they never really see, except for through social media. Perhaps they will have even less privacy than we have and if we do not do something about this problem, perhaps they will become obese and depressed at a very young age. We should turn off our phones every once in a while and instead of scrolling through the photos of people we do not even know, be with those we know and love while we can. Someday, all we might have left are the photos and statuses, and hopefully we wake up in time and see that all the information means nothing, because it is just a copy, not real life.<\/p>\n<hr>\n<p><strong>NOTE:<\/strong> This is a an article that took part in our <a href=\"https:\/\/jarvee.com\/jarvee-coms-essay-writing-competition\/\">Essay Writing Competition.<\/a> It was selected to be one of the essays that compete for the second prize. Congratulations!<\/p>\n<p><strong>Student details:<\/strong><br \/>\nName: Aya Ali Al Zayat<br \/>\nAge: 17<br \/>\nSchool: The First Bosniak High School<br \/>\nA few words from the author:<\/p>\n<blockquote><p>I live near a playground and every year I see less and less children come and play. This phenomenon made me realize how, even though I am not much older, the way of human interaction has changed in such a short time, so I researched the topic &#8220;The impact of social media on interpersonal relationships&#8221; so that we can find a solution to this problem.<\/p><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>by Aya Ali Al Zayat “I fear the day that technology will surpass our human interaction. The world will have a generation of idiots.” &#8211; Albert Einstein &nbsp; The growth of social media has been one of the most significant characteristics of this century. Facebook, Instagram, Twitter, Weibo and many, many other social network services [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2809,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[2],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The impact of social media on interpersonal relationships - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The impact of social media on interpersonal relationships - Jarvee\" \/>\n<meta property=\"og:description\" content=\"by Aya Ali Al Zayat “I fear the day that technology will surpass our human interaction. The world will have a generation of idiots.” &#8211; Albert Einstein &nbsp; The growth of social media has been one of the most significant characteristics of this century. Facebook, Instagram, Twitter, Weibo and many, many other social network services [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-22T03:41:02+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-and-interpersonal-relationships.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"583\" \/>\n\t<meta property=\"og:image:height\" content=\"430\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-and-interpersonal-relationships.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-and-interpersonal-relationships.jpg\",\"width\":583,\"height\":430,\"caption\":\"social media and interpersonal relationships\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#webpage\",\"url\":\"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/\",\"name\":\"The impact of social media on interpersonal relationships - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#primaryimage\"},\"datePublished\":\"2018-02-22T03:41:02+00:00\",\"dateModified\":\"2018-02-22T03:41:02+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The impact of social media on interpersonal relationships\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The impact of social media on interpersonal relationships - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/","og_locale":"en_US","og_type":"article","og_title":"The impact of social media on interpersonal relationships - Jarvee","og_description":"by Aya Ali Al Zayat “I fear the day that technology will surpass our human interaction. The world will have a generation of idiots.” &#8211; Albert Einstein &nbsp; The growth of social media has been one of the most significant characteristics of this century. Facebook, Instagram, Twitter, Weibo and many, many other social network services [&hellip;]","og_url":"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/","og_site_name":"Jarvee","article_published_time":"2018-02-22T03:41:02+00:00","og_image":[{"width":583,"height":430,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-and-interpersonal-relationships.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-and-interpersonal-relationships.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/social-media-and-interpersonal-relationships.jpg","width":583,"height":430,"caption":"social media and interpersonal relationships"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#webpage","url":"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/","name":"The impact of social media on interpersonal relationships - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#primaryimage"},"datePublished":"2018-02-22T03:41:02+00:00","dateModified":"2018-02-22T03:41:02+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/impact-social-media-interpersonal-relationships-3\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"The impact of social media on interpersonal relationships"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2807"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=2807"}],"version-history":[{"count":2,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2807\/revisions"}],"predecessor-version":[{"id":2810,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2807\/revisions\/2810"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/2809"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=2807"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=2807"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=2807"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}