{"id":2912,"date":"2018-02-27T23:09:41","date_gmt":"2018-02-27T23:09:41","guid":{"rendered":"https:\/\/jarvee.com\/?p=2912"},"modified":"2018-02-27T23:09:41","modified_gmt":"2018-02-27T23:09:41","slug":"merits-demerits-social-media","status":"publish","type":"post","link":"https:\/\/jarvee.com\/merits-demerits-social-media\/","title":{"rendered":"Merits and Demerits of Social Media"},"content":{"rendered":"<p>by Joy I. Kalu<\/p>\n<p>It took 38 years for radio to reach 50 million people, 13 years for television to reach the same number, and 4 years for the internet to do so. However, in just one recent year, the popular social media site Facebook signed on over 200 million users! What makes social media so appealing?<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media.jpg\" alt=\"\" width=\"678\" height=\"283\" class=\"aligncenter size-full wp-image-2913\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media.jpg 678w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media-300x125.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media-600x250.jpg 600w\" sizes=\"(max-width: 678px) 100vw, 678px\" \/><\/p>\n<p>First of all, what is a social media or networking site? It is a website that allows those who have an account to communicate with a selected group of friends. Facebook, Twitter, Instagram, WhatsApp and 2Go are just some of these social media sites.<\/p>\n<p>In recent times, we have experienced an overwhelming upsurge in the number of new users, especially youths. This in turn has been a force for good. It has improved relationships, improved learning, created awareness, improved crime detection, helped students make good grades, created thousands of jobs, connected friends and family, and improved the spread useful information and much more. However, it has done the opposite as well. How so? Consider the following merits and demerits of social media and ways in which it has affected the youths today.<\/p>\n<p>To begin, when properly used, social media has been a powerful tool in connecting with loved ones and interacting with friends. In fact, humans are hardwired to interact with humans and that is why social media is so appealing because it does just that. Also, many youths have friends and family members living far away. I do also. In the past, it took weeks or even months for letters or telegrams to get to their destinations. Sometimes, they never get there. With the advent of mobile phones, it became easy to keep in touch with loved ones. But sometimes, we just cannot call these ones because we don’t have airtime. It might be difficult to communicate with friend and family living abroad because of the exorbitant airtime needed. Worse yet, it consumes time especially since you have to call one person at a time, and some may not be at home or available to talk when you are.<\/p>\n<p>However, the social media has made things even easier. With as low as 10 Megabyte of data, one can connect with friends and family members anywhere in the world and for a longer period of time. In fact, some network service providers have made social media free of charge! This has made communication easier.<\/p>\n<p>What’s more, the social media has been very useful when disaster strikes – such as the earthquake that and tsunami that caused untold disaster in parts of Japan on March 11, 2012. During and after such a disaster, phone lines are usually down and no one cares to check emails. So it becomes impossible to communicate with our loved one and inquire about their safety. But with the social media, one can just pick up his cell phone, access the internet and go the page of his or her loved one and read the information posted or even chat briefly. It’s that easy.<\/p>\n<p>But social media has a demerit in this aspect. In the bid to connect with people, many youths have added friends or accepted friend requests from people they know absolutely nothing about. Some of these friends might be criminals, fraudsters, bullies, sexually immoral people and bad friends. These wrong types of friends can prove to be a bad influence. We have many stories of youths who were defrauded, raped, bullied and even murdered by their social media “friends”. Others learn bad things from these so-called friends and end up engaging in crimes.<\/p>\n<p>More alarming also is the amount of time that is spent by teenagers “connecting” with friends and families. Many teenagers have become addicted to the point that social media has taken over their lives. They are so deeply engrossed that they get cut off from the society and hibernate into the world of social media. These youths are constantly thinking about being online. Even when online, they keep thinking about when next they will come online to update their status and post new pictures. They read comments here, post videos there, reply to comments the other side, and before you know it, hours would fly by. This in turn will have negative consequences. These youths end up losing the real friends they have to friends they have not met before, friends that that cannot be of help during times of trials. They get robbed of sleep, isolate themselves from family and friends and become lost in the imaginary world of Social Media. Some end up getting killed in road crashes while charting on social media sites. How tragic!<\/p>\n<p>Next, social media has helped in crime detection. Security agencies have access to people’s personal accounts. This can help in cracking down on criminals and fraudsters. However, it has also increased crime. How so?<\/p>\n<p>Most teenagers think that their privacy is secured while on social media. Hence, they post pictures of where they are or disclose information that are supposed to be kept to them such as their home address, email address, where they attend school, the name of their pet, the times when they are at  home and when no one is and other sensitive information. This information’s are enough to tell criminals or stalkers when to strike. It can also be used for identity thefts, hacking, phishing, scams and virus sending.<\/p>\n<p>Let’s use an example. If a teenager had in his possession a large sum of money or a very flashy and expensive phone or gadget, would he display it for everyone to see as he walked down a public street with friends? Doing that would be foolish because he is asking to be robbed. Similarly, it would be foolish to display sensitive information on social media. Doing so will mean asking for trouble. Yet, that is just what many young people have done. They have inadvertently shared such details with total strangers! And many have paid dearly for that!<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/your-social-media-activity-is-not-private.jpg\" alt=\"your social media activity is not private\" width=\"666\" height=\"386\" class=\"aligncenter size-full wp-image-2914\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/your-social-media-activity-is-not-private.jpg 666w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/your-social-media-activity-is-not-private-300x174.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/your-social-media-activity-is-not-private-600x348.jpg 600w\" sizes=\"(max-width: 666px) 100vw, 666px\" \/><\/p>\n<p>The social media has also made it possible for pupils and students to make good grades at school. Assignments can now be posted online by teachers and students can have access to them. They can also collaborate with fellow students on assignments. Students can also have easy and free access to resources to help them learn. This in turn boosts learning and grades at school.<\/p>\n<p>However, social media is also responsible for mass failure of pupils and students at school. It discovered that while grades of students who used social media lightly improved, the grades of students who are addicted users declined greatly. One study says that student users have an average GPA of 3.06 while non-users have an average GPA of 3.82.<\/p>\n<p>Furthermore, social media has created thousands of jobs for people. Jarvee.com is an example of this. They manage people’s social media accounts and get paid. All the professionals working for Jarvee.com earns their living as a result of social media. Furthermore, employers can find prospective employees through social media. Others looking for employment use social media to connect with others and this might help them find a job. Still, others who already own a business can use social media to promote or advertise their business, thereby, earning more money.<\/p>\n<p>On the other hand, social media has lead to loss of jobs and unemployment. How so? Stories abound of social media users losing their jobs or being turned down for new jobs because of what they have posted online. This is because so many employers look at an applicant’s social media page to judge his or her character and if the prospective employer see’s nasty things, then he won’t hire the person. That’s it! The person loses that job!<\/p>\n<p>Another notable advantage of social media is that it has facilitated the spread of useful information. Today, useful and even life-saving information’s flood the social media platforms, thereby, creating awareness. And as we know, information is power.<\/p>\n<p>To illustrate, when the Ebola virus hit West Africa, there was panic everywhere. The radio and T.V stations created awareness. However, the social media did more. Using the social media, people posted useful and detailed information’s on how the virus spread and how it can be prevented. People also got to see pictures and videos of people who had this virus. Useful information’s were disseminated and people took precautions. Countless lives were saved.<\/p>\n<p>Now, this is also where the problem comes in. Social media is doing more harm these days by serving as a means people with questionable characters use to spread malicious lies and information’s capable of plunging a country into chaos. Take as a case study what is happening in my country, Nigeria. In as much as there are lingering issues that still needs to be addressed by the government, but so many people has made the matter worse by using the social media as an avenue to spread hate speeches and false information’s capable of sparking serious problems. According to the President, this is a step too far.<\/p>\n<p>Lastly, another serious disadvantage is that the social media can be a very easy place to ruin one’s reputation. With just one thoughtless picture or post, one can ruin a good reputation which he has worked hard to build over the years. It seems that when people go on a social network, they lose their sense of right and wrong. They say and post things that they would never say or do in real life, thus damaging their reputation.<\/p>\n<p>In conclusion, social media can do well, it can also do badly. The bottom line is just moderation. Youths should learn to use the social media with moderation. This will help make the world of social media a great place.<\/p>\n<hr>\n<p><strong>NOTE:<\/strong> This is a an article that took part in our <a href=\"https:\/\/jarvee.com\/jarvee-coms-essay-writing-competition\/\">Essay Writing Competition.<\/a> It was selected to be one of the essays that compete for the second prize. Congratulations!<\/p>\n<p><strong>Student details:<\/strong><br \/>\nName: Joy I. Kalu<br \/>\nAge: 16<br \/>\nSchool: Best Intellectuals Model School Aba<br \/>\nA few words from the author:<\/p>\n<blockquote><p>I chose to write this essay, after hearing about the competition from my school&#8217;s principal, because so many youths today do not know about the dangers of using the social media. What they only care about is posting pictures and updating status and chatting. Therefore, I want the world to hear about the dangers of social media.<\/p><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>by Joy I. Kalu It took 38 years for radio to reach 50 million people, 13 years for television to reach the same number, and 4 years for the internet to do so. However, in just one recent year, the popular social media site Facebook signed on over 200 million users! What makes social media [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2913,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[2],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Merits and Demerits of Social Media - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/merits-demerits-social-media\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Merits and Demerits of Social Media - Jarvee\" \/>\n<meta property=\"og:description\" content=\"by Joy I. Kalu It took 38 years for radio to reach 50 million people, 13 years for television to reach the same number, and 4 years for the internet to do so. However, in just one recent year, the popular social media site Facebook signed on over 200 million users! What makes social media [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/merits-demerits-social-media\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-27T23:09:41+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"678\" \/>\n\t<meta property=\"og:image:height\" content=\"283\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/merits-demerits-social-media\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media.jpg\",\"width\":678,\"height\":283},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/merits-demerits-social-media\/#webpage\",\"url\":\"https:\/\/jarvee.com\/merits-demerits-social-media\/\",\"name\":\"Merits and Demerits of Social Media - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/merits-demerits-social-media\/#primaryimage\"},\"datePublished\":\"2018-02-27T23:09:41+00:00\",\"dateModified\":\"2018-02-27T23:09:41+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/merits-demerits-social-media\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/merits-demerits-social-media\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/merits-demerits-social-media\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Merits and Demerits of Social Media\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Merits and Demerits of Social Media - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/merits-demerits-social-media\/","og_locale":"en_US","og_type":"article","og_title":"Merits and Demerits of Social Media - Jarvee","og_description":"by Joy I. Kalu It took 38 years for radio to reach 50 million people, 13 years for television to reach the same number, and 4 years for the internet to do so. However, in just one recent year, the popular social media site Facebook signed on over 200 million users! What makes social media [&hellip;]","og_url":"https:\/\/jarvee.com\/merits-demerits-social-media\/","og_site_name":"Jarvee","article_published_time":"2018-02-27T23:09:41+00:00","og_image":[{"width":678,"height":283,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/merits-demerits-social-media\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/merits-and-demerits-of-social-media.jpg","width":678,"height":283},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/merits-demerits-social-media\/#webpage","url":"https:\/\/jarvee.com\/merits-demerits-social-media\/","name":"Merits and Demerits of Social Media - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/merits-demerits-social-media\/#primaryimage"},"datePublished":"2018-02-27T23:09:41+00:00","dateModified":"2018-02-27T23:09:41+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/merits-demerits-social-media\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/merits-demerits-social-media\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/merits-demerits-social-media\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Merits and Demerits of Social Media"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2912"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=2912"}],"version-history":[{"count":2,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2912\/revisions"}],"predecessor-version":[{"id":2916,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/2912\/revisions\/2916"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/2913"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=2912"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=2912"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=2912"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}