{"id":3009,"date":"2018-07-22T12:15:49","date_gmt":"2018-07-22T12:15:49","guid":{"rendered":"https:\/\/jarvee.com\/?p=3009"},"modified":"2018-07-22T12:15:49","modified_gmt":"2018-07-22T12:15:49","slug":"which-social-channels-should-i-focus-on-there-are-just-so-many","status":"publish","type":"post","link":"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/","title":{"rendered":"Which Social Channels Should I Focus On? There Are Just So Many!"},"content":{"rendered":"<p>There are so many options online, that choosing a social media platform to market your business on can be a very daunting and overwhelming task. It seems like every day new social channels appear, not to mention all the changes for the existing ones. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media.jpg\" alt=\"Internet Marketing and Social Media\" width=\"784\" height=\"553\" class=\"aligncenter size-full wp-image-2768\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media.jpg 784w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media-300x212.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media-768x542.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media-600x423.jpg 600w\" sizes=\"(max-width: 784px) 100vw, 784px\" \/><\/p>\n<p>In this tutorial, we want to make this easier for you: help you understand the social media landscape and how to best choose a network that works for you. <\/p>\n<p>Before going into which ones you should be promoting your business on let&#8217;s see a few things about each. <\/p>\n<p><a href=\"https:\/\/www.facebook.com\/\" target=\"_blank\"><strong>Facebook<\/strong><\/a> is a social networking site where you can add friends, create pages, upload photos, and update whatever is on your mind through status posts which are going to appear on the news feeds of the people who follow you or are friends with you. Online shops that specialize in various goods such as clothing, accessories and cosmetics are more likely to benefit from this site.<\/p>\n<p><a href=\"http:\/\/instagram.com\" target=\"_blank\"><strong>Instagram<\/strong><\/a> is a photo-sharing and video-sharing site where users can post images and videos and re-gram them to different sites such as Facebook, Flickr, and Tumblr. This is usually used by people who engage in online selling. Users have a choice between various filters to beautify their photos before posting them. This platform&#8217;s growth was exponential lately, especially since it started to clone Snaptchat&#8217;s features, like Instagram Stories.<\/p>\n<p><a href=\"https:\/\/twitter.com\/\" target=\"_blank\"><strong>Twitter<\/strong><\/a>, on the other hand, is a networking site where you can follow different people such as celebrities and be up-to-date with current news and trends through the use of different hashtags. Moreover, you can also post tweets which are within the 280-character limit. This is a good way to advertise your business pages since it can be viewed by many people by searching for hashtags used.<\/p>\n<p><a href=\"https:\/\/www.linkedin.com\/\" target=\"_blank\"><strong>LinkedIn<\/strong><\/a> is another site where you can create your own professional profile stating your different credentials. In here, you can build and improve trusted network connections. This is often the place to look for potential employees or employers. Lately, it has been used more and more for promoting different businesses as Linkedin allows the creation of groups and posting to your profile and groups so more and more people use it to gain more leads. Depending on your niche this might be a goldmine.<\/p>\n<p><a href=\"http:\/\/www.quora.com\" target=\"_blank\"><strong>Quora<\/strong><\/a> is a channel wherein one can ask questions and get knowledgeable answers. The questions are posted and asked by members of its user community. This is best for users who write articles as answers to the different questions asked. Moreover, the users can aggregate questions and submit the same to other users, thereby creating a network of friends with the same interest – to spread knowledge. Gaining leads is quite easy if you write informative and to the point articles and really help people with your articles.<\/p>\n<p><a href=\"https:\/\/www.pinterest.com\" target=\"_blank\"><strong>Pinterest<\/strong><\/a> is like an online corkboard where one can pin their own photos for other people’s perusal. This is of high importance and use to different retailers, photographers, and designers because this site serves as their own online photo portfolio or catalog where users can just browse and re-pin to share. It is effective for online selling.<\/p>\n<p><a href=\"http:\/\/www.youtube.com\/\" target=\"_blank\"><strong>YouTube<\/strong><\/a> is a video-sharing site where users can upload their videos and garner views. This is commonly used for online tutorial clips and do-it-yourself tips. The videos here range from music videos, podcasts, uploaded television shows and concerts to tutorials about applying cosmetics, hairdos and creating well-loved recipes. Videos here can be shared to other networking sites such as Facebook, Twitter, and Tumblr.<\/p>\n<p><a href=\"https:\/\/plus.google.com\/\" target=\"_blank\"><strong>Google Plus<\/strong><\/a> &#8211; although a little late to the game Google did its best to push this social network to all its users and as a result it sits on the 5th place after the total number of users with 395 million as of 2018. It&#8217;s a little different than Facebook for example where users tend to know their friends personally, on G+ it&#8217;s more about connections and instead of sharing life events and personal pictures it&#8217;s more about sharing content and ideas. Google+ fosters intellectual matches so if you&#8217;re into a serious business and have regular updates about your niche this might be the perfect network for you.<\/p>\n<p>Beginners of any business should be able to <a href=\"https:\/\/jarvee.com\/9-questions-to-identify-your-target-audience\/\">distinguish their target markets<\/a> before officially starting their marketing efforts. Target markets are the initial range of people who are more likely to buy from you. This is the type of people who you want to impress with your products. In other words, these are your potential and prospective customers.<\/p>\n<p>Any person who wants to engage in online selling or other business opportunities through the use of social networking channels should be knowledgeable about the main platform of their supposed business. You need to be aware of the online sites where your target market frequently visits so that you would know which networking channel you should focus on when marketing your products or the business itself.<\/p>\n<p>To further elaborate, consider asking yourself these questions:<\/p>\n<ul>\n<li>“What am I trying to sell?”<\/li>\n<li>“If I am the customer, where would I be more likely to look for these products?”<\/li>\n<\/ul>\n<p>Asking “What am I trying to sell?” is one way of knowing your products and the key to finding which social networking site is more appropriate to cater to your marketing needs. If you are planning to engage in a business that is entirely visual, like selling various clothing merchandise, cosmetics, or food, then you need a photo-sharing application or site. It is a lot better to employ a site which has optimized mobile viewing so that you need not carry your laptop or netbook wherever you go just to keep your business on track.<\/p>\n<p>Asking “If I am the customer, where would I be more likely to look for these products?” is one way of knowing your target market’s preferences. Put yourself in your customer’s shoes. If you are looking for pre-loved goods, where are you more likely to find it? Most pre-loved goods are marketed in Instagram and Facebook. The moment you find an answer, you are on the right track. You are now ready to present your products to the online world through social networking channels.<\/p>\n<p>This is considered as the best strategy in choosing the networking site where you can market effectively and gain potential clients, resulting in a business boom, popularity or increased market exposure.<\/p>\n<p>In the present time, social channels are not only used to communicate with long-lost friends or faraway relatives; nor are these solely used to stalk people or be up-to-date with the current gossips and trends. Instead, they are a new means to improve public exposure and create friendly, professional networks which can help in boosting your business website’s traffic.<\/p>\n<p>The obsession of the present generation with social media should not always be seen in a negative light. Many older people complain that social media has affected the personalities or attitudes of the teens nowadays. Teens have somehow learned how to swear or curse, there is the growing misconception of sex as something that is not exclusive to married couples only, and then there’s the propagation of porn and other acts which are deemed to be unhealthy for them.<\/p>\n<p>However, regardless of the effect of social sites to its users, one cannot deny the fact that they are platforms where marketing can be very effective if properly done. For business owners and marketers, social media is the new playground to test various marketing tactics.<\/p>\n<p>In uncovering which platform you should concentrate on, consider <a href=\"http:\/\/en.wikipedia.org\/wiki\/Pareto_principle\" target=\"_blank\">the 80-20 rule<\/a>. Find out the twenty percent of social channels where eighty percent of your niche or clients often go to or visit. This is going to be a big help in establishing where you want to create marketing ties.<\/p>\n<p>The top three social channels in today’s time are Facebook, Instagram, and Twitter. Since these are free and highly accessible in mobile devices, smartphones, and tablets, the users of these sites enjoy the ability to post and update their businesses even when they are outside the comfort of their homes.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/like-facebook.jpg\" alt=\"\" width=\"800\" height=\"530\" class=\"aligncenter size-full wp-image-3263\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/like-facebook.jpg 800w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/like-facebook-300x199.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/like-facebook-768x509.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/like-facebook-600x398.jpg 600w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><br \/>\nStatistics reveal that Facebook is the number one social networking site in the current year. This website had over 2.20 billion monthly active users in the first quarter of 2018, which is a 13% increase since last year. Founded by <a href=\"https:\/\/www.facebook.com\/zuck\" target=\"_blank\">Mark Zuckerberg<\/a> together with his roommates and student colleagues in Harvard University on February 4, 2004, its scope was initially for Harvard students only. However, today, it allows any person of thirteen years old and above, without any necessary proof, to register on the website. Facebook allows users to create their own personal profiles, look up and add other people as friends, post status updates and upload photos, create albums, pages, receive notifications from likes or comments, and exchange messages through its very own messenger. February 1, 2012, marked the social site’s Initial Public Offering (IPO). This means that stocks of the said site can now be bought in stock exchange markets and thus, anyone can become a stockholder.<\/p>\n<p>From the point of view of a businessman or a marketer, Facebook is incredibly a viable avenue to gain market exposure due to the number of its users and popularity. According to statistics, 70% of the marketers who used Facebook as their platform of choice successfully garnered new customers.<\/p>\n<p>Basically, entrepreneurs who would want to try marketing on Facebook should create a page under the name of the business. If the business is already established and has a website or a blog, it is advised to embed Facebook’s social widget there to let people know of the existence of the page. It has to be frequently updated with juicy content so as to entice other users to notice your page. It is better to post status updates that contain direct links to your business’ official site so the interested clients do not have to look for it on the website. Promoting this page to your Facebook friends and asking for help from them to also promote the same to their friends would help the page gain more public exposure, resulting in likes. One can also tie up the page to Twitter to increase marketing efforts.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/05\/instagram-marketing.jpg\" alt=\"\" width=\"800\" height=\"623\" class=\"aligncenter size-full wp-image-3296\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/05\/instagram-marketing.jpg 800w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/05\/instagram-marketing-300x234.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/05\/instagram-marketing-768x598.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/05\/instagram-marketing-600x467.jpg 600w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><br \/>\n<a href=\"https:\/\/www.instagram.com\/\" target=\"_blank\">Instagram<\/a> recently became one of the most powerful social platform used by marketers to advertise or promote their products, services or business. This social networking site is owned and powered by Facebook, and it is currently the fastest-growing social networking site with over 800 million monthly active users and it is believed to reach the 1 billion mark this year. The emerging popularity of Instagram is mostly because it is highly accessible and easy to use and the use of visual aesthetics makes it essential for businesses. Tha fact that you can only use your links in Bio, makes this platform even more attractive to its users and requires more creative marketing strategies, making it more appealing to marketing teams as well. To market using this platform, one needs to know more than just a few tricks: how to <a href=\"https:\/\/jarvee.com\/how-to-use-canva-to-create-high-quality-instagram-posts\/\">create compelling visual content <\/a>, <a href=\"https:\/\/jarvee.com\/complete-hashtag-research-for-any-niche-with-jarvee\/\">how to find and use effective hashtags<\/a>, <a href=\"https:\/\/jarvee.com\/how-instagram-stories-can-enhance-account-growth\/\">how to use stories to market your business<\/a>, and most importantly <a href=\"https:\/\/jarvee.com\/how-to-grow-your-instagram-accounts-like-a-pro-with-jarvee\/\">how to boost your  accounts&#8217; growth<\/a>.<br \/>\nDue to its popularity, we created quite a few Instagram tutorials over the years. Here are the most important ones, that will guarantee you explosive growth in a short period of time:  <a href=\"https:\/\/jarvee.com\/the-only-instagram-tutorials-you-will-ever-need-to-master-social-media-marketing\/\">The Only Instagram Tutorials You Will Ever Need to Master Social Media Marketing <\/a>.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/01\/promoting-your-travel-agency-on-twitter.jpg\" alt=\"promoting-your-travel-agency-on-twitter\" width=\"293\" height=\"288\" class=\"aligncenter size-full wp-image-2539\" \/><br \/>\nThe third most popular networking site is Twitter. Since its creation in March 2006 to the present time, it has gained a lot of attention from commoners to celebrities. Twitter has over 330 million users to date. Twitter is considered a micro-blogging site since it allows its users to post updates in a 280-character limit labeled as tweets. Users can also post pictures via twitter’s accredited partner applications or sites such as twitpic. Moreover, users are allowed to follow whoever they want and can make use of the hashtags to promote or trend a certain topic. For marketers, hashtags are good avenues to make their products or business more searchable. For established businesses, the use of Twitter ads is a good option too. Twitter ads are sponsored advertisements that appear randomly on the user’s timelines. As with Facebook, one can also use twitter widgets on their official websites to further inform other people that they also have a Twitter account. Creation of profiles under the business name and beautifying it in accordance with the business theme or agenda is one way to start in Twitter. Then you can start following various users. However, be careful since Twitter has rules about aggressive following so you’d better take it slow. Moreover, once you follow a public user, you can read their tweets. Take time to know the people you want to follow to make sure that they qualify as potential customers. The next step would be to start tweeting. Marketers can use the tweet function of Twitter to further promote their product by including direct links in the tweet contents. You can also link your Twitter account with other networking sites such as Facebook and Tumblr.<\/p>\n<p>What you need to remember though: always test, measure your results and then repeat! Start small and test a few essential platforms, see what works for you and your audience and then add more social channels to the mix. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are so many options online, that choosing a social media platform to market your business on can be a very daunting and overwhelming task. It seems like every day new social channels appear, not to mention all the changes for the existing ones. In this tutorial, we want to make this easier for you: [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[23],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Which Social Channels Should I Focus On? There Are Just So Many! - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Which Social Channels Should I Focus On? There Are Just So Many! - Jarvee\" \/>\n<meta property=\"og:description\" content=\"There are so many options online, that choosing a social media platform to market your business on can be a very daunting and overwhelming task. It seems like every day new social channels appear, not to mention all the changes for the existing ones. In this tutorial, we want to make this easier for you: [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-07-22T12:15:49+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media.jpg\",\"width\":784,\"height\":553,\"caption\":\"Internet Marketing and Social Media\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#webpage\",\"url\":\"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/\",\"name\":\"Which Social Channels Should I Focus On? There Are Just So Many! - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#primaryimage\"},\"datePublished\":\"2018-07-22T12:15:49+00:00\",\"dateModified\":\"2018-07-22T12:15:49+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Which Social Channels Should I Focus On? There Are Just So Many!\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Which Social Channels Should I Focus On? There Are Just So Many! - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/","og_locale":"en_US","og_type":"article","og_title":"Which Social Channels Should I Focus On? There Are Just So Many! - Jarvee","og_description":"There are so many options online, that choosing a social media platform to market your business on can be a very daunting and overwhelming task. It seems like every day new social channels appear, not to mention all the changes for the existing ones. In this tutorial, we want to make this easier for you: [&hellip;]","og_url":"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/","og_site_name":"Jarvee","article_published_time":"2018-07-22T12:15:49+00:00","og_image":[{"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media.jpg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/Internet-Marketing-and-Social-Media.jpg","width":784,"height":553,"caption":"Internet Marketing and Social Media"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#webpage","url":"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/","name":"Which Social Channels Should I Focus On? There Are Just So Many! - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#primaryimage"},"datePublished":"2018-07-22T12:15:49+00:00","dateModified":"2018-07-22T12:15:49+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/which-social-channels-should-i-focus-on-there-are-just-so-many\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Which Social Channels Should I Focus On? There Are Just So Many!"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3009"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=3009"}],"version-history":[{"count":2,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3009\/revisions"}],"predecessor-version":[{"id":3654,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3009\/revisions\/3654"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=3009"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=3009"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=3009"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}