{"id":3023,"date":"2018-06-30T00:45:06","date_gmt":"2018-06-30T00:45:06","guid":{"rendered":"https:\/\/jarvee.com\/?p=3023"},"modified":"2018-06-30T00:45:06","modified_gmt":"2018-06-30T00:45:06","slug":"social-media-at-work-5-ways-to-increase-productivity-with-social-media","status":"publish","type":"post","link":"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/","title":{"rendered":"Social Media at Work: 5 Ways to Increase Productivity with Social Media"},"content":{"rendered":"<p>Are there really ways to increase productivity with social media at the workplace? Despite the ever-increasing number of social media in this day and age, a huge number of employers still frown upon whenever they catch their employees on their social media accounts during office hours. They see only the black and white of the matter, but in this article we would like to point out several ways to make social media a productive tool.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity.jpg\" alt=\"\" width=\"800\" height=\"533\" class=\"aligncenter size-full wp-image-3621\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity.jpg 800w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity-300x200.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity-768x512.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity-600x400.jpg 600w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>Increasing productivity with social media at work is a relatively novel idea. There have been several studies in recent times which conclude the aforementioned. It may seem counterintuitive: being occupied with that which takes one away from the main task at hand. There are effective ways, however, to make social media a channel for productivity at work.<\/p>\n<h3>#1 Social Media as Brain Breather<\/h3>\n<p>A <a href=\"http:\/\/www.tandfonline.com\/doi\/pdf\/10.1080\/08959285.2013.765878\">study<\/a> conducted by Dr. Brent L. S. Coker of the University of Melbourne concludes that there is an increase in the productivity with social media usage in the workplace. Published in 2013, this study has devised the term “workplace Internet leisure browsing,” or also known as WILB. It has positive effects, at least for the younger members of the workforce, in getting back the concentration of the employees. It is also pointed out that WILB should be perceived as an informal break, as with water cooler and cigarette breaks.<\/p>\n<p>According to the said study, an increased productivity with social media at work can be achieved through moderate WILB. This study involved 300 workers, and 70% of them used the internet for personal matters. Those who surf websites of personal interest, which includes social media and news channels, less than 20% of the employee’s total office time result in a 9% productivity increase.<\/p>\n<p>WILB increases the productivity as it refreshes the mind off pressing tasks at hand. The employee is able to check on other aspects of their lives and be updated with affairs outside the workplace.  As social media breaks provide mental palate cleaners, it refreshes the mind to be able to tackle pending tasks with a better level of concentration. The small break might even be useful for the employee to acquire fresh ideas and alternative points of views for their work matters.<\/p>\n<p>Looking at WILB as a way to increase productivity, we could consider the point of view of Dr. Coker to see WILB as a form of work breaks. Breaks improve the vigilance in performing at work by bringing back attentional resources. It also improves the employee for more effective decisions in the future, and develop a better coping mechanism for workplace stress.<\/p>\n<h3>#2 Establishment of Social Media Presence<\/h3>\n<p>To increase productivity with social media employers might want to look at the upside of employees who are active on this platform. The employee constantly on Facebook could create and manage the company page. The employee who likes to create and share Tweets may be a source of valuable online information beneficial for the company.<\/p>\n<p>Increasing productivity through an establishment of a company’s online presence is advantageous to the company. It serves as a strategic marketing tool to identify target markets who can bring the most profit to the company. It also becomes a potential for business opportunities as well. It is also beneficial for feedback to improve services and products delivered, and even company-client relations.<\/p>\n<p>A good read for those who want to increase productivity with social media in the workplace is the paper by Nivedita Aggarwal and Giridhar Buggarapu of CA Technologies. <a href=\"http:\/\/www.ca.com\/de\/~\/media\/files\/about%20us\/catx\/using-social-media-to-improve-efficiency-and-productivity-in-it-organizations.pdf\">Using Social Media to Improve Efficiency and Productivity in IT Organizations<\/a> which argues that social media easily penetrates target customers more effectively than the conventional marketing strategies. It is more cost-efficient, has a wider audience (global), and is more flexible to cater to the needs and wants of the customers, how they need it when they need it.<\/p>\n<p>Understanding markets is also a way to increase productivity with social media. The clamor for a particular feature, design, product and\/or service will lead to the company innovating and inventing to satisfy the market. There have been major global companies who have seen the advantages of social media marketing over traditional marketing. With the said perspective shift, they have saved millions to make their products known to the public.<\/p>\n<p>Feedback gathering increases productivity with social media use at work. It is a strong determinant of what makes, maintains, and breaks a business. The handling grievance is better at resolving customer concerns than having to ensure damage control measures over a negative feedback posted online. Proactive use of feedback maintains customers and builds trust and loyalty of the consumers to the product or service.<\/p>\n<h3>#3 Competitor Research<\/h3>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity-with-social-media.jpg\" alt=\"\" width=\"800\" height=\"444\" class=\"aligncenter size-full wp-image-3622\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity-with-social-media.jpg 800w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity-with-social-media-300x167.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity-with-social-media-768x426.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity-with-social-media-600x333.jpg 600w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><br \/>\nLearning about the other players in the same product, service, and industry is a way to increase productivity with social media at work. For those who are veterans in their field, they have already a fair idea how similar-goal companies have been operating for the past years. For those who just got on the business bandwagon, they are still trying to figure out themselves. In both cases, the knowledge about the competition is vital for one’s progress and development.<\/p>\n<p>Increasing productivity with social media through competitor research has several advantages. In your competitor’s social media accounts, one can check on the content which gathers the most engagements from their audience. One can look at posts with the most number of likes, comments, and shares to know what interests the people. A company can also use this data to analyze certain themes which are popular at certain periods of time in relation to particular demographics.<\/p>\n<p>Being aware of the influential personalities who interact with one’s competitor through their accounts is really important for your business. These influencers made it to the top of the social media world in their respective fields, and have garnered a huge number of followers along the way. Their followers believe in what these influencers believe in. Therefore, it is important to learn how and what to become as a company to get the attention of these influencers.<\/p>\n<p>Affiliations of one’s competitors may serve as vital information to increase productivity at work. These affiliations may also be other competitors, suppliers, influencers, neophytes in the industry, and possible customers. The network of one’s competitors may also provide information on their potential future courses of action. It helps one anticipate any possible trends or even failures to look out in the future.<\/p>\n<h3>#4 Information Dissemination<\/h3>\n<p>Those in the public sector have other ways to increase productivity with social media in their workplace. Among other things, disseminating information to the general public through various social media channels is advantageous. Widely used by the youth, sharing information is easier and faster when coursed through in this manner. It also lessens the expenses of the local and national government units to make the people aware of the pertinent information.<\/p>\n<p>Departments and offices related to the weather have experienced an increase in productivity with social media. Giving out updated information is convenient as they can attach links and pictures to the posts that they create online. People are able to share the information faster with their friends and family. The reliability of the information is also high since social media channels indicate verified accounts, aside from the official websites of the said departments.<\/p>\n<p>Disaster management departments and offices also increase productivity with social media whenever they post bulletins. Infographics are the most effective ways to share information with the people. It is a simplified, attractive, yet effective communication tool since one can customize the content with relevant images and data. There are <a href=\"https:\/\/jarvee.com\/5-tools-help-create-infographics-social-media-marketing\/\">several tools online<\/a> to create these infographics, each user-friendly for fast creation and sharing.<\/p>\n<p>Executive offices also declare important memoranda thus increasing productivity with social media. The office of the local or national chief executive can post official declarations and announcements. The highly anticipated annual official national holiday list is being utilized by the working and the non-working sectors to mark their calendars and file their leaves when applicable. This also enables the people to be assured that the government is coping with the changes of the times to be able to communicate efficiently and effectively with the people for shared concerns and responsibilities.<\/p>\n<h3>#5 Employee Retention<\/h3>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/social-media-at-work.jpg\" alt=\"\" width=\"800\" height=\"533\" class=\"aligncenter size-full wp-image-3623\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/social-media-at-work.jpg 800w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/social-media-at-work-300x200.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/social-media-at-work-768x512.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/social-media-at-work-600x400.jpg 600w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><br \/>\nKeeping the employees loyal to the company is also one of the ways to increase productivity with social media. Recognizing the achievements and good performance of the employees through the company’s announcements on their social network profiles keeps the employee motivated. They appreciate that the company acknowledges their efforts to attain company goals, while they achieve their personal goals as well.<\/p>\n<p>Employees who are into social media engagement get an increase in their productivity with social media use at work. They feel closer to the company since they are being placed on a pedestal for the good they have done and the improvement of their presence within the company.<\/p>\n<h3>Wrapping it up<\/h3>\n<p>In sum, there are several effective ways to increase productivity with social media at work. Private and public institutions benefit from these platforms, making their goals internally and externally easier to achieve. Seeing how social media can create a positive impact in the workplace can hopefully increase more institutions in considering social media to be an imperative part of work.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are there really ways to increase productivity with social media at the workplace? Despite the ever-increasing number of social media in this day and age, a huge number of employers still frown upon whenever they catch their employees on their social media accounts during office hours. They see only the black and white of the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[23],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Social Media at Work: 5 Ways to Increase Productivity with Social Media - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Social Media at Work: 5 Ways to Increase Productivity with Social Media - Jarvee\" \/>\n<meta property=\"og:description\" content=\"Are there really ways to increase productivity with social media at the workplace? Despite the ever-increasing number of social media in this day and age, a huge number of employers still frown upon whenever they catch their employees on their social media accounts during office hours. They see only the black and white of the [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-06-30T00:45:06+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity.jpg\",\"width\":800,\"height\":533},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#webpage\",\"url\":\"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/\",\"name\":\"Social Media at Work: 5 Ways to Increase Productivity with Social Media - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#primaryimage\"},\"datePublished\":\"2018-06-30T00:45:06+00:00\",\"dateModified\":\"2018-06-30T00:45:06+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Social Media at Work: 5 Ways to Increase Productivity with Social Media\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Social Media at Work: 5 Ways to Increase Productivity with Social Media - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/","og_locale":"en_US","og_type":"article","og_title":"Social Media at Work: 5 Ways to Increase Productivity with Social Media - Jarvee","og_description":"Are there really ways to increase productivity with social media at the workplace? Despite the ever-increasing number of social media in this day and age, a huge number of employers still frown upon whenever they catch their employees on their social media accounts during office hours. They see only the black and white of the [&hellip;]","og_url":"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/","og_site_name":"Jarvee","article_published_time":"2018-06-30T00:45:06+00:00","og_image":[{"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity.jpg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/06\/productivity.jpg","width":800,"height":533},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#webpage","url":"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/","name":"Social Media at Work: 5 Ways to Increase Productivity with Social Media - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#primaryimage"},"datePublished":"2018-06-30T00:45:06+00:00","dateModified":"2018-06-30T00:45:06+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/social-media-at-work-5-ways-to-increase-productivity-with-social-media\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Social Media at Work: 5 Ways to Increase Productivity with Social Media"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3023"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=3023"}],"version-history":[{"count":3,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3023\/revisions"}],"predecessor-version":[{"id":3624,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3023\/revisions\/3624"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=3023"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=3023"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=3023"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}