{"id":3070,"date":"2018-03-30T17:43:00","date_gmt":"2018-03-30T17:43:00","guid":{"rendered":"https:\/\/jarvee.com\/?p=3070"},"modified":"2018-03-30T17:43:00","modified_gmt":"2018-03-30T17:43:00","slug":"10-types-of-visual-content-to-use-in-your-content-marketing","status":"publish","type":"post","link":"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/","title":{"rendered":"10 Types Of Visual Content To Use In Your Content Marketing"},"content":{"rendered":"<p>In creating articles, your visual content is as important as your text. This is what separates your post from thousands of similar write-ups of the same topic. <\/p>\n<p>People are more stimulated visually and <a href=\"http:\/\/bit.ly\/Mobfc9\">90% of the information transmitted<\/a> to the brain is visual. With the help of visual images, readers have a higher probability of remembering your post than with simple text. <\/p>\n<p>Visual content is a big help in customer retention. It is your best weapon to create an immediate impact with limited time despite the fact that people are already overloaded with information with so many articles on all topics available online. Also, visuals help in creating better understanding and lesser confusion for readers who took the time to read your post.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images.jpg\" alt=\"\" width=\"800\" height=\"600\" class=\"aligncenter size-full wp-image-3111\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images.jpg 800w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images-300x225.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images-768x576.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images-600x450.jpg 600w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<h3>Listed below are 10 types of visual content you can use:<\/h3>\n<h3>#1 Infographics<\/h3>\n<p>Many marketers favor this type of visual content which is shared and liked 3x more than any other visual materials available.<\/p>\n<p>Infographics is an information tool that compresses a lot of information in one single medium. It simplifies what your entire article is all about. Aside from the pictures, it is loaded with texts, graphs, etc. to give you a clearer idea of what the topic is all about.<\/p>\n<p>In <a href=\"http:\/\/naldzgraphics.net\/tips\/reasons-why-infographics-are-important\/\">10 Reasons why Infographics are important<\/a>, it stated that this type of visual content:<\/p>\n<ul>\n<li>Makes info more appealing<\/li>\n<li>Shows valuable Ideas<\/li>\n<li>Attention grabbing<\/li>\n<li>Easier to understand<\/li>\n<li>Lessens boredom<\/li>\n<li>Awakens one’s interest<\/li>\n<li>Accessible<\/li>\n<li>Persuasive<\/li>\n<li>Memorable<\/li>\n<li>Can easily relay information<\/li>\n<\/ul>\n<p>If you have the data to back you up and you also have other visual contents that you need to use to further explain your ideas then this is the perfect visual for you. <\/p>\n<p>Infographics are best used when you have available data that you want to share with the public and the only way that it can be understood immediately by the reader is when you include pictures and graphs.<\/p>\n<h3>#2 Pictures<\/h3>\n<p>A picture can paint ten thousand words as the old saying goes. A picture can tell the reader a lot of information in just a few seconds that your texts can never do. <\/p>\n<p>Lengthy articles especially need pictures as the images will break the monotony (or possible, boredom) of reading a comprehensive post. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/08\/images.jpeg\" alt=\"\" width=\"1500\" height=\"1003\" class=\"aligncenter size-full wp-image-1337\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2017\/08\/images.jpeg 1500w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/08\/images-300x201.jpeg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/08\/images-768x514.jpeg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/08\/images-1024x685.jpeg 1024w, https:\/\/jarvee.com\/wp-content\/uploads\/2017\/08\/images-600x401.jpeg 600w\" sizes=\"(max-width: 1500px) 100vw, 1500px\" \/><br \/>\nIn fact, pictures will make it easier for your readers to remember your articles. In most cases, readers will only remember a few key points of your article but chances are, they will remember the image attached to your article.<\/p>\n<p>Articles with images get 94% more total views, according to <a href=\"http:\/\/www.jeffbullas.com\/2012\/05\/28\/6-powerful-reasons-why-you-should-include-images-in-your-marketing-infographic\/\">Jeff Bullas<\/a>. <\/p>\n<p>You want your article to have as many viewers as possible so better include quality pictures to your blog posts.<\/p>\n<p>And no, not any picture will do. It is always preferable to use clear high definition images. You don’t even have to hire a professional photographer just to get them. You may even use your smartphones to capture these images. <\/p>\n<p>For a more personalized approach to advertising your product or service better, it is more suitable to use your own pictures instead of getting stock free or royalty free images from Google.<\/p>\n<p>Images will also help your readers in understanding and making purchase decisions. This is especially true if your business is in the e-commerce industry. People would like to see the picture of the goods that they are purchasing, and the probability of closing a sale is really high when good quality images are included in your content.<\/p>\n<h3>#3 Quote Cards\/Macros <\/h3>\n<p>Do you have any quotes in your content that you want to highlight? The quote card is specifically created for this. <\/p>\n<p>Quote cards are text cards highlighting the phrase or saying you wanted to be emphasized. You may add an image to it.<\/p>\n<p>Quote cards or macros are similar to memes. The only difference here is you are quoting a person or phrase, and not to imitate or spoof it. <\/p>\n<p>So you want to highlight a famous quote you’ve borrowed? Then create a quote box for it.<\/p>\n<h3>#4 Videos<\/h3>\n<p>Videos are series of images recorded or broadcasted to provide a clearer picture (more often with video or narration) of the topic. <\/p>\n<p>A staggering <a href=\"http:\/\/www.socialmediatoday.com\/content\/consumers-64-more-likely-purchase-product-after-watching-online-video-infographic\">64% of readers<\/a> who viewed the video are more likely to purchase goods and services advertised in the video online.<br \/>\n<img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/the-best-way-to-create-your-own-youtube-videos.jpg\" alt=\"the-best-way-to-create-your-own-youtube-videos\" width=\"388\" height=\"293\" class=\"aligncenter size-full wp-image-2745\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/the-best-way-to-create-your-own-youtube-videos.jpg 388w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/02\/the-best-way-to-create-your-own-youtube-videos-300x227.jpg 300w\" sizes=\"(max-width: 388px) 100vw, 388px\" \/><\/p>\n<p>These videos need not be long. No matter what the length of your article is, videos are just visual aids to support your brand, so they don’t have to be lengthy. Rule of thumb is to make your videos as short as possible since this guarantees a better percentage in reader engagement.<\/p>\n<p>Videos allow you to say a lot of things without taking too much space. A 30-second video tells a consumer a lot of things more than a thousand-word article is. It doesn’t take as much time to watch a video compared to reading a lengthy article. <\/p>\n<p>Acceptable length of the video is dependent on what kind of video you are adding to your content. <\/p>\n<p><a href=\"http:\/\/thenextweb.com\/socialmedia\/2014\/05\/02\/optimal-length-video-marketing-content-short-possible\/\">TNW News<\/a> said these are the appropriate length for each video type:<\/p>\n<ul>\n<li>Tutorials\/Explainers- 45-90 seconds <\/li>\n<li>Creative Commercials- 15-59 seconds<\/li>\n<li>Crowdfunding- average 2:30 minutes (create credibility of the project, speaks in depth about the topic)<\/li>\n<li>Testimonials- 60-119 seconds <\/li>\n<\/ul>\n<p>In <a href=\"https:\/\/www.vidyard.com\/blog\/importance-of-video-content-marketing\/\">Kimbe MacMaster’s article in Vidyard<\/a>, she mentioned that video is important to content marketing due to the following reasons:<\/p>\n<ul>\n<li>Increased customer conversions<\/li>\n<li>Stronger emotional connections<\/li>\n<li>Rise in accessibility<\/li>\n<li>Better email click-throughs<\/li>\n<li>Higher retention rates<\/li>\n<li>Greater optimization opportunities<\/li>\n<li>More video-favored technology<\/li>\n<li>Higher engagement<\/li>\n<li>Stronger consumer attention<\/li>\n<li>Improve SEO<\/li>\n<\/ul>\n<p>Videos can also improve a brand&#8217;s chances of converting readers to customers with the help of social media engagement and email marketing.<\/p>\n<h3>#5 Graphical data<\/h3>\n<p>This is a statistical presentation with graphs and charts that are usually used to illustrate a relationship or a comparison between subjects.<\/p>\n<p>Graphical data representation includes pies, bar, columns, areas, stock and many more.<\/p>\n<p>According to <a href=\"http:\/\/www.sas.com\/en_us\/insights\/big-data\/data-visualization.html\">SAS’s article<\/a> regarding the importance of visualizing data, <em>“Visualizations help people see things that were not obvious to them before. Even when data volumes are very large, patterns can be spotted quickly and easily. Visualizations convey information in a universal manner and make it simple to share ideas with others. “<\/em><\/p>\n<p>For example, you have a startup business, and you have been using Twitter as your platform to drive traffic to your website. On the first month, your Twitter shares and likes were just organic but in the second month, you gave their Twitter Ads a try. You noticed a significant increase in your shares and likes; when you put the data on a graph, it would be for the reader to compare the results just by looking at the graphs you presented.<\/p>\n<p>Graphical data allows your readers to analyze trends or relationships in the data you collated. Quantitative data is easier to explain with graphs instead of words or numbers in a tabular format. Google Analytics uses Graphical Data for their reports.<\/p>\n<p>There are easy to use software you can use for creating your graphs and charts:<\/p>\n<ul>\n<li>Microsoft Excel- is one of the software applications included in the Microsoft Office software. Ideally used by people using Windows Operating system.<\/li>\n<li>Numbers- is a spreadsheet application designed for MAC users.<\/li>\n<li>Illustrator- is a program by Adobe that artists and designers use to create vector images.<\/li>\n<\/ul>\n<p>There are also web-based applications you can use to customize these graphs including <a href=\"https:\/\/www.lucidchart.com\/\">Lucid Charts<\/a>, <a href=\"https:\/\/www.processon.com\/\">Process On<\/a>, and <a href=\"http:\/\/icharts.net\/\">iCharts<\/a> to name a few.<\/p>\n<h3>#6 Screenshots<\/h3>\n<p>Also called screen capture, the screenshot is a copy or image you took of a document. Computers and smartphones have print screen capabilities. <\/p>\n<p>There are web-based screen capture tools you might want to try for free or for a price. <\/p>\n<p>If the product or service you are offering is technical in nature, screenshots would be particularly useful as this would serve an actual documentation of what has happened at that exact moment.<\/p>\n<p>A good example of the importance of screenshot would be when your blog post is about the installation errors you were getting when you tried to update the software on your device. <\/p>\n<p>Screen captures are also useful when you would like to document a time stamp, like in this example of a Skype video call that recorded the actual time plus the faces of the two doing the call when this screenshot happened.<\/p>\n<h3>#7 Visual step by step instructions<\/h3>\n<p>A visual step by step instruction is a series of photographs or steps wherein each photograph will have the instruction and its corresponding photo based on their sequence. This is particularly helpful if your content is about using the product or service that you are promoting.<\/p>\n<p>Like in this sample image, a novice baker would not be intimidated in baking a cake for the first time when he has a visual picture of the steps he will be doing as opposed to reading the instructions out of the recipe and trying to figure it out on his own.<\/p>\n<p>A visual step by step instruction is especially important when the instructions are difficult to follow for the average Joe. Without this type of visual aid, most of your readers will abandon your post because they are too lazy to try it on their own.<\/p>\n<h3>#8 Call to Action<\/h3>\n<p>CTA is a marketing tool entrepreneurs use to get an immediate response from readers. This is usually a banner button that the reader can click to take part of what you have to offer. CTAs are effective in guaranteeing your conversion.<\/p>\n<p>A blog post no matter how well it is written is considered incomplete or unsuccessful without the CTA button. Effective CTA key phrases you can use include:<\/p>\n<p>However, it is very important that there must be a connection between your content and your CTA. The result of clicking the CTA button should be relevant to the theme or subject of the page or blog post where it came from. <\/p>\n<p>If there is no relationship between these two, chances are, it would only confuse your reader and chances of converting your reader into a customer would be very slim.<\/p>\n<p>Another Call to Action button that would be really helpful to you is the Share button. You may include a share button at the end of your article so that the reader can share it to their own social media sites. <\/p>\n<p>If you want immediate conversions from your post, then do not forget to include a Call to Action button.<\/p>\n<h3>#9 Questions\/Quiz<\/h3>\n<p>Highlighting a question in your content is one way of inviting your readers to a close collaboration with you. Q&#038;A is a brilliant marketing tool to ensure your reader’s engagement. <\/p>\n<p>You may include questions answerable with a <b>Yes<\/b> or <b>No<\/b> but if you want to achieve reader engagement, it’s best to include questions that your readers can provide you with in-depth answers and the opportunity to create a writer-reader relationship with them.<\/p>\n<p>You could also include a series of questions or quiz in your post. Yes or No answers are good, but you can also give multiple choices. <\/p>\n<p>Readers want to feel a closer kinship to you via your article and inviting them to take part of the quiz will ensure that.<\/p>\n<h3>#10 Memes<\/h3>\n<p>Memes are similar to Quote Cards, but they are satirical mimicries of news, events among other things and their main goal here is to make your content go viral. <\/p>\n<p>They are created to be humorous and often times sarcastic depiction of current topics trending around the world. Memes can also come in the form of videos, songs, recipes and jokes.<\/p>\n<p>The term meme was first used in 1976 by Richard Dawkins in his book “The Selfish Gene”. It came from the Greek word mimeme which means “to imitate”. <\/p>\n<p>Familiar with the term good for the laughs? This is what memes are all about. <\/p>\n<p>If you want to break the monotony of the tone of your article with a comic relief, then inserting a meme will be a good idea. Readers often share memes in various social media platforms.<\/p>\n<p>So how are memes created? <\/p>\n<p>Do you have a picture or series of images you want to be included in your post? <\/p>\n<p>Make a collage of it and include funny or sarcastic descriptions of the said picture and voila! &#8211; You have just created your first meme.<\/p>\n<h3>Wrapping It Up<\/h3>\n<p>Content marketing is a really helpful tool for your business especially when you are just starting up and would like to create a credible online presence. Use this to your advantage. And a really good write up gets more notice faster when you add visuals arranged strategically in your article. <\/p>\n<p>Your writing and visuals should come hand in hand to make content marketing effective.<\/p>\n<p>As an entrepreneur, it is your responsibility to your business to ensure that you have maximized the Internet to promote your products or services for free. <\/p>\n<p>There is no better way to drive traffic to your site than by creating quality well-researched articles with really interesting visual content to attract more people to read it and perhaps share it with their own social media sites or websites. Try adding a combination of these visual aids to your content and your website’s ranking will significantly improve. <\/p>\n<p>Improvement on website traffic won’t happen overnight but by regularly publishing good content with quality visuals, you are already a step forward in creating a reader base from your subscribers. <\/p>\n<p>Try using different visuals or combinations of them in your posts. It is also important for you to note which medium is trending at the moment. <\/p>\n<p>A good marketer knows the latest trends and applies them to his own business. One way of knowing this is to make it your business to check competitor sites and see what’s going viral on popular social media sites like Facebook and Twitter.<\/p>\n<p>Want your posts to go viral? Be clever in your visual content.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In creating articles, your visual content is as important as your text. This is what separates your post from thousands of similar write-ups of the same topic. People are more stimulated visually and 90% of the information transmitted to the brain is visual. With the help of visual images, readers have a higher probability of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[23],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>10 Types Of Visual Content To Use In Your Content Marketing - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"10 Types Of Visual Content To Use In Your Content Marketing - Jarvee\" \/>\n<meta property=\"og:description\" content=\"In creating articles, your visual content is as important as your text. This is what separates your post from thousands of similar write-ups of the same topic. People are more stimulated visually and 90% of the information transmitted to the brain is visual. With the help of visual images, readers have a higher probability of [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-03-30T17:43:00+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images.jpg\",\"width\":800,\"height\":600},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#webpage\",\"url\":\"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/\",\"name\":\"10 Types Of Visual Content To Use In Your Content Marketing - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#primaryimage\"},\"datePublished\":\"2018-03-30T17:43:00+00:00\",\"dateModified\":\"2018-03-30T17:43:00+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"10 Types Of Visual Content To Use In Your Content Marketing\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"10 Types Of Visual Content To Use In Your Content Marketing - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/","og_locale":"en_US","og_type":"article","og_title":"10 Types Of Visual Content To Use In Your Content Marketing - Jarvee","og_description":"In creating articles, your visual content is as important as your text. This is what separates your post from thousands of similar write-ups of the same topic. People are more stimulated visually and 90% of the information transmitted to the brain is visual. With the help of visual images, readers have a higher probability of [&hellip;]","og_url":"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/","og_site_name":"Jarvee","article_published_time":"2018-03-30T17:43:00+00:00","og_image":[{"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images.jpg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/03\/high-quality-images.jpg","width":800,"height":600},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#webpage","url":"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/","name":"10 Types Of Visual Content To Use In Your Content Marketing - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#primaryimage"},"datePublished":"2018-03-30T17:43:00+00:00","dateModified":"2018-03-30T17:43:00+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/10-types-of-visual-content-to-use-in-your-content-marketing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"10 Types Of Visual Content To Use In Your Content Marketing"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3070"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=3070"}],"version-history":[{"count":2,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3070\/revisions"}],"predecessor-version":[{"id":3193,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3070\/revisions\/3193"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=3070"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=3070"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=3070"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}