{"id":3220,"date":"2018-04-11T13:38:48","date_gmt":"2018-04-11T13:38:48","guid":{"rendered":"https:\/\/jarvee.com\/?p=3220"},"modified":"2018-04-11T13:38:48","modified_gmt":"2018-04-11T13:38:48","slug":"guide-how-to-use-social-media-market-your-e-book","status":"publish","type":"post","link":"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/","title":{"rendered":"Full Guide on How To Use Social Media To Market Your E-Book"},"content":{"rendered":"<p>All the experts in the field recommend that you should start to market your e-book even before you even start writing it. You probably heard this advice before, but you’re not sure how to apply it. Don&#8217;t worry though we got you covered, we’ll describe the exact steps you need to take in detail below.<\/p>\n<p>‘That’s awesome… but I already wrote my e-book! So, now what?’ Don’t worry! You can follow the same steps, the difference is that it might take a little more time before you start selling your copies. 😉<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/marketing-you-ebook.jpg\" alt=\"market your e-book\" width=\"300\" height=\"275\" class=\"aligncenter size-full wp-image-3221\" \/><\/p>\n<p>So you have a great idea for a new e-book? Awesome! Here is how to get started:<\/p>\n<h2>Define your audience<\/h2>\n<p>Find out who would want to read your e-book. Learn everything you can about them: their passions, their aspirations, their habits: online and offline, age, environment, problems and so on. What social networks they use? What subjects would capture their interest?<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/define-your-audience-before-writing-the-ebook.jpg\" alt=\"define-your-audience-before-writing-the-ebook\" width=\"403\" height=\"271\" class=\"aligncenter size-full wp-image-3222\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/define-your-audience-before-writing-the-ebook.jpg 403w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/define-your-audience-before-writing-the-ebook-300x202.jpg 300w\" sizes=\"(max-width: 403px) 100vw, 403px\" \/><\/p>\n<p>You need to know every aspect about these people’s lives, because you want to inspire them with your stories. Find them in their own habitat and engage them. Don’t be shy, start conversations, ask questions. This may be the most important step in marketing your e-book!<\/p>\n<p>Take your time and do your research and create a pseudo-profile about your reader. This will help you, marketing wise, in every step of the way from this point on and it&#8217;s something you really need to do if you&#8217;re planning to market your e-book.<\/p>\n<h2>Come up with a killer title for your e-book<\/h2>\n<p>Yes, I know it’s very difficult to find a perfect title for your e-book and overwhelming at the same time, but the title is the first impression people get when they see it (that’s the overwhelming part). Your audience will read your title and decide whether to buy it or not. Don’t despair though! With a little preparation and brainstorming on your part, you can find the perfect title for your e-book!<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/finding-the-perfect-title-for-your-e-book.jpg\" alt=\"finding-the-perfect-title-for-your-e-book\" width=\"445\" height=\"270\" class=\"aligncenter size-full wp-image-3226\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/finding-the-perfect-title-for-your-e-book.jpg 445w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/finding-the-perfect-title-for-your-e-book-300x182.jpg 300w\" sizes=\"(max-width: 445px) 100vw, 445px\" \/><\/p>\n<p>Here are some tips to help you while researching a great title:<\/p>\n<ul>\n<li>See other titles in your genre. Search Amazon for the bestsellers in your genre and see what do the top 10 or 20 titles have in common? Write down anything that you notice and think how you can use it in your case.<\/li>\n<li>Think about the content of your e-book: is there anything in there that stands out? A line or a memorable phrase?<\/li>\n<li>Find strong and unique words in old books, songs or poems for inspiration.<\/li>\n<li>Go on Goodreads and analyze the title of user’s favorite books in your genre.<\/li>\n<li>Ask friends and family for help! Sometimes a new perspective is just what you need.<\/li>\n<li>When you think you have the title, don’t forget to search for it (on Google, Amazon, Goodreads) to see if it doesn’t already exists or have other meanings that you want to avoid.<\/li>\n<\/ul>\n<p>Don’t worry if it takes some time and if you change your mind several times while brainstorming, you want your title to be perfect!<\/p>\n<h2>Create a great cover for your e-book <\/h2>\n<p>According to researches, 74% of a reader’s buying decision is based on the book&#8217;s cover alone. So you might want to get this one right. But don’t worry too much, at this point you want a cover for your social profiles, you can change it later when you finish the e-book. This way you can actually test some versions of your cover to see which one works best with your readers.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/create-the-best-cover-for-your-ebook.jpg\" alt=\"create-the-best-cover-for-your-ebook\" width=\"322\" height=\"302\" class=\"aligncenter size-full wp-image-3228\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/create-the-best-cover-for-your-ebook.jpg 322w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/create-the-best-cover-for-your-ebook-300x281.jpg 300w\" sizes=\"(max-width: 322px) 100vw, 322px\" \/><\/p>\n<p>For Social Media Marketing purposes you can hire someone to do a clever cover for you (you can use services like <a href=\"https:\/\/www.fiverr.com\/\">Fiverr<\/a> where you can find someone to design you a great cover for at little as $5!).<\/p>\n<p>Here is a list of things to have in mind when you decide on your e-book’s cover:<\/p>\n<ul>\n<li>you should try to avoid putting your picture on the cover (unless you already are a big celebrity , in which case this strategy might help you)<\/li>\n<li>the colors, styles and images must resonate with your target audience (remember when I told you to learn everything about your audience?)<\/li>\n<li>build a simple website for your e-book, where you can publish and A\/B test your cover. See which graphics and colors are compatible with your audience. This way, by the time you finish the e-book, you will have the perfect cover!<\/li>\n<\/ul>\n<h2>Build a simple website for your e-book<\/h2>\n<p>This can help you in many ways, but first of all it will be your gateway to your readers. You can showcase your e-book, add descriptions and intriguing stories about your e-book, your characters and about yourself. You can add a simple form where your readers can subscribe to your emailing list. This is quite important as you can notify them all when you actually launch the e-book.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/build-a-website-for-your-ebook.jpg\" alt=\"build-a-website-for-your-ebook\" width=\"345\" height=\"239\" class=\"aligncenter size-full wp-image-3229\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/build-a-website-for-your-ebook.jpg 345w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/build-a-website-for-your-ebook-300x208.jpg 300w\" sizes=\"(max-width: 345px) 100vw, 345px\" \/><\/p>\n<p>You can create urgency and desire with clever messages, discounts and count-downs.<\/p>\n<p>You can use the created website to A\/B test your cover and title ideas.<\/p>\n<p>And these are just a few of the benefits of having a website for your e-book before you actually write it! Plus you&#8217;ll have an easier time if you&#8217;re planning to market your e-book on social media.<\/p>\n<p>Here are a few of the most important elements that your website should include:<\/p>\n<ul>\n<li>A detailed description of your e-book that will entice the readers to want more.<\/li>\n<li>A brief description about yourself, a photo, who you are and why you wrote the e-book.<\/li>\n<li>The cover.<\/li>\n<li>Testimonials from your previous work, if you have them.<\/li>\n<li>Subscribe form to register your readers to your emailing list and send them announcements or discounts for your e-book.<\/li>\n<li>Sharing buttons for the popular social networks (the ones that your audience uses).<\/li>\n<\/ul>\n<h2>Create a Video about your e-book<\/h2>\n<p>Tell your story, how you came up with the idea, why you are writing the e-book. This will work like a movie trailer for it. You don’t necessary need a professional help (although you could hire someone to make you a great movie), you could do this with the help of a good camera, a good friend and YouTube. Add the movie on your website as well!<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/create-a-video-for-your-e-book.jpg\" alt=\"create-a-video-for-your-e-book\" width=\"300\" height=\"184\" class=\"aligncenter size-full wp-image-3231\" \/><\/p>\n<h2>Create a Facebook page <\/h2>\n<p>You probably already have a Facebook account, it’s time to create a Facebook fan page for your e-book. Here you will share announcements, promotions and you will market your e-book. Use this page to communicate with your readers.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/create-a-facebook-page-for-your-e-book.jpg\" alt=\"create-a-facebook-page-for-your-e-book\" width=\"426\" height=\"299\" class=\"aligncenter size-full wp-image-3232\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/create-a-facebook-page-for-your-e-book.jpg 426w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/create-a-facebook-page-for-your-e-book-300x211.jpg 300w\" sizes=\"(max-width: 426px) 100vw, 426px\" \/><\/p>\n<p>You will probably not have followers from the start (unless you have previous work and you invite your readers to like your new page too). These are some tricks to get your Page discovered on Facebook:<\/p>\n<ul>\n<li>Find groups on Facebook where readers gather to share ideas and impressions about the e-books they’ve read. Groups where people share newly published e-books. Or groups where people share what they read. You get the idea!<\/li>\n<li>Post on the groups you find: you can share you video or a sample chapter or you can just tell them about the e-book along with a link to your site (so they can subscribe). People that match your target audience will like your page to find out more about the e-book.<\/li>\n<li>Try posting other content on your Facebook page as well. If you find something interesting that could help your audience in some way, share it on your page. It doesn&#8217;t need to be 100% about your e-book. This way you can market your e-book indirectly.<\/li>\n<li>Use an automation software to post on your Facebook page. If you want to have a good social impact and grow your marketing reach, you need to start posting consistently on your page. We know that you are busy writing your great e-book, that’s why our recommendation is to automate your social media with tools like <a href=\"https:\/\/jarvee.com\">JARVEE<\/a>. This way your users will not forget about you.<\/li>\n<li>Reach out to influencers in your filed and tell them about your e-book. A single mention by one of these social influencers can really boost your traffic!<\/li>\n<\/ul>\n<p>While writing your e-book, all you need to do is to engage with your followers every once in a while on your Facebook Page. Don’t worry, you don’t have to post 24\/7 and you don’t have to start creating new content just for social media! You can curate and share the best articles, tutorials or any other materials that you find and you consider to be useful for your followers. This way you will keep the conversation going, your followers engaged and grateful for the premium content you offer.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/engage-your-followers.jpg\" alt=\"engage-your-followers\" width=\"434\" height=\"245\" class=\"aligncenter size-full wp-image-3233\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/engage-your-followers.jpg 434w, https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/engage-your-followers-300x169.jpg 300w\" sizes=\"(max-width: 434px) 100vw, 434px\" \/><\/p>\n<p>The best way to have a continuous activity on social media is to use an automation software to schedule your posts in advance. With the help of a really great automation software you can focus more on other marketing strategies and still have a strong social media presence.<\/p>\n<p>Here is a bonus list of 10 social marketing tips that will help you market your e-book before and after you launch it:<\/p>\n<ol>\n<li>Create social conversations. Don’t forget about the “social” part and make a one-way broadcast. Listen to your followers and respond to their comments.<\/li>\n<li>Use social media to reach influencers and get reviews for your e-book. You will notice the rock stars of Twitter don’t necessarily have a blog of their own, but they have a huge following. Imagine what a simple tweet recommending your e-book to their followers could mean! Reach bloggers and reviewers in your e-book’s genre, send them your manuscript and ask them to review it.<\/li>\n<li>Prepare your followers with a release date for your e-book. Promote it as good as you can when it launches, but after the first four weeks our recommendation is to back off with the promotion. You need to start connecting with your readers and stop selling. It’s all about building a community, and if you want your communications to successfully engage, they need to be more about your followers and less about you.<\/li>\n<li>Before launching your e-book, create teasers for it: offer your followers a free chapter or even better &#8211; make a video to tell the story behind it. Like a movie trailer! This will keep your followers in suspense and eager to read it when it&#8217;s out.<\/li>\n<li>Build a great social profile. Make it personal and authentic. People love to see the person behind their favorite e-book! Have a nice and high-quality picture of you along with a short description where you tell your story.<\/li>\n<li>Use Pinterest to market your e-book as well! Even though Pinterest is a visual place, there are many creative ways to promote it there. You may have quotes from the e-book that you can publish on Pinterest, you can pin images that are related to the location of your story or you can create a Board where you can pin similar e-books.<\/li>\n<li>Use Pinterest to begin networking with people who are interested in similar genres to your e-book. For example, if you&#8217;re writing about cooking or recipes, you could start following pinners with Boards about food and recipes and you can re-pin their pins if you like them. The more you interact with other users, the more chances are that they will notice and follow you back.<\/li>\n<li>You don&#8217;t have to post on social media 24\/7! It is more important to be consistent with your posting than to post all day long. You audience prefers using social media at specific hours. Find out when you should post depending on your audience, and focus on sharing quality content instead of posting too may times a day. <a href=\"http:\/\/www.quicksprout.com\/2015\/01\/02\/what-are-the-best-times-to-post-on-social-media\/\">See this infographic<\/a> to get an idea on what are the best times to post on each social media platform<\/li>\n<li>You don’t have to use all the social platforms at the same time! This is really time consuming and often, writers are scared of the overwhelming work they think they have to put in, so they end up ignoring  the social media part completely. Choose one or two of the platforms that works best for you and your audience and stick with them. Schedule your posts in advance and follow up with the comments and questions.<\/li>\n<li>Don’t neglect your social profiles. You need to post regularly on Facebook, Twitter, Linkedin and any other social network that you find useful to connect with your readers, but also, update your profile: your cover photo, or your picture, to show your readers that you are active and happy to be using social media to connect with them.<\/li>\n<\/ol>\n<h2>Final words on how to market your e-book<\/h2>\n<p>As you can see social media is the perfect way to promote your e-book so start doing it as soon as possible. A few actions will have to be done manually, however most of your social media activity can be automated so you don&#8217;t have to spend hours and hours each day on this task. After all, you&#8217;re a writer so your time is better spent writing.<\/p>\n<p><a href=\"https:\/\/jarvee.com\/get-now\/\">Try Jarvee for free for 5 days<\/a> and you&#8217;ll see how easy social media marketing can be when it&#8217;s all automated!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>All the experts in the field recommend that you should start to market your e-book even before you even start writing it. You probably heard this advice before, but you’re not sure how to apply it. Don&#8217;t worry though we got you covered, we’ll describe the exact steps you need to take in detail below. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3221,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[23],"tags":[44,43,45],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Use Social Media To Market Your E-Book &amp; Succeed<\/title>\n<meta name=\"description\" content=\"Learn how to use social media to Market Your e-Book or book. After all the effort you put in writing it, it would be a shame to fall short at the last step\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Use Social Media To Market Your E-Book &amp; Succeed\" \/>\n<meta property=\"og:description\" content=\"Learn how to use social media to Market Your e-Book or book. After all the effort you put in writing it, it would be a shame to fall short at the last step\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2018-04-11T13:38:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/marketing-you-ebook.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"300\" \/>\n\t<meta property=\"og:image:height\" content=\"275\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/marketing-you-ebook.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/marketing-you-ebook.jpg\",\"width\":300,\"height\":275,\"caption\":\"marketing your ebook\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#webpage\",\"url\":\"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/\",\"name\":\"How To Use Social Media To Market Your E-Book & Succeed\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#primaryimage\"},\"datePublished\":\"2018-04-11T13:38:48+00:00\",\"dateModified\":\"2018-04-11T13:38:48+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\"},\"description\":\"Learn how to use social media to Market Your e-Book or book. After all the effort you put in writing it, it would be a shame to fall short at the last step\",\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Full Guide on How To Use Social Media To Market Your E-Book\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0\",\"name\":\"Adam\",\"url\":\"https:\/\/jarvee.com\/author\/jarvee\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How To Use Social Media To Market Your E-Book & Succeed","description":"Learn how to use social media to Market Your e-Book or book. After all the effort you put in writing it, it would be a shame to fall short at the last step","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/","og_locale":"en_US","og_type":"article","og_title":"How To Use Social Media To Market Your E-Book & Succeed","og_description":"Learn how to use social media to Market Your e-Book or book. After all the effort you put in writing it, it would be a shame to fall short at the last step","og_url":"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/","og_site_name":"Jarvee","article_published_time":"2018-04-11T13:38:48+00:00","og_image":[{"width":300,"height":275,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/marketing-you-ebook.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Adam","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/marketing-you-ebook.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2018\/04\/marketing-you-ebook.jpg","width":300,"height":275,"caption":"marketing your ebook"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#webpage","url":"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/","name":"How To Use Social Media To Market Your E-Book & Succeed","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#primaryimage"},"datePublished":"2018-04-11T13:38:48+00:00","dateModified":"2018-04-11T13:38:48+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0"},"description":"Learn how to use social media to Market Your e-Book or book. After all the effort you put in writing it, it would be a shame to fall short at the last step","breadcrumb":{"@id":"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/guide-how-to-use-social-media-market-your-e-book\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Full Guide on How To Use Social Media To Market Your E-Book"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/005f95ee39c75bd29f1e93a431cce1a0","name":"Adam","url":"https:\/\/jarvee.com\/author\/jarvee\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3220"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=3220"}],"version-history":[{"count":9,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3220\/revisions"}],"predecessor-version":[{"id":3239,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/3220\/revisions\/3239"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/3221"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=3220"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=3220"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=3220"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}