{"id":5322,"date":"2019-11-23T11:15:43","date_gmt":"2019-11-23T11:15:43","guid":{"rendered":"https:\/\/jarvee.com\/?p=5322"},"modified":"2019-11-23T11:15:43","modified_gmt":"2019-11-23T11:15:43","slug":"6-secrets-to-creating-successful-social-media-content","status":"publish","type":"post","link":"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/","title":{"rendered":"6 Secrets To Creating Successful Social Media Content"},"content":{"rendered":"<p>It&#8217;s so cool when it&#8217;s viralized content, isn&#8217;t it? Making successful content on social networks fills anyone with pride. Seeing your post, your video, or your blog link propagating on social networks makes more people aware of your brand.<\/p>\n<p>Often, an audience you never even thought would be interested in your business will become your fan because of it, because of a successful post.<\/p>\n<p>With greater engagement in your post, the chances of attracting this new follower and turning them into a customer for your business are great. Even more so if you use the right techniques for this.<\/p>\n<p>But making successful content on social networks requires time for planning, trial and error, and learning.<\/p>\n<div style=\"width: 778px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" src=\"https:\/\/i.imgur.com\/hHYaINN.png\" width=\"768\" height=\"4093\" alt=\"6 Secrets To Creating Successful Social Media Content\" class=\"size-full\" \/><p class=\"wp-caption-text\">6 Secrets To Creating Successful Social Media Content<\/p><\/div>\n<p>So to help you in this saga, we&#8217;ve listed a few techniques, little secrets, that can help you produce engaging social networking content.<\/p>\n<h3>1. KNOW WHO YOU ARE TALKING TO<\/h3>\n<p>The first secret we want to tell you, before you think of any content, is that you need to know your ideal customer profile. Only then will you know what is relevant to your audience. It doesn&#8217;t suit you to have a law firm and want to make a video about puppies, right?<\/p>\n<p>You have to understand your audience well, what they like and what their fans and customers are feeling. After this in-depth study, you will be more assertive in content topics.<\/p>\n<p><strong>Tip :<\/strong> Regardless of the topic that is relevant to your niche, using videos is a great insight. This is a type of successful social media content and has a much wider reach than posting a link or photo.<\/p>\n<p>Think Like Facebook: Which is Better? Do I deliver content that people consume the longest within my platform or throw that user off my network? It is more advantageous for Facebook that users stay on Facebook for longer.<\/p>\n<p>This is one reason why video consumption is so big. It is attractive content, usually short and has good results.<\/p>\n<h3>2. CONQUER PEOPLE BY EMOTION<\/h3>\n<p>Knowing what is important to your audience, start analyzing what content within your segment you can make them touch people&#8217;s emotions.<\/p>\n<p>This is yet another item totally tied to your persona. If you have a real estate, for example, you can tap into the thrill of owning your first home, the happiness of that achievement.<\/p>\n<p>That&#8217;s why it&#8217;s important to analyze what makes sense to your followers. Making sense, they also share your content.<\/p>\n<h3>3. MAKE CONTENT THAT HELPS PEOPLE<\/h3>\n<p>Successful content on social networks has to be a &#8220;social currency&#8221;. People need to see value in the post regardless of the format (be it a video, a link, a photo, etc.). If something brings value to people, they will share this post.<\/p>\n<p>These contents are usually intertwined with the previous item of emotion. But when we talk about emotion, you don&#8217;t necessarily have to think about doing something for someone to cry, see ?! It could be to smile, to wonder, to think, &#8220;Wow, I didn&#8217;t know that,&#8221; okay?<\/p>\n<p>This is how you help people by bringing something new, a series of tips, a tutorial on some complex process, and many other value-adding content.<\/p>\n<h3>4. FOCUS ON CONTENT DELIVERY<\/h3>\n<p>So far so good. You have been able to apply all these little secrets to the production of successful social media .There is nothing worse than promising something and not delivering! If you are willing to produce content, dedicate yourself.<\/p>\n<p>Do not promise anything in the title and in the content, do not deliver. This “burns your movie” and causes you to lose a new user. Think the internet is full of average content. Your goal is to always be above average.<\/p>\n<h3>5. CALL TO ACTION IN POSTS<\/h3>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/call-to-action.jpg\" alt=\"call to action\" width=\"772\" height=\"638\" class=\"aligncenter size-full wp-image-5330\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/call-to-action.jpg 772w, https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/call-to-action-300x248.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/call-to-action-768x635.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/call-to-action-600x496.jpg 600w\" sizes=\"(max-width: 772px) 100vw, 772px\" \/><\/p>\n<p>Call to action, known as <a href=\"https:\/\/en.wikipedia.org\/wiki\/Call_to_action_(marketing)\">Call to Action<\/a>, is a feature that helps you create successful social media content. Produce text and, at the end, ask your fan to leave a comment, share the post, like the post etc. It works as a push.<\/p>\n<p>People need these guidelines. Use calls to action subtly and according to what you need for that content. For sure, the return will be positive.<\/p>\n<h3>6. CAPRICHE IN THE PICTURES<\/h3>\n<p>You have engaged in all the previous items so far. But at the time of posting, don&#8217;t fancy the images. All this work goes down the drain! That old saying that &#8220;a picture is worth a thousand words&#8221; is real.<\/p>\n<p>It&#8217;s a waste of time not taking care of this detail. Images help sell your content. So making beautiful, compelling images is paramount for successful social media content.<\/p>\n<p>Both the internal images of a blog post or website and the prominent images are important, ok? To help you out, we have created a list of tools for creating images for Facebook . Check out each one and start producing quality images.<\/p>\n<h2>HOW TO MAKE A GOOD TEXT<\/h2>\n<p>Now that we&#8217;ve shown you the secrets to creating successful social media content, another key item to stand out on the Internet is to have well-written text.<\/p>\n<p>The way we write in the virtual world will help dictate this success. That&#8217;s why we&#8217;ve listed the best techniques for you to apply before, during and after your text production, check out:<\/p>\n<h3>1. RESEARCH LONG BEFORE YOU START WRITING<\/h3>\n<p>Search, search, search! Knowing your persona well, you already know what she is interested in. Search for such content on various websites on the internet. Don&#8217;t get tired of searching, this is what makes the difference in your content. The more complete a text, the more value you will generate for your fans.<\/p>\n<p>If you are already authority on the subject, perfect! If it is not already, contact professionals to have them interview you.<\/p>\n<p>There is a really cool site called <a href=\"https:\/\/www.helpareporter.com\/\">Help a Reporter<\/a> . You leave your interview request and several advisors get in touch. This can be a cool way for you to bring valuable content backed by other professionals.<\/p>\n<h3>2. ANALYZE RELEVANT KEYWORDS<\/h3>\n<p>Often one word makes all the difference. Both in how your audience will receive the message and how Google can position your text because of the relevance of the term.<\/p>\n<p>Use tools like <a href=\"https:\/\/www.semrush.com\/\">SEMrush<\/a> , Google Trends, and MOZ &#8211; Keyword Explorer to search for these terms. No doubt you will learn which expressions are most relevant and stand out on the internet.<\/p>\n<h3>3. PLAN THE CONTENT TITLE WELL<\/h3>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/PLAN-THE-CONTENT-TITLE-WELL.jpg\" alt=\"PLAN THE CONTENT TITLE WELL\" width=\"770\" height=\"472\" class=\"aligncenter size-full wp-image-5332\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/PLAN-THE-CONTENT-TITLE-WELL.jpg 770w, https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/PLAN-THE-CONTENT-TITLE-WELL-300x184.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/PLAN-THE-CONTENT-TITLE-WELL-768x471.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/PLAN-THE-CONTENT-TITLE-WELL-600x368.jpg 600w\" sizes=\"(max-width: 770px) 100vw, 770px\" \/><\/p>\n<p>Your title must be killer! He needs to be short, have the main keywords and get the idea of ​​what the text is about. Don&#8217;t give up all the gold in the title, but don&#8217;t make too generic one either.<\/p>\n<p>In our text about SEO errors that hinder your positioning on Google , you will find more tips for putting together an interesting headline.<\/p>\n<h3>4. BEFORE YOU START WRITING, ASSEMBLE A SKELETON OF YOUR TEXT<\/h3>\n<p>Never ever start writing a text like there is no tomorrow. You need to plan and execute everything accurately.<\/p>\n<p>Assemble a structure, like a skeleton, with the topics you want to cover.<\/p>\n<p>After the first structuring, read this template and see which themes match. This way you identify if subjects that can be used as “hooks” appear out of order &#8211; and you can rearrange them.<\/p>\n<p>Spend time on this structure that, when it&#8217;s time to really start writing, you&#8217;ll notice that production will flow even faster.<\/p>\n<h3>5.  CONQUER YOUR READER ALREADY IN THE FIRST PARAGRAPH<\/h3>\n<p>The cat&#8217;s leap is to catch your reader&#8217;s attention in the first few sentences. Your introduction needs to be flashy and informative, but without delivering all the gold of the text.<\/p>\n<p>You can start a production by asking a question, citing a situation the reader is experiencing, and, with your text, solve this problem.<\/p>\n<h3>6. CUT SHORT SENTENCES AND LEAN PARAGRAPHS<\/h3>\n<p>Very long sentences, even if they have a good punctuation, are tiring. The ideal is to produce a text with short sentences, so that the reader can absorb well what they are reading.<\/p>\n<p>Linked to this, writing short paragraphs is also extremely important. Think about having paragraphs of 3 to 4 lines in the air. We emphasize that it is “in the air” because if you write in a text editor like Word, for example, a paragraph with 4 lines in it may have 6 on your site or blog.<\/p>\n<p>Short paragraphs are more attractive to the reader. If someone comes across a “text block” unconsciously, that person already creates resistance to your text &#8211; and they won&#8217;t want to read it!<\/p>\n<p>Another device used to get readers&#8217; attention is to use bullets, the ball markers. It&#8217;s automatic: When a person sees a list of balls, it gets their attention. Want to know why?<\/p>\n<ul>\n<li>The text gets more organized;<\/li>\n<li>You can pass information in a lean way;<\/li>\n<li>Bullets break reading;<\/li>\n<li>It is as if you deliver chewed content;<\/li>\n<li>You have read all of the above I know!<\/li>\n<li>This is the purpose of using markers whenever possible.<\/li>\n<\/ul>\n<h3>7. TEXT READING SHOULD FLOW<\/h3>\n<p>Of course you must focus on the keywords and <a href=\"https:\/\/www.singlegrain.com\/seo\/effective-seo-techniques-that-work\/\">SEO techniques<\/a> to write a text. But don&#8217;t let the boring and repetitive text. One tip we can give you is: read the text aloud.<\/p>\n<p>This is a very good technique for you to spot strange phrases, bits of text that have been truncated or meaningless. If during reading aloud you fluster yourself, some adjustment will be necessary.<\/p>\n<h3>8. CLOSE YOUR TEXT WITH CALLS TO ACTION.<\/h3>\n<p>As we commented earlier, calls to action are important for you to point out to the reader. It is a request to perform some action. Finish your texts this way whenever possible!<\/p>\n<h3>9. DID YOU FINISH THE TEXT? WAIT AT LEAST 30 MINUTES AND THEN REVIEW IT<\/h3>\n<p>Every text needs to be lovingly revised and this is the most important proofing tip we can give you. When you write a text and then try to revise it, it is only natural that you “read what you think you wrote”. The original text is still so fresh in your mind that you do not notice any mistakes you have made. You will read the text thinking that the missing word appears there. Because: in your head you were supposed to write that but you didn&#8217;t.<\/p>\n<p>So the golden tip is: disconnect from the text before proofreading. Finish your production, save the text and close the file. Take a break from Facebook, grab a bite, play with your dog, and then come back for a review &#8211; before you post! You will detach from the content and possible typos and concordance will jump in your eyes.<\/p>\n<p>So, were these tips helpful to you? Comment here on the blog (look at my call to action in practice) if you already knew some of these secrets and especially if you have any more letters up your sleeve to share with us.<\/p>\n<p><strong>About the author<\/strong><\/p>\n<p>I am Hayley from <a href=\"https:\/\/cheetahpapers.com\/\" rel=\"dofollow\">Cheetahpapers<\/a> and I am working under the team content writer. Our goal is to hire an expert who has a good command of English and will be able to meet the expectations of our clients. We also check if the candidates are familiar with the variety of citation styles. Then, they write a sample paper to demonstrate their analytical skills and creativity. We evaluate every single point of the writers&#8217; abilities to choose only talented and reliable candidates.<\/p>\n<p>You can also find us on LinkedIn at: <a href=\"https:\/\/www.linkedin.com\/in\/cheetah-papers-022758195\/\">https:\/\/www.linkedin.com\/in\/cheetah-papers-022758195\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>It&#8217;s so cool when it&#8217;s viralized content, isn&#8217;t it? Making successful content on social networks fills anyone with pride. Seeing your post, your video, or your blog link propagating on social networks makes more people aware of your brand. Often, an audience you never even thought would be interested in your business will become your [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":5335,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[64,23],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>6 Secrets To Creating Successful Social Media Content - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"6 Secrets To Creating Successful Social Media Content - Jarvee\" \/>\n<meta property=\"og:description\" content=\"It&#8217;s so cool when it&#8217;s viralized content, isn&#8217;t it? Making successful content on social networks fills anyone with pride. Seeing your post, your video, or your blog link propagating on social networks makes more people aware of your brand. Often, an audience you never even thought would be interested in your business will become your [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2019-11-23T11:15:43+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/6-Secrets-To-Creating-Successful-Social-Media-Content.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"723\" \/>\n\t<meta property=\"og:image:height\" content=\"476\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Contributing Guest\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/6-Secrets-To-Creating-Successful-Social-Media-Content.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/6-Secrets-To-Creating-Successful-Social-Media-Content.jpg\",\"width\":723,\"height\":476,\"caption\":\"6 Secrets To Creating Successful Social Media Content\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#webpage\",\"url\":\"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/\",\"name\":\"6 Secrets To Creating Successful Social Media Content - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#primaryimage\"},\"datePublished\":\"2019-11-23T11:15:43+00:00\",\"dateModified\":\"2019-11-23T11:15:43+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"6 Secrets To Creating Successful Social Media Content\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\",\"name\":\"Contributing Guest\",\"description\":\"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \\\"guest posting\\\" guidelines link.\",\"sameAs\":[\"https:\/\/jarvee.com\"],\"url\":\"https:\/\/jarvee.com\/author\/contributor\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"6 Secrets To Creating Successful Social Media Content - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/","og_locale":"en_US","og_type":"article","og_title":"6 Secrets To Creating Successful Social Media Content - Jarvee","og_description":"It&#8217;s so cool when it&#8217;s viralized content, isn&#8217;t it? Making successful content on social networks fills anyone with pride. Seeing your post, your video, or your blog link propagating on social networks makes more people aware of your brand. Often, an audience you never even thought would be interested in your business will become your [&hellip;]","og_url":"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/","og_site_name":"Jarvee","article_published_time":"2019-11-23T11:15:43+00:00","og_image":[{"width":723,"height":476,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/6-Secrets-To-Creating-Successful-Social-Media-Content.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Contributing Guest","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/6-Secrets-To-Creating-Successful-Social-Media-Content.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2019\/11\/6-Secrets-To-Creating-Successful-Social-Media-Content.jpg","width":723,"height":476,"caption":"6 Secrets To Creating Successful Social Media Content"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#webpage","url":"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/","name":"6 Secrets To Creating Successful Social Media Content - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#primaryimage"},"datePublished":"2019-11-23T11:15:43+00:00","dateModified":"2019-11-23T11:15:43+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/6-secrets-to-creating-successful-social-media-content\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"6 Secrets To Creating Successful Social Media Content"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07","name":"Contributing Guest","description":"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \"guest posting\" guidelines link.","sameAs":["https:\/\/jarvee.com"],"url":"https:\/\/jarvee.com\/author\/contributor\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/5322"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=5322"}],"version-history":[{"count":10,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/5322\/revisions"}],"predecessor-version":[{"id":5336,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/5322\/revisions\/5336"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/5335"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=5322"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=5322"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=5322"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}