{"id":5885,"date":"2020-03-18T11:42:02","date_gmt":"2020-03-18T11:42:02","guid":{"rendered":"https:\/\/jarvee.com\/?p=5885"},"modified":"2020-03-18T11:42:02","modified_gmt":"2020-03-18T11:42:02","slug":"how-to-curate-an-evergreen-share-list-for-social-media","status":"publish","type":"post","link":"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/","title":{"rendered":"How to Curate an Evergreen Share List for Social Media"},"content":{"rendered":"<p>&#8220;Evergreen content&#8221; is a term you&#8217;ve probably heard countless times in reference to your blog or website. It refers to <a href=\"https:\/\/digitalmarketinginstitute.com\/en-gb\/blog\/2017-10-04-the-beginners-guide-to-evergreen-content\">the content you share online<\/a> that&#8217;s sustainable and consistently valuable. It&#8217;s not reliant on any seasonal demands or short-term trends. Evergreen content always has the right impact.<\/p>\n<p>As part of a comprehensive content marketing strategy, Evergreen content makes a lot of sense. It gives your website &#8220;thought leadership&#8221; points by demonstrating that you know your way around some crucial industry topics. Evergreen content can also continue to attract visitors using common keywords and phrases all-year-round.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media.jpg\" alt=\"How to Curate an Evergreen Share List for Social Media\" width=\"873\" height=\"582\" class=\"aligncenter size-full wp-image-5891\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media.jpg 873w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media-300x200.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media-768x512.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media-600x400.jpg 600w\" sizes=\"(max-width: 873px) 100vw, 873px\" \/><\/p>\n<p>Heck, it even gives you <a href=\"https:\/\/jarvee.com\/6-email-marketing-best-practices-to-try-for-your-next-campaign\/\">something to link your customers to<\/a> when you&#8217;re padding out your email marketing campaigns.<\/p>\n<p>But what if you want to take your evergreen strategy to the next level?<\/p>\n<p>What happens when you take the concepts of constantly valuable and shareable content into the world of social media?<\/p>\n<h2>What is an Evergreen Social Share List?<\/h2>\n<p>As an essential part of <a href=\"https:\/\/jarvee.com\/how-social-media-is-impacting-your-seo\/\">your brand reach strategy<\/a>, your social media campaign needs to be filled with content that you can use to delight and engage your audience.<\/p>\n<p>Unfortunately, finding content to share every day on your social channels can be an exhausting task.<\/p>\n<p>Once you&#8217;ve finished commenting on the news of the day in your industry or letting people know about your latest blog post, how do you fill up your feed with extra value?<\/p>\n<p>That&#8217;s where an evergreen social share list comes in handy.<\/p>\n<p>Just like the evergreen content on your blog, an evergreen share list for social media is packed full of material that remains consistently relevant to your followers. This content doesn&#8217;t lose impact or go out of style, which means that you can use it as part of an automated social media campaign to keep your channels alive and interesting.<\/p>\n<p>Evergreen social content:<\/p>\n<ul>\n<li>Reminds your followers of the topics that you know the most about, enhancing your thought leadership status.<\/li>\n<li>Highlights your position in the industry with engaging and interesting information.<\/li>\n<li>Makes sure you can stick to a consistent posting schedule, and therefore not lose the attention of your audience.<\/li>\n<\/ul>\n<p>Here&#8217;s how you can curate a compelling evergreen share list for your social media plan.<\/p>\n<h2>1.    Pull Evergreen Content From Your Blog<\/h2>\n<p>A <a href=\"https:\/\/jarvee.com\/how-to-plan-your-social-media-strategy-in-2019-6-efficient-tips\/\">good social media strategy<\/a> isn&#8217;t just about promoting the latest content from your website or your newest products on the right channels. Your social platforms are your opportunity to connect with your target audience and show them what your brand is all about. What better way to do that than to draw attention to some of the evergreen content that your readers love?<\/p>\n<p>Use your Google analytics data to find your top-performing posts on your website. Filter for organic traffic and find out which questions your customers most want to answer when they come to your site. For instance, if you&#8217;re a professional video editing brand, then people might want to know why they should be <a href=\"https:\/\/jarvee.com\/reveal-why-you-should-use-video-content-in-your-smm-strategy\/\">using video<\/a> in their social media campaigns. A blog outlining all the benefits could make for a great piece of evergreen content to add to your share list.<\/p>\n<p>Punctuating posts about your new material with reminders of the older, valuable evergreen posts you already have on your website will encourage people to continue going back to your website and listening to what you have to say. Posts <a href=\"https:\/\/jarvee.com\/knowledge-base\/\">taken directly from your website&#8217;s knowledgebase<\/a> are a particularly good shout here. After all, you know that content is going to continue being useful for years to come:<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/take-evergreen-content-from-your-knowledgebase.png\" alt=\"\" width=\"380\" height=\"290\" class=\"aligncenter size-full wp-image-5886\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/take-evergreen-content-from-your-knowledgebase.png 380w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/take-evergreen-content-from-your-knowledgebase-300x229.png 300w\" sizes=\"(max-width: 380px) 100vw, 380px\" \/><\/p>\n<h2>2.    Find and Share Evergreen Content from Other Sites<\/h2>\n<p>Drawing attention to your website and online presence is what great social media marketing is all about. However, it&#8217;s worth noting that your followers are looking to you to give them value every day, and they don&#8217;t necessarily mind if the content that they see comes directly from you.<\/p>\n<p>Look into some of the leading companies in your industry &#8211; the people that you&#8217;d like to collaborate with if you ever had a chance. They&#8217;re sure to have some useful content that you can share on your company&#8217;s social media channels too.<\/p>\n<p>Curating content from other websites to share as part of your social media strategy is a great way to fill out your schedule. It shows your audience that you&#8217;re committed to bringing them value in any form and that you don&#8217;t exist in a silo within your industry.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/Find-and-Share-Evergreen-Content-from-Other-Sites.jpg\" alt=\"Find and Share Evergreen Content from Other Sites\" width=\"452\" height=\"340\" class=\"aligncenter size-full wp-image-5887\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/Find-and-Share-Evergreen-Content-from-Other-Sites.jpg 452w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/Find-and-Share-Evergreen-Content-from-Other-Sites-300x226.jpg 300w\" sizes=\"(max-width: 452px) 100vw, 452px\" \/><\/p>\n<p>Additionally, the more you show respect to other companies in your <a href=\"https:\/\/jarvee.com\/how-create-social-media-marketing-plan-from-scratch\/\">social media marketing plan<\/a>, the more likely it is that those companies will consider working more closely with you in the future.<\/p>\n<p>Your decision to link customers on your Facebook page back to another website might cause the leader of that website to connect them to one of your blogs in the future. Alternatively, they could ask if you want to collaborate on a new project together or write a guest post for their site.<\/p>\n<h2>3.    Turn Snippets into Tweetable\/Grammable Quotes<\/h2>\n<p>Sharing a link back to your old blog posts and knowledgebase articles isn&#8217;t the only way to drive repeat customers to your website. You can also pull additional value from some of your existing evergreen content by pulling snippets or useful quotes out of your article and transforming them into handy snapshots of information.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/Turn-Snippets-into-Tweetable-Grammable-Quotes.jpg\" alt=\"Turn Snippets into Tweetable Grammable Quotes\" width=\"462\" height=\"191\" class=\"aligncenter size-full wp-image-5888\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/Turn-Snippets-into-Tweetable-Grammable-Quotes.jpg 462w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/Turn-Snippets-into-Tweetable-Grammable-Quotes-300x124.jpg 300w\" sizes=\"(max-width: 462px) 100vw, 462px\" \/><\/p>\n<p>Go through your favorite blog posts and look for something quotable. For instance:<\/p>\n<p>The phrase highlighted above provides a concise piece of insightful information that tells the audience something important, while also encouraging them to find out more. A quote like that makes for an excellent social share.<\/p>\n<p>You can either use the direct quote as a text update on Twitter, Facebook, or LinkedIn, or you can take things to the next level and spruce up your content calendar with some graphics. Create a pretty graphic <a href=\"https:\/\/www.canva.com\/\">using a tool like Canva<\/a>, and overlay the quote on the top.<\/p>\n<p>You can use a strategy like this to add quotable content to your Instagram marketing campaigns, and also stock your social media sharing schedule full of some engaging graphical content.<\/p>\n<p><a href=\"https:\/\/blog.hubspot.com\/marketing\/shareable-visual-content\">Images make content more shareable<\/a> on social media, so converting your quote into a graphic could also mean that you attract more eyes too.<\/p>\n<h2>4.    Cross Promote Social Media Accounts<\/h2>\n<p>The evergreen content for your social share strategy doesn&#8217;t always have to come from your blog or website. When companies set up automated social media marketing strategies, one of their primary goals is often to <a href=\"https:\/\/jarvee.com\/effective-steps-of-a-social-media-marketing-campaign\/\">drive traffic back to their websites<\/a>. However, you may also want to pull customers to your other social media channels too.<\/p>\n<p>There&#8217;s a good chance that you&#8217;re using a number of platforms to connect with your audience today. The more followers you have on each platform, the greater the benefits for your brand. An active social media presence can make companies appear more credible in the eyes of their target audience.<\/p>\n<p>When you&#8217;re looking for evergreen ways to fill out your social posting strategy, consider patching some of the gaps with cross-promotional links to your other accounts. For instance, your cross-promotional posts might look like:<\/p>\n<ul>\n<li>Want to put a #Pin in our ideas? Follow us on Pinteret…(link)<\/li>\n<li>Are we connected on LinkedIn? Find out more at (link)<\/li>\n<li>Need some visual inspiration? Find our brand on Instagram (link)<\/li>\n<li>We post on Twitter every day &#8211; why not follow us there? (link)<\/li>\n<\/ul>\n<p>These quick posts will always be relevant to your social media strategy, making them a great part of your evergreen posting ritual.<\/p>\n<h2>5.    Start Some Conversations<\/h2>\n<p>It&#8217;s surprisingly easy to forget about the &#8220;social&#8221; aspect of social media.<\/p>\n<p>When you&#8217;re spending all your time posting content that links back to your latest products and services, you get into the habit of thinking that social media is all about promotion. However, the truth is that the more you can engage with your audience, the more they&#8217;ll fall in love with your brand.<\/p>\n<p>What better way to power engagement than to start a conversation?<\/p>\n<p>A question about something important in your industry gets your audience talking about the things that matter most to them. For instance, the Jarvee blog posted an article in December 2018 asking customers: &#8220;<a href=\"https:\/\/jarvee.com\/what_tool_would_help_you_the_most\/\">What tool would help you the most<\/a>?&#8221;<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/what-tool-would-help-you-the-most.jpg\" alt=\"what tool would help you the most\" width=\"490\" height=\"191\" class=\"aligncenter size-full wp-image-5889\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/what-tool-would-help-you-the-most.jpg 490w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/what-tool-would-help-you-the-most-300x117.jpg 300w\" sizes=\"(max-width: 490px) 100vw, 490px\" \/><\/p>\n<p>A question like that added to your social media evergreen sharing strategy does a number of things. First, it shows your audience that you&#8217;re interested in their opinion and gives them an opportunity to get involved with the growth of your brand.<\/p>\n<p>Secondly, questions that are relevant to your industry also give you a behind-the-scenes look into your customers and what drives their purchasing decisions. In the example above, if a social media automation company knows what kind of tools its customers needs most, it can make sure that it&#8217;s offering the right selection of products going forward.<\/p>\n<h2>6.    Promote Your Popular Products\/ Services<\/h2>\n<p>Probably one of the most obvious ways to fill out your social share list with evergreen content is to use your posts to promote your products and services. The whole point of running a corporate social media strategy is to improve your chances of selling to more customers, after all.<\/p>\n<p>The important thing to remember when you&#8217;re adding promotions to your social sharing campaign, is that a lot of people hate <a href=\"http:\/\/www.convinceandconvert.com\/social-media-research\/new-research-americans-hate-social-media-promotions\/\">being constantly &#8220;sold at&#8221; online.<\/a> People mostly go to social media to connect with friends, be entertained, and learn new things. If your social channels are packed full of constant links to offers and your latest products, then you&#8217;re going to lose the respect of your followers.<\/p>\n<p>However, used correctly, promotional posts can help to break up your social schedule, and give you more content to share. To keep things on the right track, try sticking to the <a href=\"http:\/\/www.rallyverse.com\/blog\/index.php\/30-60-10-the-golden-ratio-for-social-media-marketing\/\">&#8220;Golden Ratio for Social Media Marketing.&#8221;<\/a><\/p>\n<p>The golden ratio indicates that 10% of your social schedule should be made up of promotional posts, while 60% is curated content, and 30% is owned content. That means that for every 1 link you share back to a product or service on your site, you share 3 links to evergreen blog content, infographics, and videos on your website. You also share 6 curated pieces from other websites, news articles, and trending content for every 1 promotional post.<\/p>\n<h2>7.    Share your Best Reviews<\/h2>\n<p>So if you can only use a handful of promotional posts in <a href=\"https:\/\/jarvee.com\/facebook-marketing-tips\/\">your social media schedule<\/a>, how do you make sure that you&#8217;re constantly reminding people of how excellent your products are?<\/p>\n<p>How about having your customers do the promotion for you?<\/p>\n<p>As you continue to evolve as a business, attracting reviews and testimonials from happy customers who have worked with you in the past, you&#8217;ll curate a lot of valuable user-generated content. This content comes directly from the customers that love your company, and it gives you an excellent way to show your audience just how credible and valuable you can be.<\/p>\n<p>Here are just some of the ways that you can boost your reputation with a little social proof in your evergreen social strategy:<\/p>\n<ul>\n<li>Share links to your case studies: Build in-depth case studies from experiences with crucial customers and publish them on your website. Then share links regularly to your case studies of a reminder of what you can accomplish.<\/li>\n<li>Share quotes from testimonials: Just as you plucked quotable lines from your blogs for your Twitter and Instagram shares above, you can do the same thing with quotes from your customers. Quotes from happy customers show your followers just how amazing your product or service can be, and they don&#8217;t count as shameless self-promotion.<\/li>\n<li>Repost\/Retweet and Regram: When customers post pictures, videos, or information about them using your products or services on their social media accounts, ask for permission to save and re-use that content in the future.<\/li>\n<\/ul>\n<h2>8.    Offer Helpful Tricks and Tips<\/h2>\n<p>Finally, if you&#8217;re still looking for ways to fill your social sharing calendar with evergreen content, why not show your audience that they don&#8217;t have to go all the way to your website to get value? If you want to be a thought leader in your industry, then tips and useful advice about how to do important things will delight and engage your audience.<\/p>\n<p>Speak to your sales and marketing team about the questions that they see most often from your target audience. Alternatively, browse through the FAQ page on your website and pluck some questions from there. Then, when you&#8217;re filling your social media calendar for the month, put a few question and answer posts into your schedule that give your audience helpful tricks, tips, and bite-sized amounts of information.<\/p>\n<p>Updates like these can be as simple as you like. For instance, you might share &#8220;Tip #7: Always <a href=\"https:\/\/www.authorityhacker.com\/best-email-marketing-software\/\">segment your audience<\/a> with your email marketing campaigns.&#8221;<\/p>\n<p>To enhance the impact of the social share, include a link back to a blog page or video on your site where customers can learn more about a topic relevant to the quote. These quick-fire tips are excellent for reminding your followers of your value, and you can use the same revolving set of 100 or so tips on a constant basis.<\/p>\n<h2>Keep Your Social Feed Fresh with Evergreen Content<\/h2>\n<p>Too many companies think that if they want to be successful with their social media marketing, they need to constantly share new and trending content. However, the truth is that evergreen content can be just as valuable to your social media feed as it is to your blog or content marketing strategy.<\/p>\n<p>Lists of recyclable and evergreen content make it easy to build an automated social media marketing routine that keeps your digital presence active and engaging online. Making an investment in evergreen content now ensures that you can spend less time scrambling for something to share on your social feeds, and more time reaping the results of an incredible social campaign.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Evergreen content&#8221; is a term you&#8217;ve probably heard countless times in reference to your blog or website. It refers to the content you share online that&#8217;s sustainable and consistently valuable. It&#8217;s not reliant on any seasonal demands or short-term trends. Evergreen content always has the right impact. As part of a comprehensive content marketing strategy, [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":5891,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[64],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Curate an Evergreen Share List for Social Media - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Curate an Evergreen Share List for Social Media - Jarvee\" \/>\n<meta property=\"og:description\" content=\"&#8220;Evergreen content&#8221; is a term you&#8217;ve probably heard countless times in reference to your blog or website. It refers to the content you share online that&#8217;s sustainable and consistently valuable. It&#8217;s not reliant on any seasonal demands or short-term trends. Evergreen content always has the right impact. As part of a comprehensive content marketing strategy, [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2020-03-18T11:42:02+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"873\" \/>\n\t<meta property=\"og:image:height\" content=\"582\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Contributing Guest\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media.jpg\",\"width\":873,\"height\":582,\"caption\":\"How to Curate an Evergreen Share List for Social Media\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#webpage\",\"url\":\"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/\",\"name\":\"How to Curate an Evergreen Share List for Social Media - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#primaryimage\"},\"datePublished\":\"2020-03-18T11:42:02+00:00\",\"dateModified\":\"2020-03-18T11:42:02+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to Curate an Evergreen Share List for Social Media\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\",\"name\":\"Contributing Guest\",\"description\":\"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \\\"guest posting\\\" guidelines link.\",\"sameAs\":[\"https:\/\/jarvee.com\"],\"url\":\"https:\/\/jarvee.com\/author\/contributor\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Curate an Evergreen Share List for Social Media - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/","og_locale":"en_US","og_type":"article","og_title":"How to Curate an Evergreen Share List for Social Media - Jarvee","og_description":"&#8220;Evergreen content&#8221; is a term you&#8217;ve probably heard countless times in reference to your blog or website. It refers to the content you share online that&#8217;s sustainable and consistently valuable. It&#8217;s not reliant on any seasonal demands or short-term trends. Evergreen content always has the right impact. As part of a comprehensive content marketing strategy, [&hellip;]","og_url":"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/","og_site_name":"Jarvee","article_published_time":"2020-03-18T11:42:02+00:00","og_image":[{"width":873,"height":582,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Contributing Guest","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/03\/How-to-Curate-an-Evergreen-Share-List-for-Social-Media.jpg","width":873,"height":582,"caption":"How to Curate an Evergreen Share List for Social Media"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#webpage","url":"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/","name":"How to Curate an Evergreen Share List for Social Media - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#primaryimage"},"datePublished":"2020-03-18T11:42:02+00:00","dateModified":"2020-03-18T11:42:02+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/how-to-curate-an-evergreen-share-list-for-social-media\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"How to Curate an Evergreen Share List for Social Media"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07","name":"Contributing Guest","description":"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \"guest posting\" guidelines link.","sameAs":["https:\/\/jarvee.com"],"url":"https:\/\/jarvee.com\/author\/contributor\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/5885"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=5885"}],"version-history":[{"count":3,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/5885\/revisions"}],"predecessor-version":[{"id":5893,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/5885\/revisions\/5893"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/5891"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=5885"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=5885"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=5885"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}