{"id":7444,"date":"2020-09-30T20:19:50","date_gmt":"2020-09-30T20:19:50","guid":{"rendered":"https:\/\/jarvee.com\/?p=7444"},"modified":"2020-09-30T20:19:50","modified_gmt":"2020-09-30T20:19:50","slug":"tiktok-launches-tiktok-for-business-platform-for-marketers","status":"publish","type":"post","link":"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/","title":{"rendered":"TikTok Launches “TikTok for Business” Platform for Marketers"},"content":{"rendered":"<p>TikTok is part of the top 10 social media channels when ranked by popularity. It has more than 800 million users and still climbing. The platform has mostly been used for entertainment purposes because businesses did not understand how to make this platform work for them.<\/p>\n<p>TikTok has cleared out the air and designed a custom-built platform for businesses. This platform can help businesses grow on this social channel by simplifying all the features a business needs to conduct marketing activities.<\/p>\n<p>What are some of the most useful features of this platform? And, how can you use it to the fullest potential to keep up with <a href=\"https:\/\/jarvee.com\/10-hot-social-media-trends-of-2020\/\">social media marketing trends<\/a>? Let’s find out.<\/p>\n<h2>Using the wide range of resources available<\/h2>\n<p>The greatest problem bothering businesses about TikTok is that they did not fully understand how to use this platform. Because of that, they rejected this channel and missed out on having a massive audience indulging in the visual content posted on this platform. To clear out all the confusion, TikTok has started providing actionable tips for businesses trying to use their services for professional purposes.<\/p>\n<p>These tips range from a variety of topics such as insights on best practices for <a href=\"https:\/\/jarvee.com\/how-to-edit-a-tiktok-video-in-2020\/\">editing TikTok videos<\/a> to help on using other features custom-built for their business platform. By using all the resources provided on their business platform, you will understand how to use TikTok more effectively for marketing purposes.<\/p>\n<p>You’ll also gain an inside scope of marketing using TikTok by reading about success stories and the elements that contribute to a great campaign using this channel.<\/p>\n<p>By publishing case studies on this platform, you can dissect the major success determining factors. Once you have done that, you’ll be in a better position to generate a strategy that works best for your business.<\/p>\n<p>Also, the fundamental information you will learn is invaluable and goes a long way into making successful TikTok campaigns. These resources are evergreen and can be a great foundation to lay a personalized marketing campaign on this channel that incites positive engagement.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers.jpg\" alt=\"TikTok Launches “TikTok for Business” Platform for Marketers\" width=\"627\" height=\"418\" class=\"aligncenter size-full wp-image-7445\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers.jpg 627w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers-300x200.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers-600x400.jpg 600w\" sizes=\"(max-width: 627px) 100vw, 627px\" \/><\/p>\n<h2>Gaining more visibility through TopView ads<\/h2>\n<p>As part of TikTok for Business, this social media channel has unrolled some pretty amazing ad campaign features. One of those features includes TikTok TopView ads, which play a huge role in brand visibility. You can get exponentially higher visibility on this social media channel by using TopView ads.<\/p>\n<p>This ad type ensures that each targeted user sees the ad you have prepared and that helps with brand awareness very much. Once you have created a compelling video designed for users seeing your content for the first time, initiate a TopView ad campaign. The video you have created will appear at the very top of the home page when users enter TikTok.<\/p>\n<p>This can be an incredible first point of contact with a fresh audience, so try to be convincing to get a positive following. The features of TopView ads include an immersive experience that entails both sound and video. There is no way users will miss this ad because it’s located right at the top of the landing page.<\/p>\n<p>There are no on-screen distractions, so you have an entire 60 seconds with the targeted audience. Another great feature about TopView ads is that they are full-screen video content giving you some undivided attention from the audience. No wonder, TopView ads has been labeled as the premium real estate on this social media channel.<\/p>\n<h2>What are brand takeovers?<\/h2>\n<p>TikTok <a href=\"https:\/\/slate.com\/technology\/2020\/08\/tiktok-ban-microsoft-trump-china-risk.html\">trumps most social media platforms<\/a> when it comes to giving you 100% user attention. Another way you can do this is by launching a brand takeover campaign. Although the first thing that may come to mind when you hear the word takeover is a violent act of taking over power, this kind is very different. The social media platform has made grabbing the user’s attention look so easy.<\/p>\n<p>Users can focus solely on your content without any disturbances or distractions in the background. By offering full-screen ad space, you are bound to get interested users that will start following the business’s page. By launching a brand takeover, you can get ultimate visibility, which might factor in as first touchpoint or a follow-up strategy to keep your business alive in their minds.<\/p>\n<p>Brand takeovers are not fancy at all but they get the job done. Something as simple as a well-designed JPG image can work best or a GIF. Some brands have opted for a really brief video that raises awareness or passes a short message across. The video can take from 3 seconds right up to 5.<\/p>\n<p>In this case, you really have to make the best out of the little time you’ve. Thus, try to create content without too many words because it might be gone before users can read through it. Keep it simple but do not lose the visual appeal.<\/p>\n<h2>Branded effects for businesses<\/h2>\n<p>Branded effects are probably the greatest feature businesses now have on TikTok because it helps business owners and marketers build a positive brand identity on this channel. By using branded effects, businesses can familiarize users familiarize themselves with the brand to a greater extent.<\/p>\n<p>Pulling in different aspects of the brand, such as the logo, color scheme, and other branding elements, users will memorize your business. That helps customers quickly recall or recognize the brand on other channels as well. If you sell in retail shops, potential customers will also recognize the products you’re selling instantly on the shelf.<\/p>\n<p>In the long run, it can build a great community that knows you well and recognizes you wherever you’re marketing or selling. On TikTok, branded effects also help with creating a community that is comfortable with sharing the content you have created. There are various ways you can use branded effects and some of them include creating and sharing custom-built stickers, filters, and other special effects.<\/p>\n<p>All of these branded effects can help increase popularity because they are sharable and users can use them on posts. These can pair well with user-generated content.<\/p>\n<p>You can unleash your creativity when creating branded effects for the business and improve user engagement levels. These elements have been simplified so you won’t spend much time trying to understand how everything works.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/Branded-effects-for-businesses.jpg\" alt=\"Branded effects for businesses\" width=\"627\" height=\"418\" class=\"aligncenter size-full wp-image-7446\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/Branded-effects-for-businesses.jpg 627w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/Branded-effects-for-businesses-300x200.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/Branded-effects-for-businesses-600x400.jpg 600w\" sizes=\"(max-width: 627px) 100vw, 627px\" \/><\/p>\n<h2>TikTok for business and in-feed videos<\/h2>\n<p>In-feed video ads are another great feature on TikTok for Business. These videos make users feel like the content has been made specifically for them. That is achieved by placing it under the “for you” section. Users might feel more prone to opening the in-feed videos recommended to them as opposed to searching for it.<\/p>\n<p>All of these have an impact on the brand’s identity and awareness. By using in-feed videos, you will have 60 seconds of uninterrupted time with users. These 60-second videos can have sound, making them more immersive and greatly appealing to users. In-feed videos can increase the number of eyeballs viewing the content you have created in a meaningful way.<\/p>\n<p>By personalizing it, the videos will be sent to people fitting a certain demographic profile or with particular behavioral patterns. That ensures that each video reaches the users it should, which improves engagement rates, which can be gauged by impressions. Those impressions include likes, comments, and shares.<\/p>\n<p>This is a great way to gauge how users are reacting to the content you have posted. Another great feature in-feed videos have is that users can use the music you have used on the content posted.<\/p>\n<p>This is another way to gauge impressions and can help you connect better with TikTok users. Also, these videos are auto-play, which can increase the number of viewers significantly.<\/p>\n<h2>How businesses can use hashtag challenges<\/h2>\n<p>Hashtags have become commonplace across most social media channels ever since they grew in popularity on Twitter. From there, they have permeated throughout various social media channels such as Instagram, Facebook, and now TikTok. Although TikTok has supported hashtags for quite a while now but this channel’s business feature unlocks great potential for businesses.<\/p>\n<p>Hashtag challenges can be used to create awareness about your brand while increasing user engagement to a great extent. A hashtag challenge prompts users to participate and that creates a great relationship between you and potential customers.<\/p>\n<p>You can even ask existing customers to join in the challenge. Hashtag challenges can appeal to the user’s passions and subsequently result in higher engagement rates.<\/p>\n<p>TikTok claims that its feature of <a href=\"https:\/\/www.emarketer.com\/content\/kroger-s-hashtag-challenge-a-retailer-s-perspective-on-tiktok\">branded hashtag challenges<\/a> can improve engagement rates by 8.5%. You can launch a branded hashtag challenge that lasts from 3 up to 6 days. The greatest part is that businesses will have guidance on every step of the way and they will come across a seamless user experience.<\/p>\n<p>A hashtag challenge can also be used to post user-generated content as it provides social proof to potential customers. That might tip the scales to your favor by influencing purchase decisions. The potential user-engagement levels you can achieve with branded hashtag challenges are incredible and they might even help improve conversion rates.<\/p>\n<h2>TikTok Creator Marketplace <\/h2>\n<p>As a brand manager, business owner or marketer, you might not fully understand the intricacies of TikTok. Because of that, you might create content that does not fulfill your purposes in any meaningful sense. Also, you might not fully understand the latest trends in TikTok marketing. To help with this. TikTok has created a very useful section on its business services page.<\/p>\n<p>This section is called the Creator Marketplace. It is where business owners, brand managers, and marketers can connect with creative individuals. These individuals are colloquially known as creators on this platform.<\/p>\n<p>You can get their input on campaigns or ask them to create content from scratch. This results in trendy and modernistic design elements on the campaigns you are implementing.<\/p>\n<p>These collaborations between brands and creators result in compelling content that fulfills its purpose. You do not have to outsource expensive content creating firms for your TikTok strategy because creators can be accessed directly with just a few clicks.<\/p>\n<p>This also helps TikTok users passionate about creating visual content to gain more working experience and earn some extra cash doing what they love. There is a lot of talent you can unleash from the TikTok creator marketplace at an affordable price.<\/p>\n<p>The great part is that these individuals get a better understanding of the needs of fellow TikTok users so there is no going wrong with them.<\/p>\n<h2>Final thoughts <\/h2>\n<p>TikTok marketing will never be the same again with these business features released. Brands can get more awareness and engagement from the users and that leads to higher conversion rates. By using all these features at your disposal, you can achieve the goals you have been gunning for effortlessly.<\/p>\n<p><strong>About the author <\/strong><\/p>\n<p>Tobias Foster works as an academic writer and editor for a <a href=\"https:\/\/www.rushessay.com\/\">custom essay writing service<\/a> listed as the best in the online assignment writing sphere by the <a href=\"https:\/\/www.bestessaytips.com\/review_essay.php\">essay writing service reviews<\/a>. He has always worked for the <a href=\"https:\/\/www.bestessayservicereviews.com\/\">best essay writing websites<\/a>, which has helped him pro-level experience in writing essays, thesis and dissertations and in the future, he wants to be known among the best in the writing industry.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>TikTok is part of the top 10 social media channels when ranked by popularity. It has more than 800 million users and still climbing. The platform has mostly been used for entertainment purposes because businesses did not understand how to make this platform work for them. TikTok has cleared out the air and designed a [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":7445,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[157],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>TikTok Launches “TikTok for Business” Platform for Marketers - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"TikTok Launches “TikTok for Business” Platform for Marketers - Jarvee\" \/>\n<meta property=\"og:description\" content=\"TikTok is part of the top 10 social media channels when ranked by popularity. It has more than 800 million users and still climbing. The platform has mostly been used for entertainment purposes because businesses did not understand how to make this platform work for them. TikTok has cleared out the air and designed a [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2020-09-30T20:19:50+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"627\" \/>\n\t<meta property=\"og:image:height\" content=\"418\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Contributing Guest\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers.jpg\",\"width\":627,\"height\":418,\"caption\":\"TikTok Launches \\u201cTikTok for Business\\u201d Platform for Marketers\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#webpage\",\"url\":\"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/\",\"name\":\"TikTok Launches \\u201cTikTok for Business\\u201d Platform for Marketers - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#primaryimage\"},\"datePublished\":\"2020-09-30T20:19:50+00:00\",\"dateModified\":\"2020-09-30T20:19:50+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"TikTok Launches \\u201cTikTok for Business\\u201d Platform for Marketers\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\",\"name\":\"Contributing Guest\",\"description\":\"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \\\"guest posting\\\" guidelines link.\",\"sameAs\":[\"https:\/\/jarvee.com\"],\"url\":\"https:\/\/jarvee.com\/author\/contributor\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"TikTok Launches “TikTok for Business” Platform for Marketers - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/","og_locale":"en_US","og_type":"article","og_title":"TikTok Launches “TikTok for Business” Platform for Marketers - Jarvee","og_description":"TikTok is part of the top 10 social media channels when ranked by popularity. It has more than 800 million users and still climbing. The platform has mostly been used for entertainment purposes because businesses did not understand how to make this platform work for them. TikTok has cleared out the air and designed a [&hellip;]","og_url":"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/","og_site_name":"Jarvee","article_published_time":"2020-09-30T20:19:50+00:00","og_image":[{"width":627,"height":418,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Contributing Guest","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2020\/09\/TikTok-Launches-TikTok-for-Business-Platform-for-Marketers.jpg","width":627,"height":418,"caption":"TikTok Launches “TikTok for Business” Platform for Marketers"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#webpage","url":"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/","name":"TikTok Launches “TikTok for Business” Platform for Marketers - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#primaryimage"},"datePublished":"2020-09-30T20:19:50+00:00","dateModified":"2020-09-30T20:19:50+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/tiktok-launches-tiktok-for-business-platform-for-marketers\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"TikTok Launches “TikTok for Business” Platform for Marketers"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07","name":"Contributing Guest","description":"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \"guest posting\" guidelines link.","sameAs":["https:\/\/jarvee.com"],"url":"https:\/\/jarvee.com\/author\/contributor\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/7444"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=7444"}],"version-history":[{"count":1,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/7444\/revisions"}],"predecessor-version":[{"id":7447,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/7444\/revisions\/7447"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/7445"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=7444"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=7444"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=7444"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}