{"id":8832,"date":"2021-04-20T08:50:50","date_gmt":"2021-04-20T08:50:50","guid":{"rendered":"https:\/\/jarvee.com\/?p=8832"},"modified":"2021-08-11T11:45:41","modified_gmt":"2021-08-11T11:45:41","slug":"5-awesome-employer-brand-examples-on-instagram","status":"publish","type":"post","link":"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/","title":{"rendered":"5 Awesome Employer Brand Examples on Instagram"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-8840\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding.jpg\" alt=\"\" width=\"640\" height=\"427\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding.jpg 640w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding-300x200.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding-600x400.jpg 600w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<p>How do qualified candidates evaluate potential employers nowadays?<\/p>\n<p>Earlier, they could learn the primary information about a business only during the interview. Today, it’s enough to visit a company’s Instagram to get a basic understanding of how it treats its employees and cares about their well-being.<\/p>\n<p>The growing interest of potential job applicants in companies’ social media activity and the exposure that comes with it became two main reasons businesses use this platform in <u><a href=\"https:\/\/jarvee.com\/what-is-social-recruiting-and-how-it-works\/\">social recruiting<\/a><\/u> and to build a successful employer brand.<\/p>\n<p>Today, we’re going to explore how you can use Instagram as one of the social media platforms to build an employer brand using the lessons from the companies that are already doing it successfully.<\/p>\n<h2>Why Does Employer Brand Matter?<\/h2>\n<p>Before we jump into our examples, let’s define the employer brand and look at a few stats to prove its recruiting value.<\/p>\n<p>The employer brand reflects the company’s popularity among its employees and highlights the values it promotes as an employer.<\/p>\n<p>How important is the employer brand for your business?<\/p>\n<p>According to the <u><a href=\"https:\/\/business.linkedin.com\/content\/dam\/business\/talent-solutions\/global\/en_us\/c\/pdfs\/ultimate-list-of-employer-brand-stats.pdf\">survey by LinkedIn<\/a><\/u>, 72% of recruiters confirm the importance of employer branding in the hiring process, and here’s why:<\/p>\n<ul>\n<li>Employer brand reduces the cost per hire by 50%.<\/li>\n<li>The organizational turnover drops by 28%.<\/li>\n<li>Successful employer brands hire 50% more qualified candidates.<\/li>\n<\/ul>\n<p>What is Instagram’s role in building an employer brand?<\/p>\n<p>Instagram heavily relies on visual content, which drives more engagement. You can diversify your employer branding strategy with photos, videos, Stories, Reels, and IGTV.<\/p>\n<p>On top of that, Instagram widely uses hashtags to categorize posts and make them more visible. You can even launch hashtag campaigns to get more attention to your employer brand.<\/p>\n<p>Lastly, Instagram is perfect for the businesses aiming to hire younger generations – the largest group using this platform are Millennials and Gen Z-ers <u><a href=\"https:\/\/www.statista.com\/statistics\/325587\/instagram-global-age-group\/\">aged 18-34<\/a><\/u>.<\/p>\n<p>But what does it take to succeed on Instagram as an employer brand?<\/p>\n<p>Here are a few examples from the top companies.<\/p>\n<h2>1. Google – Short Interviews with Employees<\/h2>\n<p>Google is known for being a pioneer in many spheres of technology. But what you don’t know is that its employer brand strategy on Instagram is as remarkable.<\/p>\n<p>On the Life at Google page, the brand turns its employees into <u><a href=\"https:\/\/www.podium.com\/article\/instagram-influencers\/\">Instagram influencers<\/a><\/u>, showing their role in the company. Google’s employees share photos of their home offices, corporate events, and educational programs.<\/p>\n<p>However, the format that flatters Google’s employer brand the most is employee interviews, like this one with Elsa Berentzen-Ferguson, the company’s Customer Success Manager:<\/p>\n<div id=\"attachment_8841\" style=\"width: 634px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8841\" loading=\"lazy\" class=\"wp-image-8841 size-full\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/lifeatgoogle.png\" alt=\"\" width=\"624\" height=\"400\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/lifeatgoogle.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/lifeatgoogle-300x192.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/lifeatgoogle-600x385.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><p id=\"caption-attachment-8841\" class=\"wp-caption-text\"><em>Credit: <a href=\"https:\/\/www.instagram.com\/p\/CNF1oI9jPHq\/\">Life at Google<\/a><\/em><\/p><\/div>\n<p>This interview tells about Elsa’s responsibilities and her role in Google’s growth. She also uncovers a few perks of working for the company, which benefits its employer brand.<\/p>\n<h3>Can the employee interview format work for you as well?<\/h3>\n<p>Featuring employees on corporate social media channels is a part of employee advocacy—a trend that has been gaining momentum in the past few years.<\/p>\n<p>Employee advocacy has a few significant perks:<\/p>\n<ul>\n<li><strong>Employees give an honest insider look at the company. <\/strong>Through an interview, you can ask your employees questions about the true experience of working for your company, providing an accurate image of it as an employer brand.<\/li>\n<li><strong>Staff’s active involvement increases brand engagement. <\/strong>As advocates, your employees contribute their unique ideas to your employer&#8217;s brand strategy, making it more diverse.<\/li>\n<li><strong>Employee advocacy humanizes your employer brand. <\/strong>Showing real people who work for you makes your company appear more credible and trustworthy.<\/li>\n<\/ul>\n<p>Much like Google, you can also take advantage of employee interviews. For example, you can post interviews in Stories, go live on Instagram with your employees, or even film a video for IGTV.<\/p>\n<p>The critical point is to keep your interviews short and straightforward. During the interview, touch upon the central corporate values and how they help your employees grow as professionals. This way, you’ll make a strong point for the benefit of your employer brand.<\/p>\n<h2>2. Salesforce – Promoting Open-Mindedness and Flexibility<\/h2>\n<p>With years, we see more and more employees getting tired of the traditional workplace dynamic, wanting more freedom. Reportedly, <u><a href=\"https:\/\/www.forbes.com\/sites\/jasonwingard\/2020\/03\/06\/94-of-workers-want-this-benefit-and-most-leaders-are-screwing-it-up\/?sh=2ee7ac82451f\">94% of white-collar employees<\/a><\/u> say workplace flexibility is important to them—it can help improve mental health and find work-life balance.<\/p>\n<p>Salesforce took advantage of this trend, highlighting open-mindedness and flexibility as the top corporate values on its Instagram page. Their company policies and the way the organization promotes them has earned Salesforce a rating of the best place to work for parents five years in a row:<\/p>\n<div id=\"attachment_8844\" style=\"width: 634px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8844\" loading=\"lazy\" class=\"wp-image-8844 size-full\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/salesforcejobs.png\" alt=\"\" width=\"624\" height=\"272\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/salesforcejobs.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/salesforcejobs-300x131.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/salesforcejobs-600x262.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><p id=\"caption-attachment-8844\" class=\"wp-caption-text\"><em>                                                                        Credit: <a href=\"https:\/\/www.instagram.com\/p\/CITTpVnAgEi\/\">Salesforce Jobs<\/a><\/em><span style=\"font-size: 16px;\">                                                           <\/span><\/p><\/div>\n<h3>How does Salesforce show its support for parents?<\/h3>\n<p>It often features their employees’ kids in Instagram posts, referring to them as Salesforce’s future generation of trailblazers. The company also holds a lot of kid-friendly events, which it also highlights on its Instagram page.<\/p>\n<h3>How else can you promote open-mindedness and flexibility as an employer brand?<\/h3>\n<p>It’s always a great idea to show some corporate events as a way to diversify your employees’ workdays. This can be a celebration of a national holiday, a closed event, workshops, lectures, conferences, or even a Zoom party.<\/p>\n<p>Also, to <u><a href=\"https:\/\/instasize.com\/blog\/5-tips-to-boost-your-instagram-exposure\">boost Instagram exposure<\/a><\/u> of your posts, you can take advantage of hashtags. At this point, make sure you choose top-performing hashtags that are currently trending on Instagram. But keep in mind that the hashtags should relate to the topic of your post.<\/p>\n<h2>3. Tek Systems—Behind-the-Scenes Content<\/h2>\n<p>When evaluating companies as employers, potential job candidates are often interested in how life goes behind the scenes. Job applicants want to know what’s in store for them, so uploading some BTS content could give them an idea of an employee’s typical day at work.<\/p>\n<p>Tek Systems takes advantage of this approach to its full extent. The company’s <u><a href=\"https:\/\/techwirehub.com\/best-instagram-marketing-strategies\/\">Instagram strategy<\/a><\/u> is filled with behind-the-scenes content featuring its staff, like this yoga session post:<\/p>\n<div id=\"attachment_8845\" style=\"width: 634px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8845\" loading=\"lazy\" class=\"wp-image-8845 size-full\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/tekcareers.png\" alt=\"\" width=\"624\" height=\"275\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/tekcareers.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/tekcareers-300x132.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/tekcareers-600x264.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><p id=\"caption-attachment-8845\" class=\"wp-caption-text\">Credit: <a href=\"https:\/\/www.instagram.com\/p\/B7RHuSCFKE8\/\">TekCareers<\/a><\/p><\/div>\n<p>Tek System’s Instagram page also has behind-the-scenes IGTV videos, and product development sneak peeks. Before the pandemic, the company often posted pictures of its offices, which potential job applicants can find helpful.<\/p>\n<h3>What benefits does BTS content have for your employer brand?<\/h3>\n<p>Apart from giving a general insider look at the company, behind-the-scenes content has an array of benefits:<\/p>\n<ul>\n<li><strong>It’s another opportunity to showcase your team. <\/strong>You already know about the benefits of employee advocacy for employer brands. Behind-the-scenes content is one more opportunity to introduce your staff, just in a more natural and less staged way.<\/li>\n<li><strong>BTS content reflects the effort that goes into your product. <\/strong>We mentioned that you could use behind-the-scenes content to show the product development process. It’s an opportunity to show job applicants what they’re in for and also what you expect from them.<\/li>\n<li><strong>It’s a chance to show the perks of working for your company. <\/strong>Fun events, corporate education, and professional development—you can feature all these advantages in your BTS content to lure in top-notch candidates.<\/li>\n<\/ul>\n<p>Making behind-the-scenes content a part of your <a href=\"https:\/\/jarvee.com\/how-to-develop-instagram-marketing-strategies-to-boost-sales\/\">Instagram marketing<\/a> strategy makes a strong case for your employer brand. Keep in mind, though—this content should be created naturally. Just show how much fun it is to work for you, and it will do the trick.<\/p>\n<h2>4. Microsoft—Supporting Diversity<\/h2>\n<p>In recent years, diversity has been one of the hottest topics in HR and recruitment. Job candidates expect employers to create diverse workplaces to show their support of underrepresented minorities and their needs.<\/p>\n<p>Diversity can become one of the frontline topics in your employer&#8217;s brand strategy on Instagram. And there are many ways how you can show your support of diverse workplaces.<\/p>\n<p>For instance, Microsoft features its diverse employees in cooking videos, where they prepare their traditional dishes. The entire idea turned into something similar to an <u><a href=\"https:\/\/www.mediatraining.ltd.uk\/blogs\/influencer-marketing-strategies-for-your-social-media\">influencer marketing<\/a><\/u> campaign, but it’s Microsoft employees who are giving tips and recommendations:<\/p>\n<div id=\"attachment_8843\" style=\"width: 634px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8843\" loading=\"lazy\" class=\"wp-image-8843 size-full\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/microsoftlife.png\" alt=\"\" width=\"624\" height=\"313\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/microsoftlife.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/microsoftlife-300x150.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/microsoftlife-600x301.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><p id=\"caption-attachment-8843\" class=\"wp-caption-text\">Credit: <a href=\"https:\/\/www.instagram.com\/p\/CLfCCstBwuB\/\">Microsoft Life<\/a><\/p><\/div>\n<p>There are also other posts featuring diverse employees from Microsoft locations around the world. It’s a great way to show the company’s support for different communities. And this approach works out well for Microsoft’s employer brand.<\/p>\n<h3>What are other Instagram content ideas for supporting diversity?<\/h3>\n<p>The main goal is to show diversity through culture. For example, you can commemorate some traditional ethnic holidays on your Instagram page and mention how many employees of that ethnicity are a part of your team.<\/p>\n<p>If you would like to attract more diverse employees to your company, ask your team members to promote your employer brand through their Instagram accounts. This approach is similar to <u><a href=\"https:\/\/leadgenapp.io\/\">lead generation<\/a><\/u>, except your employees help attract potential job applicants from their communities instead.<\/p>\n<p>And, of course, it’s always a great idea to show each employee’s role in your company. This way, you recognize their contribution, which flatters you as an employer brand.<\/p>\n<h2>5. Marriott—Highlighting the Importance of Social Issues<\/h2>\n<p>The support for social causes is a sign of an employer brand with high morals. Job candidates are often looking for companies where they can both work on exciting projects and increase their social impact.<\/p>\n<p>So, highlight your charitable activities in your employer brand strategy on Instagram to show which social issues your company is passionate about.<\/p>\n<p>For instance, Marriott manifests its support of sustainability by protecting turtle habitats and partnering with local fishermen around the world:<\/p>\n<div id=\"attachment_8846\" style=\"width: 634px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8846\" loading=\"lazy\" class=\"wp-image-8846 size-full\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/marriottcareers.png\" alt=\"\" width=\"624\" height=\"290\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/marriottcareers.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/marriottcareers-300x139.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/marriottcareers-600x279.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><p id=\"caption-attachment-8846\" class=\"wp-caption-text\">Credit: <a href=\"https:\/\/www.instagram.com\/p\/CI5xaNgsYzA\/\">Marriott Careers<\/a><\/p><\/div>\n<p>Marriott’s Instagram page also shows its employees participating in charity marathons and fundraising events. This way, the company recognizes that change is not possible without its staff’s contribution.<\/p>\n<h3>How else can you highlight social issues to build up an employer brand?<\/h3>\n<p>If you’re looking for potential job applicants who would share your passion for a particular social cause, you can pair your Instagram employer brand strategy with <u><a href=\"https:\/\/blog.appsumo.com\/tools-for-email-outreach\/\">email outreach<\/a><\/u>. For example, you can feature your Instagram post in a newsletter and let more people know about the charities you support.<\/p>\n<p>You can also ask your employees to share their favorite causes on your Instagram page. Google often practices this approach, giving its staff a platform to attract public attention to less popular social issues.<\/p>\n<p>Apart from that, launching an affiliate campaign, which you can manage through <u><a href=\"https:\/\/www.idevdirect.com\/\">iDev Affiliate<\/a><\/u>, can help you raise funds for the social issues you are passionate about. Such a campaign will give you great publicity and contribute to your employer&#8217;s brand.<\/p>\n<h2>Invest in Your Employer Brand<\/h2>\n<p>If you want to bring more qualified candidates to your team, it will be pretty hard to achieve without a strong employer brand. We live in an age when everyone googles everyone. And it’s nothing to be afraid of but rather to take advantage of.<\/p>\n<p>You can start building your employer brand on Instagram to show what it’s like to work at your company. For instance, you can feature your employees who would tell about different workplace experiences and perks of working for you.<\/p>\n<p>If you want to attract the right candidates, it’s always a great idea to create content representing your company’s values, such as supporting diversity, flexibility, and different social issues.<\/p>\n<p>And, to show a more casual side of your company, you can have fun with behind-the-scenes content. As a result, you will create a well-rounded image of your employer on Instagram and get the attention of the best candidates on the market.<\/p>\n<h3>About the Author<\/h3>\n<p>Mariia Kovalenko is a content writer at <u><a href=\"https:\/\/digitalolympus.net\/\">Digital Olympus<\/a><\/u>. She’s been working as a writer and guest contributor for over 3 years, specializing in topics such as social media marketing, email marketing, and link building. You can visit her <u><a href=\"https:\/\/www.linkedin.com\/in\/mariia-kovalenko-075924154\/\">Linkedin<\/a><\/u> profile to learn more about her experience.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How do qualified candidates evaluate potential employers nowadays? Earlier, they could learn the primary information about a business only during the interview. Today, it’s enough to visit a company’s Instagram to get a basic understanding of how it treats its employees and cares about their well-being. The growing interest of potential job applicants in companies’ [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":8840,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[25,2],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>5 Awesome Employer Brand Examples on Instagram - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"5 Awesome Employer Brand Examples on Instagram - Jarvee\" \/>\n<meta property=\"og:description\" content=\"How do qualified candidates evaluate potential employers nowadays? Earlier, they could learn the primary information about a business only during the interview. Today, it’s enough to visit a company’s Instagram to get a basic understanding of how it treats its employees and cares about their well-being. The growing interest of potential job applicants in companies’ [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2021-04-20T08:50:50+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-11T11:45:41+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"640\" \/>\n\t<meta property=\"og:image:height\" content=\"427\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Contributing Guest\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding.jpg\",\"width\":640,\"height\":427},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#webpage\",\"url\":\"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/\",\"name\":\"5 Awesome Employer Brand Examples on Instagram - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#primaryimage\"},\"datePublished\":\"2021-04-20T08:50:50+00:00\",\"dateModified\":\"2021-08-11T11:45:41+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"5 Awesome Employer Brand Examples on Instagram\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\",\"name\":\"Contributing Guest\",\"description\":\"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \\\"guest posting\\\" guidelines link.\",\"sameAs\":[\"https:\/\/jarvee.com\"],\"url\":\"https:\/\/jarvee.com\/author\/contributor\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"5 Awesome Employer Brand Examples on Instagram - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/","og_locale":"en_US","og_type":"article","og_title":"5 Awesome Employer Brand Examples on Instagram - Jarvee","og_description":"How do qualified candidates evaluate potential employers nowadays? Earlier, they could learn the primary information about a business only during the interview. Today, it’s enough to visit a company’s Instagram to get a basic understanding of how it treats its employees and cares about their well-being. The growing interest of potential job applicants in companies’ [&hellip;]","og_url":"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/","og_site_name":"Jarvee","article_published_time":"2021-04-20T08:50:50+00:00","article_modified_time":"2021-08-11T11:45:41+00:00","og_image":[{"width":640,"height":427,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Contributing Guest","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/04\/branding.jpg","width":640,"height":427},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#webpage","url":"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/","name":"5 Awesome Employer Brand Examples on Instagram - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#primaryimage"},"datePublished":"2021-04-20T08:50:50+00:00","dateModified":"2021-08-11T11:45:41+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/5-awesome-employer-brand-examples-on-instagram\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"5 Awesome Employer Brand Examples on Instagram"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07","name":"Contributing Guest","description":"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \"guest posting\" guidelines link.","sameAs":["https:\/\/jarvee.com"],"url":"https:\/\/jarvee.com\/author\/contributor\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/8832"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=8832"}],"version-history":[{"count":8,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/8832\/revisions"}],"predecessor-version":[{"id":9030,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/8832\/revisions\/9030"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/8840"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=8832"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=8832"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=8832"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}