{"id":9235,"date":"2021-06-10T15:19:47","date_gmt":"2021-06-10T15:19:47","guid":{"rendered":"https:\/\/jarvee.com\/?p=9235"},"modified":"2021-06-10T15:27:22","modified_gmt":"2021-06-10T15:27:22","slug":"2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic","status":"publish","type":"post","link":"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/","title":{"rendered":"2 Underrated yet Advanced Techniques To Boost Your YouTube Traffic"},"content":{"rendered":"<p><span style=\"font-weight: 400;\"><img loading=\"lazy\" class=\"aligncenter wp-image-9237 \" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation.jpg\" alt=\"\" width=\"808\" height=\"454\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation.jpg 900w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation-300x169.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation-768x432.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation-600x337.jpg 600w\" sizes=\"(max-width: 808px) 100vw, 808px\" \/><\/span><\/p>\n<p>There is a huge crowd of people on YouTube competing for views and traffic on the platform. You may have one of the best content, your videos may look modern, stylish and exciting, and you may also be using the best SEO and promotion techniques. But still, you still feel like missing out on something and not getting the results you were expecting, or that other channels in your same niche are getting.<\/p>\n<p>What to do then? The good news is there are a few advanced techniques that allow you to boost your channel visibility in a safe way, techniques which are effectively used by some people but which are yet unknown to most people and hence, very underrated. In this article, we will reveal these two advanced and effective YouTube growth hacks.<\/p>\n<h2>#1 Try Powerful Social Media Automation<\/h2>\n<p>The first technique we will share in today&#8217;s article is social media automation. If you use Instagram regularly, you have surely heard about it a thousand times. But not many people know that automation is a real thing also when it comes to YouTube and it can drive fabulous results! There are three main different ways of taking full advantage of YouTube automation, and we will see them in just a few seconds.<\/p>\n<p>Social media automation is a boon when it comes to managing profiles that have grown larger in size in a short time. We have already discussed that (browse our blog to read it if you haven&#8217;t). Besides, what we didn’t discuss in that post is that social media automation is not only about managing large channels. There are various other techniques that can help boost the traffic on your channel, but due to their large scale nature and amount of work needed, it&#8217;s not possible to employ them manually. This is where social media automation comes to our rescue.<\/p>\n<p>These techniques pretty much use the same concept as the famous Instagram automation which relies on follow\/unfollow, but on YouTube. The goal is simple: get as many people as possible to notice your channel and you will be 100% sure that at least a few of them will become your subscribers or fans. But let’s discuss some of those techniques more in detail.<\/p>\n<h3>1.1 Subscribe and get noticed<\/h3>\n<p>If you follow a lot of such people who might be interested in the type of content you create, they might follow you back giving a boost to your subscriber count. But manually you can not subscribe to a lot of people and further it is difficult to figure out who might be interested in your content. Automaton software with AI powered features can easily help us with that. But make sure that you keep your subscription to the public, so creators will see the notification, and make sure to target channel with a low count of subscribers. You will be amazed by the results.<\/p>\n<h3>1.2 Leave comments<\/h3>\n<p>This is probably the most effective and scalable. You can leave comments on videos of people who might be interested in your type of content. This way you can easily catch their attention. Automation softwares can easily help you with this as well and will allow you to target specific niches or keywords, which will result in truly interested subscribers from people who watch the same niche as the one you are in. This, once again, is probably the most effective one and you might have seen it too while browsing YouTube. Yes, those comments that you find on each single video, from the same person and with the same message! The trick here, to prevent issues, is to not use your main channel. Rather use multiple &#8220;child&#8221; accounts which promote your main channel. A super effective yet underrated technique! If you want to find out more about this technique, then you should definitely read our <a href=\"https:\/\/jarvee.com\/knowledge-base\/youtube-comment-tool\/\">YouTube Comment Tool Guide<\/a> and eventually, start your free 7 days trial, to see the results yourself.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/human-like-actions.jpg\" alt=\"\" width=\"803\" height=\"451\" \/><\/p>\n<p>With automation tools like Jarvee, you can automate human-like actions while you are sleeping and grow your traffic<\/p>\n<h3>1.3 Reply to your fans<\/h3>\n<p>This is clearly a technique for advanced channels which receive a lot of traffic already &#8211; and if you have good content and implemented the strategies from this blog post long enough &#8211; you might get there earlier than you expect. In fact, you can use automation to reply to all the comments on your videos, thereby increasing your engagement with your viewers and subscribers, increasing the conversion rate of people who commented without subscribing and, lastly, have YouTube algorithm to appreciate you more. Yes, because YouTube wants you to engage with your community and fans. If you want to be a rockstar and have all your fans to love you and engage with you, then also <a href=\"https:\/\/creatoracademy.youtube.com\/page\/lesson\/artist-fans\">YouTube Academy<\/a> has some very good tip for you which you should later check out.<\/p>\n<p>And by automating your process on YouTube, you can employ these various techniques that can help you garner that additional traffic that earlier felt missing. But which tool to use? You are lucky enough that you landed on the blog of the most popular social media automation out there, Jarvee. There are various such tools and services available in the market, but Jarvee is currently the only one to offer a free trial with no need of adding a payment method.<\/p>\n<p>Social media automation can hence become our 24\/7 growth partner, but as previously mentioned it should be mixed up with other strategies to make a YouTube channel properly grow. The first one is surely the quality of content, then comes the usual video SEO tips such as relevant title, a catchy thumbnail and creating many videos. But if we want to talk about more underrated techniques, here we go with the second one!<\/p>\n<h2>#2 Unleash The Power Of YouTube Ads<\/h2>\n<p>Well as we said, nothing is enough on its own when it comes to garnering YouTube traffic. You have to use a mix of various techniques and another must-to-employ one is to use YouTube advertising to promote your content. However, it&#8217;s not as simple as it appears. Advertising on YouTube is a bit different from that on other platforms and a bit complex too. And you can reap the full benefits of it only when you know the ads system of YouTube correctly and understand its intricacies, or you will spend a lot of money for average results. Therefore, we will attempt to make things simple and describe the system to you, plus give you some bonus yet golden tip.<\/p>\n<p>The YouTube ads are targeted according to viewer’s interest. Youtube&#8217;s advanced algorithm identifies the interest of the viewers and ads are shown to them accordingly. This is because a viewer is more likely to click on an ad, if it interests him. But when you are promoting your video, you can’t rely just on YouTube algorithm or your won’t take full advantage of the advertising potential. You need to take care of the specific campaign settings such as niche, keywords, country, age and so on. And, when it comes to promoting your own YouTube videos, it is important to select only the best ones and not necessarily the newest ones. Because the very best ones will lead the best engagement and conversion. Or, even better, you could create a channel trailer to run as ad!<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-9239 \" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/youtube-ads.jpg\" alt=\"\" width=\"806\" height=\"453\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/youtube-ads.jpg 900w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/youtube-ads-300x169.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/youtube-ads-768x432.jpg 768w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/youtube-ads-600x337.jpg 600w\" sizes=\"(max-width: 806px) 100vw, 806px\" \/><\/p>\n<p>Use Google itself to promote your YouTube videos<\/p>\n<p>As for the formats, YouTube gives you the option to decide between different types of promotion. Let&#8217;s see them all and then we will also see which one is better to get views on your videos.<\/p>\n<ul>\n<li aria-level=\"1\">Video Discovery Ads. These are those ads which appear in YouTube home feed, on the top of search results, and on the top of the next video suggestions. You have to pay for the ads only if a viewer clicks on the ad.<\/li>\n<\/ul>\n<ul>\n<li aria-level=\"1\">In stream Ads (Skippable). These are the ads which appear before the viewers’ chosen video, so before a video starts playing. They can range from 6 seconds to 6 minutes but the viewer has the option to skip after 5 seconds. You only have to pay if the viewer watches at least for 30 seconds or clicks on the ad.<\/li>\n<\/ul>\n<p>The above two types of ads are known as TrueView ads. But which one to choose? They are both great options to promote your content, specially if your channel is in its initial stages. Because you get views quickly and because you pay only if the viewer interacts with your ads, in both Ad formats. And if a viewer has interacted, he is certainly interested in your content. You can be assured that you have spent money on a potential subscriber. Besides, while creating these ads, make sure that they look interesting and include appealing calls to action.<\/p>\n<p>But, In stream and Discovery are still not the same. There are two main differences between Discovery Ads and Skippable Ads which you might want to consider when deciding which one to run. In stream (skippable) ads are much cheaper, usually at least half as cheap than Discovery, but the user does not click on the thumbnail. This means that it is targeted by YouTube’s algorithm and the campaign settings, but the video ad is played without that the user actually decides to. Yes, you are gonna pay only if the user watches at least 30 seconds or click on your Ad (which should redirect to your channel or video), but it is still slightly less targeted than Discovery.<\/p>\n<p>Because on the other hand, Discovery ads to be played require initial action by the user, meaning the video will play only if the user clicks on the thumbnail, which usually results in better engagement and audience retention. As previously mentioned though, Discovery Ads are usually at least twice more expensive to get the same amount of views.<\/p>\n<p>Long story short, Skippable Ads are a good option if you want to get more views or you have short, universally likable videos such as music. Discovery ads are a better option if you want to target in a more accurate way and get higher quality traffic.<\/p>\n<p>If you want to start your first YouTube Ads campaign, then <a href=\"https:\/\/ads.google.com\/home\/campaigns\/video-ads\/\">check this page<\/a> which is a very simple video campaign template made by Google, which allows also a total YouTube Ads newbie to start his first campaign in a matter of minutes!<\/p>\n<p>Increase traffic on your video as soon as it&#8217;s published with targeted YouTube Ads<\/p>\n<p>Then, we also have another two types of ads, which will include in this post but are not recommended for YouTube videos. Yet, you should still give them a read because maybe, you can (or someday will) use them for a different purpose.<\/p>\n<ul>\n<li aria-level=\"1\">In stream Ads (Unskippable). These are those ads that can appear before, in the middle, at the end of a playing video. Their length has to be between 20-30 seconds. For these ads, you are charged per 1000 views and not based on interaction, as the viewer cannot skip the ad. The good part of these videos is that you are sure the viewers are going to watch it, so if you are all about retention you can try them. That being said, they will be much more expensive and they should be used just to promote your business or external websites.<\/li>\n<\/ul>\n<p>But, let&#8217;s say the budget is not an issue for you and you still want to be that rare bird who uses unskippable ads to get views, here is a benefit about them and a tip on how you should use them. Because here is two things. First, while your focus for skippable ads is to make an interesting ad video, for unskippable ads (although the ad definitely needs to be interesting) you can focus more on showcasing the best qualities of your channel.<\/p>\n<p>The other thing is that, while skippable video ads help you to attract those viewers, who already have an interest in your type of content, the unskippable ads, by showcasing the best qualities of your content, can help you attract even those viewers who don&#8217;t generally watch your type of content.<\/p>\n<ul>\n<li aria-level=\"1\">Bumper Ads.  These are in-stream and unskippable 6 seconds ad videos that play before a viewer’s chosen video. These are helpful to remind the viewers of something new you have launched, like a new video, or a new product or scheme. These ads need you to be much more creative and need to be intense. As you can imagine, these ads formats are to promote brands or products and leave a good brand impression. These ad format is never to be used to get views.<\/li>\n<\/ul>\n<p>And this was a quick explanation on the available Youtube ads formats and their possible use with the main purpose of getting more views and growing you channel.<\/p>\n<p>If you want to read in more detail about this topic you can check out <a href=\"https:\/\/www.oberlo.in\/blog\/youtube-ads-beginners-launch-first-campaign\">this blog post<\/a> by Oberlo or if you want to know it all, you can take the <a href=\"https:\/\/creatoracademy.youtube.com\/page\/course\/how-ads-work\">Google academy course<\/a>. However, we would say that after reading this post you already know the most important staff and most importantly, how to craft the use of YouTube ads is something that you will learn over time. Try them, monitor analytics and see what works best for you. You can start your first campaign quickly with the golden link we previously shared or you can use services such as <a href=\"https:\/\/www.lenostube.com\/en\/\">Lenos<\/a> which do all the work for you.<\/p>\n<p>Whatever your choice is, make sure you implement Ads with &#8211; once again &#8211; great content and other strategies such as automation. All the best and we are sure that your channel will rise, it&#8217;s just about time!<\/p>\n<h2>Author&#8217;s bio<\/h2>\n<p>Jack is a young man from Italy who is passionate about YouTube and finding new, secret YouTube growth strategies which allow content creators to grow faster. He has a few popular YouTube channels and many others which he likes to use for my testing purposes!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is a huge crowd of people on YouTube competing for views and traffic on the platform. You may have one of the best content, your videos may look modern, stylish and exciting, and you may also be using the best SEO and promotion techniques. But still, you still feel like missing out on something [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[35],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>2 Underrated yet Advanced Techniques To Boost Your YouTube Traffic - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"2 Underrated yet Advanced Techniques To Boost Your YouTube Traffic - Jarvee\" \/>\n<meta property=\"og:description\" content=\"There is a huge crowd of people on YouTube competing for views and traffic on the platform. You may have one of the best content, your videos may look modern, stylish and exciting, and you may also be using the best SEO and promotion techniques. But still, you still feel like missing out on something [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2021-06-10T15:19:47+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-06-10T15:27:22+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Martin Brown\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation.jpg\",\"width\":900,\"height\":506},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#webpage\",\"url\":\"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/\",\"name\":\"2 Underrated yet Advanced Techniques To Boost Your YouTube Traffic - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#primaryimage\"},\"datePublished\":\"2021-06-10T15:19:47+00:00\",\"dateModified\":\"2021-06-10T15:27:22+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/7ef2815edf58d9c8706cdaaf5ce6af50\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"2 Underrated yet Advanced Techniques To Boost Your YouTube Traffic\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/7ef2815edf58d9c8706cdaaf5ce6af50\",\"name\":\"Martin Brown\",\"url\":\"https:\/\/jarvee.com\/author\/martinbrown\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"2 Underrated yet Advanced Techniques To Boost Your YouTube Traffic - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/","og_locale":"en_US","og_type":"article","og_title":"2 Underrated yet Advanced Techniques To Boost Your YouTube Traffic - Jarvee","og_description":"There is a huge crowd of people on YouTube competing for views and traffic on the platform. You may have one of the best content, your videos may look modern, stylish and exciting, and you may also be using the best SEO and promotion techniques. But still, you still feel like missing out on something [&hellip;]","og_url":"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/","og_site_name":"Jarvee","article_published_time":"2021-06-10T15:19:47+00:00","article_modified_time":"2021-06-10T15:27:22+00:00","og_image":[{"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation.jpg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Martin Brown","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/automation.jpg","width":900,"height":506},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#webpage","url":"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/","name":"2 Underrated yet Advanced Techniques To Boost Your YouTube Traffic - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#primaryimage"},"datePublished":"2021-06-10T15:19:47+00:00","dateModified":"2021-06-10T15:27:22+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/7ef2815edf58d9c8706cdaaf5ce6af50"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/2-underrated-yet-advanced-techniques-to-boost-your-youtube-traffic\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"2 Underrated yet Advanced Techniques To Boost Your YouTube Traffic"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/7ef2815edf58d9c8706cdaaf5ce6af50","name":"Martin Brown","url":"https:\/\/jarvee.com\/author\/martinbrown\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9235"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=9235"}],"version-history":[{"count":7,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9235\/revisions"}],"predecessor-version":[{"id":9245,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9235\/revisions\/9245"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=9235"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=9235"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=9235"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}