{"id":9305,"date":"2021-06-25T14:14:16","date_gmt":"2021-06-25T14:14:16","guid":{"rendered":"https:\/\/jarvee.com\/?p=9305"},"modified":"2021-07-01T20:24:24","modified_gmt":"2021-07-01T20:24:24","slug":"guide-to-nailing-a-virtual-pitch-the-before-during-and-after","status":"publish","type":"post","link":"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/","title":{"rendered":"Guide To Nailing A Virtual Pitch: The Before, During, And After"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"aligncenter\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/virtual-pitch-1024x640.jpg\" alt=\"\" width=\"798\" height=\"499\" \/><\/p>\n<p>The corporate world altered when the pandemic hit us. Businesses adopted virtual operations to continue working remotely. Thanks to technological innovations, our generation had all the gears to weather the storm.<\/p>\n<p>Now, with more individuals getting vaccinated, the governments have started lifting business restrictions. Companies like <a href=\"https:\/\/gadgets.ndtv.com\/internet\/news\/microsoft-redmond-office-hq-headquarters-reopen-coronavirus-covid-19-march-29-work-from-home-2396872\">Microsoft<\/a> are slowly adopting a “hybrid workplace culture” where employees can choose between working from home and working from an office.<\/p>\n<p><a href=\"https:\/\/jarvee.com\/6-tips-to-help-your-business-survive-the-coming-pandemic-waves\/\">Pandemic<\/a> opened another door for corporates in the form of remote working. Leading brands like  <a href=\"https:\/\/www.washingtonpost.com\/technology\/2020\/10\/01\/twitter-work-from-home\/\">Twitter<\/a> and <a href=\"https:\/\/www.cbc.ca\/news\/canada\/ottawa\/shopify-pandemic-staff-ottawa-1.5578614\">Shopify<\/a> saw this as an opportunity to work remotely indefinitely.<\/p>\n<p>Some businesses might be moving back to in-person workplaces, yet, with many brands going digital by default, virtual practices have outlived the lockdown.<\/p>\n<p>So, whether you are finding an investor or you are an <a href=\"https:\/\/smegoweb.co.nz\/seo\/\">SEO company<\/a> pitching your marketing services, a virtual pitch will be prevalent for the time to come.<\/p>\n<p>You might think that virtual meetings have prepared you for what is coming. But in reality, pitches are a lot different.<\/p>\n<p>The way you dress, the way you talk, the place you choose to sit, the small talk that you make, the way you answer questions. Everything needs to be perfect if you wish to nail a virtual pitch.<\/p>\n<p>In this article, we will talk about things to keep in mind when preparing for the pitch, during, and after the pitch has ended.<\/p>\n<h2>Preparation Stage<\/h2>\n<p>If you are going to pitch virtually from home, make sure your family\/housemates are aware.<\/p>\n<p>Keep your pets outside your meeting room. Many believe showing their dogs or cats is a ‘cute’ practice. No doubt, your pets are adorable, but they will disrupt the focus of your meeting. You don&#8217;t want that.<\/p>\n<p>Here are other tips to keep in mind.<\/p>\n<h2>Start preparing at least 15 minutes before the call<\/h2>\n<p>I am sure you would have shared a calendar link with the prospect when you booked the pitch. That is a great practice, no doubt. However, you should always resend the link at least 15 minutes before the pitch.<\/p>\n<p>The reason is pretty simple &#8211; to make things convenient for the prospect. They might find digging out your mail from the pile a little time-consuming. It can affect their mood and consequently, your pitch.<\/p>\n<p>Thus, send a link a few minutes before the scheduled time. It will act as a reminder and help them get prepared as well.<\/p>\n<p>Another practice to keep in mind is being on time. Get on the call five minutes earlier than the decided time so that your prospect doesn’t have to wait for you to join. It will surely get you brownie points. Who doesn&#8217;t like punctual individuals?<\/p>\n<h2>Find a proper workstation<\/h2>\n<p>Workstation is an important consideration to make before you get on the call. It&#8217;ll define your comfort and their focus.<\/p>\n<p>Let me give you an example.<\/p>\n<p>Suppose you choose a swivel chair to sit with a packed bookshelf behind you. Now, you might be unconsciously swiveling in your chair, but the person sitting in the front, who cannot see your seat, will think that you are in a hurry. Secondly, the books behind you might take the attention off you. If that happens, getting your prospect&#8217;s focus from the books to your pitch will be challenging.<\/p>\n<p>So, it&#8217;s better to steer clear of clustered or decorative walls and also windows. When the sun&#8217;s out, your windows can create a halo effect behind you, and when it&#8217;s night, your prospects will be able to see the reflection of your room. Both can be distracting.<\/p>\n<p>Find yourself a spot where your background is a light-colored plain wall. Keep a good source of light in front of you so that you are easily visible to your prospect.<\/p>\n<p>Many overlook a good workstation, you shouldn&#8217;t!<\/p>\n<h2>Keep your deck short and minimalistic<\/h2>\n<p>We live in an age where one thing that an individual never has enough of is time.<\/p>\n<p>Things can get more difficult when we are pitching virtually. Keeping the prospect engaged is tricky when you&#8217;re not with them in the same room.<\/p>\n<p>Hence, keep your slides to a minimum number while also reducing the speaking time.<\/p>\n<p>If there are sections that are a bit longer, try involving more people. Or maybe you can share supplementing material once the presentation is over.<\/p>\n<p>Figure out the topics that you think are important for your prospect to focus on. For example, imagine you are an SEO company, pitching a client for digital marketing. You should focus on things that will matter to your prospect. Target audience, tools like  <a href=\"https:\/\/www.rankwatch.com\/\">SEO rank checker<\/a>, and ROI will keep them engaged since their goal will be the center of attention.<\/p>\n<p>Now, when we say minimalistic, we mean simple and neat. Your prospect will be viewing your presentation on their laptops or external monitors. Basically, the devices are smaller than the ones that are usually used for pitches.<\/p>\n<p>Keep your presentations away from too much content crammed in one slide. Maintain white space and use fewer technical terms so that it&#8217;s easier for everyone on the call to understand.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/research-scaled-e1624629104874-1024x686.jpg\" alt=\"\" width=\"800\" height=\"536\" \/><\/p>\n<h2>Do proper prospect research<\/h2>\n<p>It pays to check out your prospect&#8217;s background.<\/p>\n<p>The more knowledge you have about them, the better. When you get on a call, you will have to make small talk. It acts as a build-up and is definitely inevitable.<\/p>\n<p>During this small talk, you will feel more comfortable if you already know about them. You can ask them about new upgrades or how their new policies are working out (if any). This will not only make the small talk easy for you but also help impress your prospects.<\/p>\n<p>Do the proper research to score those extra points.<\/p>\n<h2>Dress well<\/h2>\n<p>People like it when others put in their efforts. The way you dress is one of the ways to show that.<\/p>\n<p>When we are all working from home, we tend to find the most comfortable outfits to sit and work in. There&#8217;s no harm in doing this till the time you are not getting on a call in your panda pajamas!<\/p>\n<p>You want your prospect to take you seriously. A casual attire says quite the opposite.<\/p>\n<p>Treat your virtual pitch as you would a face-to-face pitch. If you had the chance to go to your prospects&#8217; office, I am sure you would have given your outfit a thought.<\/p>\n<p>You would have chosen your best, crisp shirt with contrasting trousers, well-polished shoes, and a well-groomed look. Keep the same energy for your virtual pitch.<\/p>\n<p>It shows you mean business, regardless of where you are sitting.<\/p>\n<h2>Keep other gadgets away<\/h2>\n<p>Imagine a scenario.<\/p>\n<p>You&#8217;re listening to someone talking very seriously. It was them who suggested that you lend them an ear. Now, when you do, they suddenly stop talking to reply to a text\/take a call and then get back to you again. How would that make you feel? Unimportant, obviously.<\/p>\n<p>This is exactly how your prospect will perceive you if you keep looking at your phone or your tab while presenting your pitch. You might not be in a hurry. It might just be involuntary. However, explaining this to your prospect will be close to impossible.<\/p>\n<p>Also, make sure you are always using a laptop to attend a meeting. Using your phone while you are commuting to make a pitch will only show you are uncommitted.<\/p>\n<p>Hence, keep your phones and other gadgets away. If possible, keep them silent so that no one can disturb you when you are on a pitch call.<\/p>\n<p>Do not forget to mute all your social media and other communication channels that are logged in from your computer.<\/p>\n<p>It’s best to avoid all the oops moments!<\/p>\n<h2>Use high-quality equipment<\/h2>\n<p>Buying high-quality equipment for virtual meetings and pitches is an investment. An investment that will not disappoint you.<\/p>\n<p>You should make it a point to keep the camera at your eye level. It&#8217;s important to have a good visual presence for your virtual pitch to go well.<\/p>\n<p>To do this, instead of piling up books underneath your laptop, why not find a stable solution? A good webcam will help improve and take the visuals of your pitch to the next level. Your screen will not get blurred, which is a plus point.<\/p>\n<p>Since you will be speaking a lot, it&#8217;s also suggested to invest in a microphone. It&#8217;ll add to the overall sound quality of the meeting and your prospect will be able to hear you more clearly.<\/p>\n<p>Just make sure that you give the equipment a try before getting on a call. You don&#8217;t want to look technologically handicapped when presenting your virtual pitch.<\/p>\n<p>The better the quality of your video and audio is, the better perception your prospect will have of you.<\/p>\n<h2>Practice your pitch before presenting<\/h2>\n<p>Practice makes you perfect and you want to look perfect.<\/p>\n<p>Before you get on a call, make sure you practice your pitch. During this time, understand the flow of the presentation.<\/p>\n<p>If there is any word that you are not comfortable pronouncing, keep practicing till the time you don&#8217;t get it right. Getting stuck will create a very minimal but negative impact.<\/p>\n<p>You should also be mindful of your hand moments. We often tend to use our hands a lot when explaining something. However, it can get a little distracting when you use your hands too much.<\/p>\n<p>The best way to practice your pitch is to get others on board. Ask your family or friends to play the role of a prospect. You can engage in a conversation with them and understand your areas of improvement.<\/p>\n<p>They are also your best critique, so be ready for honest feedback.<\/p>\n<h2>During The Pitch<\/h2>\n<p>Don&#8217;t get on a call and then leave, and then join back again. Just shows how unprepared you are. Once you are there on the call and others have joined in, stick to your seat till the very end.<\/p>\n<p>Keep these following points in mind when you finally get on the call:<\/p>\n<h2>Break the ice<\/h2>\n<p>The first thing for you to focus on is making your prospect feel comfortable.<\/p>\n<p>Many of us find it a little difficult to make small talk. However, when you are presenting a pitch, it&#8217;s the need of the hour. Having good communication skills and confidence is what will help you progress.<\/p>\n<p>Once everyone is on the call, make sure to start with introductions if there are certain people who don&#8217;t know each other. No one likes to be on a call with a complete stranger for an hour!<\/p>\n<p>Ask your prospect about their work and how they are doing. This will help them warm up to you and get prepared.<\/p>\n<p>Get acquainted with your prospect at the start of the call and you&#8217;ll be fine. Just don&#8217;t be nervous. They are also humans.<\/p>\n<h2>Give your prospect time to talk<\/h2>\n<p>This is perhaps the most underrated piece of advice ever given.<\/p>\n<p>Indeed, there are plenty of silent moments during a virtual pitch. The pauses can go on for longer than usual and often get a little awkward. So, it&#8217;s better to be prepared for such times.<\/p>\n<p>Fortunately, the more you talk to people, the better you will get at understanding the right time to start talking again.<\/p>\n<p>Now, it&#8217;s very easy for your virtual pitch to go bland if it&#8217;s only you who&#8217;s talking the entire time. The chances of your prospect getting bored are high, no matter how interesting your presentation is.<\/p>\n<p>It&#8217;s best to avoid such a situation. It’s best to get them involved in the pitch by asking them questions or answering theirs.<\/p>\n<p>Don&#8217;t take out time separately for this. They might not have enough things to talk about. Engage with them in the middle of your presentation.<\/p>\n<p>For example, you are a media planning company. You can ask your prospect &#8220;how many ads have you tested?&#8221; in the middle of the pitch. This helps you interact with your prospect while getting a better understanding of how they work.<\/p>\n<h2>Be enthusiastic<\/h2>\n<p>What will attract you more? Someone talking about their passion like it&#8217;s just another task or someone who can&#8217;t seem to calm down?<\/p>\n<p>The answer is obvious. The latter one. When your prospect agrees to attend your pitch, they want to see that passion. They want to know that you mean business.<\/p>\n<p>If you just sit there, expressionless, it will only cause a negative impact.<\/p>\n<p>Be confident. Be enthusiastic when presenting your pitch. It&#8217;s your dream. We all need dollars to survive. Treat your pitch like it&#8217;s the best thing that has happened to you in a very long time.<\/p>\n<p>Reading out a script while maintaining the same tonality and expression will make your presentation boring. You need to add a personality to your call.<\/p>\n<p>Make sure that you are not sleepy. If you yawn while pitching, it&#8217;s going to end then and there. If you yourself aren&#8217;t taking your pitch with utter seriousness, how can you expect others to do that for you?<\/p>\n<p>You should be having fun while presenting your pitch.<\/p>\n<p>It is a step closer to achieving your dream. Show it like it is.<\/p>\n<h2>After The Pitch<\/h2>\n<p>Your pitch is done. You can now relax a little but you cannot forget about the prospect just yet. Most organizations take a few days to reach the final decision.<\/p>\n<p>Here&#8217;s what you should do in the meantime:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/thank-you-1024x683.jpg\" alt=\"\" width=\"802\" height=\"535\" \/><\/p>\n<h2>Send a thank-you email<\/h2>\n<p>Being polite is not taxed.<\/p>\n<p>Once the call ends, send your prospect an email, thanking them for their time.<\/p>\n<p>They found a slot for you to hear you talk about your company and deliverables, they deserve a thank-you note.<\/p>\n<p>You can share how grateful you are for their time. Tell them that you really appreciate their honest feedback and would take it seriously.<\/p>\n<p>You can also attach your presentation and supplement material that will help in their decision-making process.<\/p>\n<p>This simple gesture has the capability to help you outshine others in the crowd.<\/p>\n<h2>Send a follow-up email after a few days<\/h2>\n<p>Wait till the time is right.<\/p>\n<p>I understand that it can get a little difficult to not keep following up with the prospect. However, the more you nag them, the more irritated they can get.<\/p>\n<p>The best thing would be to get a tentative date before ending the pitch itself. Ask them how many days would they need to get back. If they themselves don&#8217;t, you can follow up after the day that they were supposed to send their response.<\/p>\n<p>If you haven&#8217;t done that, wait for a week. On the eighth day, send them a simple, well-crafted email, asking them if they have made the decision yet.<\/p>\n<p>You want to sound professional, not desperate.<\/p>\n<h2>Conclusion<\/h2>\n<p>Virtual pitches are a little tricky. But with the right practices in place, you&#8217;ll be fine.<\/p>\n<p>Make sure you prep well for the call. Punctuality is the key. Get on the call a few minutes earlier. Dress the way and sit in such a chair that you would have had you been in your office. It&#8217;ll keep the professionalism alive.<\/p>\n<p>Practice ensuring that you are confident at all times. If you don&#8217;t practice and hesitate in between your pitch, it&#8217;ll show a lack of seriousness.<\/p>\n<p>Lastly, don&#8217;t forget this one thing &#8211; have fun! Don&#8217;t be uptight. Your prospect is human too. They&#8217;ve been where you are right now and they understand. So, just relax and have a conversation.<\/p>\n<h2>Author&#8217;s Bio<\/h2>\n<p><a href=\"https:\/\/www.linkedin.com\/in\/vaibhav-kakkar-494b0b3\/\" target=\"_blank\" rel=\"noopener noreferrer\">Vaibhav Kakkar<\/a> is the Founder and CEO of  <a href=\"https:\/\/www.digitalwebsolutions.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Digital Web Solutions<\/a>, a globally trusted agency with a full suite of digital marketing services and development solutions. Vaibhav believes in building systems over services, and has helped scale up agencies from scratch to niche-leaders with million dollar turnovers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The corporate world altered when the pandemic hit us. Businesses adopted virtual operations to continue working remotely. Thanks to technological innovations, our generation had all the gears to weather the storm. Now, with more individuals getting vaccinated, the governments have started lifting business restrictions. Companies like Microsoft are slowly adopting a “hybrid workplace culture” where [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[174,173],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Guide To Nailing A Virtual Pitch: The Before, During, And After - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Guide To Nailing A Virtual Pitch: The Before, During, And After - Jarvee\" \/>\n<meta property=\"og:description\" content=\"The corporate world altered when the pandemic hit us. Businesses adopted virtual operations to continue working remotely. Thanks to technological innovations, our generation had all the gears to weather the storm. Now, with more individuals getting vaccinated, the governments have started lifting business restrictions. Companies like Microsoft are slowly adopting a “hybrid workplace culture” where [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2021-06-25T14:14:16+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-07-01T20:24:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/virtual-pitch-1024x640.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Contributing Guest\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/virtual-pitch.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/virtual-pitch.jpg\",\"width\":1600,\"height\":1000},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#webpage\",\"url\":\"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/\",\"name\":\"Guide To Nailing A Virtual Pitch: The Before, During, And After - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#primaryimage\"},\"datePublished\":\"2021-06-25T14:14:16+00:00\",\"dateModified\":\"2021-07-01T20:24:24+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Guide To Nailing A Virtual Pitch: The Before, During, And After\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\",\"name\":\"Contributing Guest\",\"description\":\"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \\\"guest posting\\\" guidelines link.\",\"sameAs\":[\"https:\/\/jarvee.com\"],\"url\":\"https:\/\/jarvee.com\/author\/contributor\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Guide To Nailing A Virtual Pitch: The Before, During, And After - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/","og_locale":"en_US","og_type":"article","og_title":"Guide To Nailing A Virtual Pitch: The Before, During, And After - Jarvee","og_description":"The corporate world altered when the pandemic hit us. Businesses adopted virtual operations to continue working remotely. Thanks to technological innovations, our generation had all the gears to weather the storm. Now, with more individuals getting vaccinated, the governments have started lifting business restrictions. Companies like Microsoft are slowly adopting a “hybrid workplace culture” where [&hellip;]","og_url":"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/","og_site_name":"Jarvee","article_published_time":"2021-06-25T14:14:16+00:00","article_modified_time":"2021-07-01T20:24:24+00:00","og_image":[{"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/virtual-pitch-1024x640.jpg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Contributing Guest","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/virtual-pitch.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/06\/virtual-pitch.jpg","width":1600,"height":1000},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#webpage","url":"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/","name":"Guide To Nailing A Virtual Pitch: The Before, During, And After - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#primaryimage"},"datePublished":"2021-06-25T14:14:16+00:00","dateModified":"2021-07-01T20:24:24+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/guide-to-nailing-a-virtual-pitch-the-before-during-and-after\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Guide To Nailing A Virtual Pitch: The Before, During, And After"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07","name":"Contributing Guest","description":"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \"guest posting\" guidelines link.","sameAs":["https:\/\/jarvee.com"],"url":"https:\/\/jarvee.com\/author\/contributor\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9305"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=9305"}],"version-history":[{"count":6,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9305\/revisions"}],"predecessor-version":[{"id":9314,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9305\/revisions\/9314"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=9305"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=9305"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=9305"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}