{"id":9622,"date":"2021-08-06T11:24:23","date_gmt":"2021-08-06T11:24:23","guid":{"rendered":"https:\/\/jarvee.com\/?p=9622"},"modified":"2021-11-01T01:45:22","modified_gmt":"2021-11-01T01:45:22","slug":"the-ultimate-video-length-guide-for-social-media","status":"publish","type":"post","link":"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/","title":{"rendered":"The Ultimate Video Length Guide For Social Media"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9629\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png.png\" alt=\"\" width=\"624\" height=\"347\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png-300x167.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png-600x334.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><\/p>\n<p><strong>Click the <img class=\"emoji\" role=\"img\" draggable=\"false\" src=\"https:\/\/s.w.org\/images\/core\/emoji\/13.0.1\/svg\/25b6.svg\" alt=\"&#x25b6;\" \/> button and start listening to this article.<\/strong><\/p>\n<!--[if lt IE 9]><script>document.createElement('audio');<\/script><![endif]-->\n<audio class=\"wp-audio-shortcode\" id=\"audio-9622-1\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio\/mpeg\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media.mp3?_=1\" \/><a href=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media.mp3\">https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media.mp3<\/a><\/audio>\n<p>The most important thing in social media content is simply to do it, but how can you maximize the impact of the content you produce?  The best measure of the impact your social media contact has on your network is user engagement.<\/p>\n<p>Internet marketers generally measure user engagement in the number of:<\/p>\n<ul>\n<li>Likes<\/li>\n<li>Comments<\/li>\n<li>Shares<\/li>\n<li>Downloads<\/li>\n<li>Other interactions users have with your content<\/li>\n<\/ul>\n<p>The more entertaining and valuable your content is, the more engagement you’ll get from your networks, and the larger your social media impact will be.<\/p>\n<p><strong>However, it’s possible to lose viewers’ interest in your content if it doesn’t fit in with other content on your network.<\/strong><\/p>\n<p>This article will talk about some of the rules, guidelines, and trends in social media videos. You’ll learn how to maximize the reach of your video content by making it accessible and optimizing it for your social media network(s).<\/p>\n<p>Finally, we’ll provide some additional resources to help you produce unique and impactful social media video content.<\/p>\n<h2>What are the rules for social media video?<\/h2>\n<p>As with most social media content, there are no hard and fast rules about making an excellent social media video. The one rule most internet marketers agree on, though, is that <em>you should be using video on your social media channels. <\/em><\/p>\n<p>Consumers say video ads are the top way they<strong> discover new brands on social media.<\/strong><\/p>\n<p><u><a href=\"https:\/\/www.wyzowl.com\/video-marketing-statistics\/\">With 86% of businesses now using video as a marketing tool<\/a><\/u>, it’s essential to keep an eye on the industry and network trends to maximize the impact of your video presence.<\/p>\n<p>Every industry, network, and subnetwork has a unique feed algorithm that causes some videos to go viral while others fall flat. Being aware of what works for your product or service in your network is vital.<\/p>\n<p><strong>As long as you’re doing video as part of your social media strategy, there are no rules for you to break and no consequences for doing things differently. <\/strong><\/p>\n<p>However, there are certain things you can do to help your social media video posts perform their best. Best practices vary from network to network, so knowing what works for your network(s) is the most important thing.<\/p>\n<p>On Facebook, you can maximize the engagement of your videos by including a description that isn’t thrifty with words &#8211; <strong>300 characters or more is best. <\/strong><\/p>\n<p>This gives the user time to get acquainted with your content and be drawn in before the video starts. Finally, to maximize your video’s impact, skip the middleman and <u><a href=\"https:\/\/www.quintly.com\/blog\/2017\/03\/facebook-video-study\">post straight to Facebook<\/a><\/u> instead of linking to a video posted somewhere else.<\/p>\n<p>Twitter, on the other hand, requires slightly different tactics to maximize engagement at the post level. Facebook users are drawn in by longer descriptions, while the Tweet that posts your video <u><a href=\"https:\/\/business.twitter.com\/en\/blog\/how-video-is-reshaping-digital-advertising.html\">should be kept short<\/a><\/u> to maximize brand and message recall.<\/p>\n<p>Remember that Twitter began as a micro-blogging platform where <em>“brevity” <\/em>was taken to the extreme, and users still favor shorter tweets.<\/p>\n<p>There are several things to consider when developing your video posts, and these guidelines are just the beginning. We will continue to discuss more specific ways to increase the impact of your video content on social media below.<\/p>\n<h2><strong>How long should videos be?<\/strong><\/h2>\n<p>Believe it or not, you can improve the reach and engagement of your video content on social media just by keeping it to the correct length.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9624\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/how-long-should-videos-be.png\" alt=\"\" width=\"624\" height=\"301\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/how-long-should-videos-be.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/how-long-should-videos-be-300x145.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/how-long-should-videos-be-600x289.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><\/p>\n<p>Again, there are no complex rules here aside from the maximum video lengths discussed below. However, for every network, there are specific trends in which videos perform better than others.<\/p>\n<p>Each network has an ideal video length to maximize viewers’ engagement with your content. The optimal video length for Facebook across pages of all sizes, for example, is <strong>between 2 and 5 minutes. <\/strong><\/p>\n<p>Pages with smaller followings may <strong>maintain engagement for up to 20 minutes,<\/strong> while larger businesses will need to keep their videos short.<\/p>\n<p>Facebook ads, however, peak in conversion rates at about 16-20 seconds in length, regardless of business size, unlike general Facebook feed videos. This means that it’s important to consider what kind of video content you’re publishing and not just how long it is.<\/p>\n<p>Above, we discussed that Twitter users are more likely to read shorter blocks of text attached to videos. They also like the videos posted to be shorter.<\/p>\n<ul>\n<li>You’ll get the best engagement from your followers and new viewers on Twitter if your video is <strong>between 20-45 seconds long. <\/strong><\/li>\n<li>TikTok videos perform best at even shorter lengths of 9 to 15 seconds, and Snapchat takes the attention span to an <u><a href=\"https:\/\/businesshelp.snapchat.com\/s\/article\/snap-ads-practices?language=en_US\">absolute minimum, recommending 3-5 seconds<\/a><\/u> of video for maximum impact.<\/li>\n<li>LinkedIn’s user base has a little more variation in the length of video they’re willing to consume, but again, it’s better to be brief here.<\/li>\n<li>Senior audiences, for example, are only willing to watch <strong>about 3 minutes of video to get the information they need<\/strong> to make a decision.<\/li>\n<li>While YouTube allows for the longest video uploads, users still engage more with shorter content of around 2 minutes.<\/li>\n<\/ul>\n<p>However, you can maximize user engagement even with longer content by knowing your network and your market.<\/p>\n<p><strong>The right kind of videos on YouTube, such as explainers, product demonstrations, and informative content, performs well at any length.<\/strong><\/p>\n<p>Again, aside from the length and size limits discussed below, there are no real rules when it comes to the length of your content. Knowing the needs of your network and your market is critical.<\/p>\n<p>Across most social media networks, it’s better to get the information in sooner rather than later before your viewers lose interest.<\/p>\n<h2><strong>What does social media video accessibility mean?<\/strong><\/h2>\n<p>Traditional videos are not automatically accessible by people with specific disabilities and audio, visual, or other impairments. You should want to make all of your content accessible to anyone who wants to consume it.<\/p>\n<p><strong> <img loading=\"lazy\" class=\"aligncenter size-full wp-image-9628\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/social-media-video-accessibility.png\" alt=\"\" width=\"624\" height=\"468\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/social-media-video-accessibility.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/social-media-video-accessibility-300x225.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/social-media-video-accessibility-600x450.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><\/strong><\/p>\n<p><strong>Taking steps to increase the accessibility of video and other social media posts can extend your reach and help your market get what they need from your business. <\/strong><\/p>\n<ul>\n<li>Adding<strong> closed captioning<\/strong> to your videos allows viewers (and screen readers) to read the message of your content rather than having to listen to it.<\/li>\n<\/ul>\n<p>This enables users with hearing and attention disabilities to engage with your content and improve access, allowing you to extend your reach. Using infographics and other <u><a href=\"https:\/\/www.vectornator.io\/blog\/visual-communication\">visual ways of conveying information<\/a><\/u> can also improve accessibility and engagement.<\/p>\n<ul>\n<li><strong>Alt text<\/strong> &#8211; alternative text that describes an image or video &#8211; also improves accessibility for visually impaired people.<\/li>\n<\/ul>\n<p>To make your content accessible to as many people as possible, you should ensure that your <u><a href=\"https:\/\/jarvee.com\/9-best-practices-for-writing-youtube-video-description\/\">videos have descriptive text added<\/a><\/u> to the captions wherever there are gaps in a video’s dialogue.<\/p>\n<p>Alt text can include facial expressions, visual descriptions of the setting, and other helpful contextual details.<\/p>\n<p>In addition to providing alt text and closed captioning, you can also supplement your video by providing viewers with a transcript of your video social media posts.<\/p>\n<p>This is easier on some platforms than others, as some networks have character limits for the text posts accompanying your videos. If this is a problem, you can provide a <u><a href=\"https:\/\/tinyurl.com\/\">shortened hyperlink<\/a><\/u> to a page with the transcript.<\/p>\n<p>Whether or not your followers have a disability that necessitates the use of captions and alt text, however, it’s still a best practice to optimize your video for viewing without sound.<\/p>\n<p>85% of all Facebook video views in 2016 <u><a href=\"https:\/\/digiday.com\/media\/silent-world-facebook-video\/\">happened with the sound off<\/a><\/u>, and many users browse Facebook with their devices on silent. Relying solely on your video’s audio can cause you to lose some viewers almost instantly, no matter how high quality your content is.<\/p>\n<p><strong>Beyond the audio in your video, it’s also important to consider the readability of your text and images. <\/strong><\/p>\n<p>The text should be legible, and colors should have sufficient contrast to be easily distinguishable from one another so that those with both audio and visual impairments can enjoy your content.<\/p>\n<p>By providing alternate ways for your users to access your content, you can improve their user experience and maximize the impact of your social media videos.<\/p>\n<h2><strong>How to optimize video for social media?<\/strong><\/h2>\n<p>If you want to give your content the best possible chance of performing well, it’s essential to consider more than just the optimal length of the video.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9626\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/optimize-video-for-social-media.png\" alt=\"\" width=\"624\" height=\"483\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/optimize-video-for-social-media.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/optimize-video-for-social-media-300x232.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/optimize-video-for-social-media-600x464.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><\/p>\n<p>There are general rules, guidelines, and trends that you should be aware of when creating your content for each network. These include formatting recommendations and other performance tips.<\/p>\n<p>Every network has different <a href=\"https:\/\/jarvee.com\/the-best-image-size-to-use-on-social-media\/\">formatting recommendations<\/a> and requirements to be aware of. Some of these are related to the viewing experience within their websites and apps and are necessary for users to view your content easily.<\/p>\n<p>Other recommendations are about viewer engagement and maybe less technical or may make use of unique native features of the app.<\/p>\n<ul>\n<li><strong>Facebook recommends<\/strong> that videos posted on its platform have H.264 compression, stereo AAC audio compression at 128kbps or higher, a fixed frame rate, and square pixels. In general, videos shot in portrait mode <strong>(9:16 aspect ratio)<\/strong> and square videos (<strong>1:1 aspect ratio)<\/strong> perform better than videos in landscape mode on this platform.<\/li>\n<li><strong>Instagram automatically compresses photos and videos<\/strong> when you upload them, which saves most users time but can be problematic for some videos. If you want to process your own Instagram videos, they recommend a frame rate of <em>30 FPS.<\/em> Videos can be square, portrait, or landscape, but square videos perform best across the board.<\/li>\n<li><strong>Snapchat recommends<\/strong> you should aim to keep the top margins of your video clear of graphics, logos, or other distracting details that could overlap with your user information.<\/li>\n<li><strong>LinkedIn recommends<\/strong> businesses post portrait-mode videos whenever landscape isn’t necessary, as users would rather not have to rotate their phones. The same is true for Snapchat and TikTok, which are almost exclusively mobile-based platforms.<\/li>\n<li><strong>YouTube’s unique platform allows you to create a digital library of content.<\/strong> <a href=\"https:\/\/jarvee.com\/9-best-practices-for-writing-youtube-video-description\/\">You can maximize engagement<\/a> by creating multiple playlists that categorize your videos in different ways. This way, users will logically flow from one video to the next relevant piece of content.<\/li>\n<\/ul>\n<p>As you can tell from various guidelines and recommendations from each social network’s platform, you must know the formats and limits for your preferred networks.<\/p>\n<p>Trying to post the same type of video to each network will give you weak results on most. Try to be strategic with the types of videos you post and where.<\/p>\n<h2><strong>Length limits for every social media network in 2021<\/strong><\/h2>\n<p>Every social media network has different limits in terms of length and size. The maximum video length and size for each of the most popular social networks are listed below.<\/p>\n<h3><strong>1. Facebook<\/strong><\/h3>\n<p>Facebook allows users to post videos from <strong>1 second to 240 minutes long,<\/strong> so long as they come in under the network’s maximum file size of <strong>4 GB.<\/strong><\/p>\n<h3><strong>2. LinkedIn<\/strong><\/h3>\n<p>LinkedIn allows users to post videos from <strong>3 seconds to 10 minutes long,<\/strong> so long as they come in under the network’s maximum <strong>file size of 5 GB.<\/strong><\/p>\n<h3><strong>3. Instagram<\/strong><\/h3>\n<ul>\n<li><u><a href=\"https:\/\/blog.kdanmobile.com\/instagram-video-length\">Instagram video length<\/a><\/u> allows users to post feed videos from <strong>3 seconds to 60 seconds<\/strong> long, so long as they come in under 650 MB, including <u><a href=\"https:\/\/jarvee.com\/how-to-use-instagram-reels-to-increase-your-followers\/\">reels<\/a><\/u>.<\/li>\n<li>Videos on IGTV can be between <strong>15 seconds and 10 minutes long,<\/strong> though accounts with over 10,000 followers can post videos of up to 60 minutes.<\/li>\n<li>Videos on IGTV must be<strong> less than 3.6 GB<\/strong>.<\/li>\n<\/ul>\n<h3><strong>4. Snapchat<\/strong><\/h3>\n<p>Snapchat allows users to record videos up to <strong>10 seconds long,<\/strong> combining up to <strong>6 clips for up to 60 seconds<\/strong> of sequential video.<\/p>\n<h3><strong>5. TikTok<\/strong><\/h3>\n<p>TikTok initially only allowed users to record <strong>15 and 60-second video clips<\/strong> but has recently extended that length to up to <strong>3 minutes for some creators.<\/strong><\/p>\n<h3><strong>6. YouTube<\/strong><\/h3>\n<p>All YouTube users can upload videos <strong>up to 15 minutes long.<\/strong> Users with verified Google accounts can upload videos of up to<strong> 256 GB or 12 hours, <\/strong>whichever is less.<\/p>\n<h2><strong>What are the best video types?<\/strong><\/h2>\n<p>Live-streamed video on Facebook generates <u><a href=\"https:\/\/www.socialinsider.io\/blog\/facebook-video-study\/#4\">double the engagement rate<\/a><\/u> of pre-recorded videos, with even better engagement for live streams over an hour long. Fun, informative videos perform best and should begin with appealing visuals to draw users scrolling on mute.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9623\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/best-video-types.png\" alt=\"\" width=\"624\" height=\"420\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/best-video-types.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/best-video-types-300x202.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/best-video-types-600x404.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>User-generated videos receive nearly <u><a href=\"https:\/\/econsultancy.com\/driving-recovery-and-growth-through-the-power-of-user-generated-content\/\">10x as many views<\/a><\/u> on YouTube as content produced by the businesses themselves and keep users on the site for longer. On Instagram, stories shot on mobile <u><a href=\"https:\/\/www.instagram.com\/p\/CI3VvamDUVV\/?utm_source=ig_web_copy_link\">usually outperform professionally recorded ads<\/a><\/u>.<\/p>\n<p>This trend is relatively consistent across all platforms, which means that a lower resource investment often generates a higher engagement rate.<\/p>\n<p>On Instagram, users engage most often with time-lapse and back-and-forth looping videos. YouTube’s platform accommodates longer, <u><a href=\"https:\/\/www.twogiraffes.com.au\/blog-post\/content_ecosystems\/\">more in-depth content<\/a><\/u> such as demonstration videos, tutorials, and vlogs.<\/p>\n<p><strong>You can post teaser videos on Twitter that link to longer-form content on other platforms for added reach.<\/strong><\/p>\n<p>The Snapchat videos that perform best are those that mimic user content. Using the platform’s camera, filters, and other built-in features <em>(or features that mimic them)<\/em> can keep your users watching for longer.<\/p>\n<p>As a general rule of thumb, try to remember that users are drawn to a social media platform because of the features of that network.<\/p>\n<p>Therefore, taking advantage of those features <em>(live streaming, video editing, etc.) <\/em>will help you maximize the impact of the content you post on those networks.<\/p>\n<h3>Summing up<\/h3>\n<p>When creating video content for social media, there are a lot of ways you can tailor your content to maximize the value you provide to your viewers and the engagement you receive from them.<\/p>\n<p>A straightforward way of improving your content’s performance is by editing it to fit within the optimal time range for the networks you use.<\/p>\n<p><strong>Users of each network have different attention spans, and tailoring your content to their preferences makes a big difference.<\/strong><\/p>\n<p>There’s more to maximizing your reach than simply keeping your videos within a specific time frame, however. Each social media network has unique features that attract users to it and making use of these features can <u><a href=\"https:\/\/sproutsocial.com\/insights\/social-media-video-resources\/\">help your content perform better<\/a><\/u>.<\/p>\n<p><strong>If you understand your social media network well, you can create better-performing content.<\/strong><\/p>\n<p>When creating video content for social media, the most important thing to do is just to do it. Videos draw more engagement from users than text or photo posts and are a great way to quickly convey your brand’s message and personality.<\/p>\n<p>You can refine your impact by knowing your network’s video marketing and <u><a href=\"https:\/\/jarvee.com\/the-most-essential-social-media-trends-to-know-for-2021\/\">social media trends<\/a><\/u> and the things that attract your network’s users.<\/p>\n<h3>About the Author:<\/h3>\n<p><img loading=\"lazy\" class=\"alignleft wp-image-9625\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/Luke-Fitzpatrick.png\" alt=\"\" width=\"120\" height=\"120\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/Luke-Fitzpatrick.png 335w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/Luke-Fitzpatrick-300x300.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/Luke-Fitzpatrick-150x150.png 150w\" sizes=\"(max-width: 120px) 100vw, 120px\" \/><\/p>\n<p>Luke Fitzpatrick has been published in a variety of publications such as Forbes, Tech In Asia, and The Next Web. He is also a guest lecturer at the University of Sydney, lecturing in cross-cultural management and the pre-MBA program.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Click the  button and start listening to this article. The most important thing in social media content is simply to do it, but how can you maximize the impact of the content you produce?  The best measure of the impact your social media contact has on your network is user engagement. Internet marketers generally measure user [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":9629,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[64,170,23],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Ultimate Video Length Guide For Social Media - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Ultimate Video Length Guide For Social Media - Jarvee\" \/>\n<meta property=\"og:description\" content=\"Click the  button and start listening to this article. The most important thing in social media content is simply to do it, but how can you maximize the impact of the content you produce?  The best measure of the impact your social media contact has on your network is user engagement. Internet marketers generally measure user [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2021-08-06T11:24:23+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-11-01T01:45:22+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png.png\" \/>\n\t<meta property=\"og:image:width\" content=\"624\" \/>\n\t<meta property=\"og:image:height\" content=\"347\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Contributing Guest\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png.png\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png.png\",\"width\":624,\"height\":347},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#webpage\",\"url\":\"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/\",\"name\":\"The Ultimate Video Length Guide For Social Media - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#primaryimage\"},\"datePublished\":\"2021-08-06T11:24:23+00:00\",\"dateModified\":\"2021-11-01T01:45:22+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Ultimate Video Length Guide For Social Media\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\",\"name\":\"Contributing Guest\",\"description\":\"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \\\"guest posting\\\" guidelines link.\",\"sameAs\":[\"https:\/\/jarvee.com\"],\"url\":\"https:\/\/jarvee.com\/author\/contributor\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Ultimate Video Length Guide For Social Media - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/","og_locale":"en_US","og_type":"article","og_title":"The Ultimate Video Length Guide For Social Media - Jarvee","og_description":"Click the  button and start listening to this article. The most important thing in social media content is simply to do it, but how can you maximize the impact of the content you produce?  The best measure of the impact your social media contact has on your network is user engagement. Internet marketers generally measure user [&hellip;]","og_url":"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/","og_site_name":"Jarvee","article_published_time":"2021-08-06T11:24:23+00:00","article_modified_time":"2021-11-01T01:45:22+00:00","og_image":[{"width":624,"height":347,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png.png","type":"image\/png"}],"twitter_card":"summary","twitter_misc":{"Written by":"Contributing Guest","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png.png","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/08\/The-Ultimate-Video-Length-Guide-For-Social-Media-png.png","width":624,"height":347},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#webpage","url":"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/","name":"The Ultimate Video Length Guide For Social Media - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#primaryimage"},"datePublished":"2021-08-06T11:24:23+00:00","dateModified":"2021-11-01T01:45:22+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/the-ultimate-video-length-guide-for-social-media\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"The Ultimate Video Length Guide For Social Media"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07","name":"Contributing Guest","description":"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \"guest posting\" guidelines link.","sameAs":["https:\/\/jarvee.com"],"url":"https:\/\/jarvee.com\/author\/contributor\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9622"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=9622"}],"version-history":[{"count":5,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9622\/revisions"}],"predecessor-version":[{"id":10485,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9622\/revisions\/10485"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/9629"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=9622"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=9622"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=9622"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}