{"id":9903,"date":"2021-08-27T09:36:32","date_gmt":"2021-08-27T09:36:32","guid":{"rendered":"https:\/\/jarvee.com\/?p=9903"},"modified":"2021-08-27T09:42:33","modified_gmt":"2021-08-27T09:42:33","slug":"15-crucial-metrics-to-measure-your-seo-success","status":"publish","type":"post","link":"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/","title":{"rendered":"15 Crucial Metrics to Measure Your SEO Success"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9907\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success.jpg\" alt=\"\" width=\"640\" height=\"393\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success.jpg 640w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success-300x184.jpg 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success-600x368.jpg 600w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<p>SEO is the evergreen buzzword of the online world. Even a new kid on the block knows that optimization is the recipe for SEO success. But how do you continuously optimize your site without knowing your flaws?<\/p>\n<p>You can do it by tracking certain SEO metrics and re-optimizing them. Yes, let&#8217;s call it Optimization within Optimization. After all, isn&#8217;t that the name of the game, guys?<\/p>\n<p>Here, we talk about the 15 KPIs you should monitor, measure, and modernize to become the King of the SEO Jungle.<\/p>\n<h3>1. Organic Traffic<\/h3>\n<p>The visits you get from search engines such as Google is organic traffic. Often, <a href=\"https:\/\/jarvee.com\/how-to-boost-website-organic-traffic-and-drive-more-revenue\/\">organic traffic is a result of Brand Awareness<\/a>. This Key Performance Indicator (KPI) is crucial from a Search Engine Optimizer&#8217;s point of view, as displaying your website to the right audience is one of the toughest tasks in the SEO world.<\/p>\n<p>The ideal way to track this metric is using the Google Analytics tool. First, log in to your Google Analytics dashboard. Select the Overview option under the Audience tab. Click &#8216;Add Segment&#8217; and select the &#8216;Organic Traffic&#8217; option, and voila!<\/p>\n<h3>2. Bounce Rate<\/h3>\n<p>Bounce Rate is the percentage of visitors who leave your website after viewing only one page. Generally speaking, the lower the Bounce Rate is, the better your website SEO.<\/p>\n<p>If your bounce rate is anywhere between 40-60%, you are good to go. However, if the rate exceeds the 60%-mark, you may have to rework your SEO game. Bounce rate tells you that your page may not be highly relevant to the concerned query since the users exit your site without performing any action or whatsoever.<\/p>\n<p>Google Analytics calculates Bounce Rate by dividing the number of non-interactive sessions by the total number of sessions.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9908\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/Bounce-rate.png\" alt=\"\" width=\"485\" height=\"322\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/Bounce-rate.png 485w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/Bounce-rate-300x199.png 300w\" sizes=\"(max-width: 485px) 100vw, 485px\" \/><\/p>\n<h3>3. Page Load Speed<\/h3>\n<p>Perhaps the most destructive factor to your site SEO is slow Page Load Time.<\/p>\n<p>Slow Page Load Time affects almost all metrics that contribute to a successful SEO.<\/p>\n<p>Your Page Load Speed correlates with the Bounce Rate more than anything. The longer the time your page takes to load, the higher your bounce rate will be. If your site&#8217;s pages take more than 2 seconds to load, it is time to analyze and fix the issue.<\/p>\n<p>You may have an awesome product line. But if your pages take &#8216;forever&#8217; to load, it will hurt your conversions badly unless you are an Apple-like company.<\/p>\n<h3>4. Dwelling Time<\/h3>\n<p>People often get confused between Dwelling Time and Bounce Rate. Dwelling Time is the amount of time a user spends on your site before heading back to the Search Engine Result Page. In contrast, Bounce Rate is the percentage of single-page sessions. Whether they return to the SERPs or close the browser, it does not matter.<\/p>\n<p>Now, why does Dwelling Time matter? Dwelling Time signals search engines that the content is beneficial for the users.<\/p>\n<p>On the face of it, Dwelling Time is not a ranking factor for Google. However, leading search engines remain tightlipped for a long time about the weight of Dwelling Time in deciding the success of SEO.<\/p>\n<p>The closest reference to the significance of Dwelling Time is Nick Frost&#8217;s (Head of Google Brain) speech at a 2017 conference. His speech hinted at Google&#8217;s consideration of Dwelling Time for rankings.<\/p>\n<h3>5. Scroll Depth<\/h3>\n<p>Deciding on the quality of your traffic is one of the crucial tasks in SEO. Scroll Depth analysis is a metric that tells you how engaged your users are with your content.<\/p>\n<p>Scroll Depth analysis is akin to watching a user&#8217;s browsing behavior by sitting next to them. This metric is so helpful in finding how much of a page has been viewed by a user.<\/p>\n<p>The deeper users go, the more engaged they are. This metric works very well for blog posts. Though one can do vertical and horizontal scroll depth analysis, the former is more common and pragmatic. You can track this metric via Google Tag Manager.<\/p>\n<h3>6. Returning Visitors<\/h3>\n<p>This KPI comes in handy in determining how good you are in retaining the audience. You can group your audience based on their number of visits, i.e., Group 1 (2-5 visits), Group 2 (5-10 visits), Group 3 (more than ten visits).<\/p>\n<p>Now, for Google, if a person revisits a site within two years, they are a returning visitor. Having a good number of Returning Visitors is a sign that you have a loyal following.<\/p>\n<p>The more your audience becomes loyal to you, the higher the chances for them to talk about you on public forums, social media, etc.<\/p>\n<p>Click the Behavior option under the &#8216;Audience&#8217; on your Google Analytics tool to track this KPI. Then click on the &#8216;New vs. Returning&#8217; option. A table will appear with all the necessary details.<\/p>\n<h3>7. Keyword Difficulty<\/h3>\n<p>This metric is to find the competitiveness of your keywords. Please bear in mind that the Google Keyword Planner&#8217;s &#8216;Competition&#8217; feature has nothing to do with Keyword Difficulty. If a specific keyword is bruised and battered, it will be an arduous task for you to rank high for that word.<\/p>\n<p>This KPI is essential to find out the best keywords for your SEO strategy. The metric will help you narrow down the less competitive keywords but have a high search volume.<\/p>\n<p>There are various tools out there to determine the difficulty of keywords. Some of them are free. Ahrefs is one such tool. The tool measures Keyword Difficulty on a scale from 0-100. It will also tell you how many backlinks you will need to rank among the top 10.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9910\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/keyword-difficulty.png\" alt=\"\" width=\"624\" height=\"152\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/keyword-difficulty.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/keyword-difficulty-300x73.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/keyword-difficulty-600x146.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><\/p>\n<h3>8. Click-through Rate<\/h3>\n<p>In a nutshell, this metric is to find the effectiveness of your listings. By measuring how often your listings get clicked by users, one can find the click-through rate (CTR) of a campaign.<\/p>\n<p>For example, if your campaign garners 500 clicks from 5,000 impressions, 10% is your CTR.<\/p>\n<p>CTR remains a key ranking factor for search engines as it tells them that the links effectively address users&#8217; queries. If your links do not generate a handsome number of clicks, search engines will conclude that they do not cater to users&#8217; needs. Hence, it will pull you down the rank ladder.<\/p>\n<h3>9. Session Duration<\/h3>\n<p>Session Duration is the total time a visitor spends on your site during a particular visit. This includes visits to multiple pages within your site.<\/p>\n<p>You can easily track this KPI on your Google Analytics tool. This metric is critical as it identifies the prospects who have the potential to become your customers\/clients. Because the more you make your users stay on your site, the more they are likely to buy your products or services.<\/p>\n<p>Poor Session Duration is a clear sign that you need to up your content strategy. At times, low session duration is an aftereffect of bad keyword optimization. Ensure your site does not get ranked for wrong keywords.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9912\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/session-duration.png\" alt=\"\" width=\"624\" height=\"315\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/session-duration.png 624w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/session-duration-300x151.png 300w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/session-duration-600x303.png 600w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><\/p>\n<h3>10. Top Exit Pages<\/h3>\n<p>As the name suggests, the last pages searchers visit before exiting your site are the Top Exit Pages. Identifying the pages that cause your visitors to run away is vital to optimizing your SEO strategy.<\/p>\n<p>This metric will show you how good is your content strategy. Pay attention to the pages where your visitors drift away. Now, those pages are the ones that shout for help.<\/p>\n<p>Put yourself in the shoes of your visitors and wade through the Top Exit Pages. Find out why the pages are not appealing to you. Make relevant changes and check whether the audience behaves the same with those pages. Rinse and repeat until improvements start popping up.<\/p>\n<h3>11.  Backlinks<\/h3>\n<p>Within this KPI, there are several factors that you should consider. To start with, pay attention to the total number of backlinks you have. Having a high number of backlinks from relevant websites tells search engines that yours is indeed a good site. Remember: When it comes to backlinks, put quality before quantity.<\/p>\n<p>Next comes the number of domains that refer to your site. It would be best if you also hunt down the toxic and broken links. While broken links meddle with your users&#8217; browsing experience, the former will make Google brand you as A Bad Egg.<\/p>\n<h3>12. Mobile Usability Report<\/h3>\n<p>Embrace mobile or fail. Yes, you read it right. It is no secret that mobile traffic has surpassed desktop traffic. According to <a href=\"http:\/\/perficient.com\/insights\/research-hub\/mobile-vs-desktop-usage\">Perficient<\/a>, mobile phones account for 61% of visits to US websites in 2020. In 2019, the number stood at 57%.<\/p>\n<p>Hence it is prudent to pay keen attention to how your audience interacts with your mobile site. Go to the Mobile Usability option under the Enhancements tab in your Google Search Console dashboard.<\/p>\n<p>Google will tell you where your site excels and where it draws a blank. For example, if certain text is too small for the eyes, the console will tell you the number of pages with the problem.<\/p>\n<p>It will also flag other common issues such as &#8216;Content wider than the screen&#8217; and &#8216;Clickable elements too close together.&#8217;<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9911\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/mobile-usability-report.png\" alt=\"\" width=\"519\" height=\"356\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/mobile-usability-report.png 519w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/mobile-usability-report-300x206.png 300w\" sizes=\"(max-width: 519px) 100vw, 519px\" \/><\/p>\n<h3>13. Top-viewed Posts<\/h3>\n<p>Knowing what resonates with your audience is a must to stay relevant in the SEO game.<\/p>\n<p>Frankly speaking, no one knows for sure what makes the audience stay glued to a site. Maybe the type of content bonds the audience, or perhaps the eye-catching infographics format that makes them invested.<\/p>\n<p>If you identify the posts that make your audience hooked, you can mimic the content and get more eyeballs on your site.<\/p>\n<p>This metric will also show you the blog posts that fail to garner your audience&#8217;s attention. Keeping an eye on this KPI will help you optimize your SEO campaign. One of the commonly used tools to find the Top-viewed content is Google Analytics.<\/p>\n<h3>14. Featured Snippets<\/h3>\n<p>Want more conversions? Want a high CTR? Want more brand awareness? Want to build credibility? Want to stand out among the crowd? The answer is Featured Snippets.<\/p>\n<p>Featured snippets take a massive real-estate, especially on mobile phone screens, and thus garner high CTR.<\/p>\n<p>Here is a piece of data to sound the importance of Featured Snippets. Around <a href=\"https:\/\/searchengineland.com\/zero-click-google-searches-rose-to-nearly-65-in-2020-347115\">65%<\/a> of searches made in Google ended without a click. A sizeable percentage of this figure can be attributed to Featured Snippets.<\/p>\n<p>Experts fume that the reason for the rise in zero-click searches is the click-cannibalization methods adopted by Google. Zero-click searches mainly occur as users&#8217; queries get addressed right on the results page.<\/p>\n<p>There are tools like SEMrush to identify which search queries result in featured snippets. Google Search Console is a free tool to track Featured Snippets.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9909\" src=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/featured-snippets.png\" alt=\"\" width=\"441\" height=\"358\" srcset=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/featured-snippets.png 441w, https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/featured-snippets-300x244.png 300w\" sizes=\"(max-width: 441px) 100vw, 441px\" \/><\/p>\n<h3>15. Cost-per-click (CPC)<\/h3>\n<p>This metric is for those who prefer paid marketing services. Knowing how much you are paying for each click your ad gets is crucial. If the CPC is low, your ad campaign is on point. If it is high, there is no point in continuing the campaign.<\/p>\n<p>Now, CPC works differently for different industries. For Legal entities, the <a href=\"https:\/\/www.wordstream.com\/blog\/ws\/2017\/07\/05\/online-advertising-costs\">average CPC is $5.88<\/a>. In contrast, the average CPC for Dating Services Industry is $0.19.<\/p>\n<p>Tracking CPC helps you stay within your budget. The metric gives you optimum control over your advertising budget.<\/p>\n<h3>About the Author<\/h3>\n<p>Joseph Schneider is the Director of Marketing at <a href=\"https:\/\/www.haitna.com\/seo-services\/\">Haitna<\/a>. He is passionate about writing content related to search engine optimization, social media marketing, and influencer marketing with the hope to make a difference and contribute to their business growth<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>SEO is the evergreen buzzword of the online world. Even a new kid on the block knows that optimization is the recipe for SEO success. But how do you continuously optimize your site without knowing your flaws? You can do it by tracking certain SEO metrics and re-optimizing them. Yes, let&#8217;s call it Optimization within [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":9907,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"categories":[64,170,172,1],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>15 Crucial Metrics to Measure Your SEO Success - Jarvee<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"15 Crucial Metrics to Measure Your SEO Success - Jarvee\" \/>\n<meta property=\"og:description\" content=\"SEO is the evergreen buzzword of the online world. Even a new kid on the block knows that optimization is the recipe for SEO success. But how do you continuously optimize your site without knowing your flaws? You can do it by tracking certain SEO metrics and re-optimizing them. Yes, let&#8217;s call it Optimization within [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:published_time\" content=\"2021-08-27T09:36:32+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-27T09:42:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"640\" \/>\n\t<meta property=\"og:image:height\" content=\"393\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Contributing Guest\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success.jpg\",\"contentUrl\":\"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success.jpg\",\"width\":640,\"height\":393},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#webpage\",\"url\":\"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/\",\"name\":\"15 Crucial Metrics to Measure Your SEO Success - Jarvee\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#primaryimage\"},\"datePublished\":\"2021-08-27T09:36:32+00:00\",\"dateModified\":\"2021-08-27T09:42:33+00:00\",\"author\":{\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\"},\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"15 Crucial Metrics to Measure Your SEO Success\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07\",\"name\":\"Contributing Guest\",\"description\":\"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \\\"guest posting\\\" guidelines link.\",\"sameAs\":[\"https:\/\/jarvee.com\"],\"url\":\"https:\/\/jarvee.com\/author\/contributor\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"15 Crucial Metrics to Measure Your SEO Success - Jarvee","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/","og_locale":"en_US","og_type":"article","og_title":"15 Crucial Metrics to Measure Your SEO Success - Jarvee","og_description":"SEO is the evergreen buzzword of the online world. Even a new kid on the block knows that optimization is the recipe for SEO success. But how do you continuously optimize your site without knowing your flaws? You can do it by tracking certain SEO metrics and re-optimizing them. Yes, let&#8217;s call it Optimization within [&hellip;]","og_url":"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/","og_site_name":"Jarvee","article_published_time":"2021-08-27T09:36:32+00:00","article_modified_time":"2021-08-27T09:42:33+00:00","og_image":[{"width":640,"height":393,"url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success.jpg","type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Contributing Guest","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#primaryimage","inLanguage":"en-US","url":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success.jpg","contentUrl":"https:\/\/jarvee.com\/wp-content\/uploads\/2021\/02\/15-Crucial-Metrics-to-Measure-Your-SEO-Success.jpg","width":640,"height":393},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#webpage","url":"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/","name":"15 Crucial Metrics to Measure Your SEO Success - Jarvee","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#primaryimage"},"datePublished":"2021-08-27T09:36:32+00:00","dateModified":"2021-08-27T09:42:33+00:00","author":{"@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07"},"breadcrumb":{"@id":"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/15-crucial-metrics-to-measure-your-seo-success\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"15 Crucial Metrics to Measure Your SEO Success"}]},{"@type":"Person","@id":"https:\/\/jarvee.com\/#\/schema\/person\/eb9fcfb71fd503f60a9f94c83056cc07","name":"Contributing Guest","description":"This is a placeholder author for all the guest posts on Jarvee, guests contributing with an article will all be under the same author - this one. If you think you have something to share with everybody see the full gust posting rules -&gt; just scroll to the bottom of the page and click on the \"guest posting\" guidelines link.","sameAs":["https:\/\/jarvee.com"],"url":"https:\/\/jarvee.com\/author\/contributor\/"}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9903"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=9903"}],"version-history":[{"count":4,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9903\/revisions"}],"predecessor-version":[{"id":9915,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/posts\/9903\/revisions\/9915"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media\/9907"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=9903"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/categories?post=9903"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/tags?post=9903"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}