{"id":202,"date":"2017-07-07T22:16:44","date_gmt":"2017-07-07T22:16:44","guid":{"rendered":"http:\/\/jarvee.com\/?page_id=202"},"modified":"2021-05-31T10:36:33","modified_gmt":"2021-05-31T10:36:33","slug":"terms-of-service","status":"publish","type":"page","link":"https:\/\/jarvee.com\/terms-of-service\/","title":{"rendered":"Terms of Service"},"content":{"rendered":"<p>BY SELECTING “I ACCEPT”, “I AGREE”, “OK”, “CONTINUE”, “YES” OR BY INSTALLING OR USING THE SOFTWARE IN ANY WAY, YOU ARE INDICATING YOUR COMPLETE UNDERSTANDING AND ACCEPTANCE OF THE TERMS OF THIS AGREEMENT.<\/p>\n<p>IF YOU DO NOT AGREE TO THESE TERMS AND CONDITIONS DO NOT INSTALL OR ACCESS THE SOFTWARE OR OTHERWISE INDICATE REFUSAL, MAKE NO FURTHER USE OF THE SOFTWARE<\/p>\n<p>By using the jarvee.com web site (“Service” or “Software” owned by ABC E-Commerce Services) you are agreeing to be bound by the following terms and conditions (“Terms of Service”).<\/p>\n<p>We reserves the right to update and change the Terms of Service from time to time without notice. Any new features that augment or enhance the current Service, including the release of new tools and resources, shall be subject to the Terms of Service. Continued use of the Software after any such changes shall constitute your consent to such changes. You can review the most current version of the Terms of Service at any time at: http:\/\/jarvee.com\/ terms-of-service\/<\/p>\n<p>Violation of any of the terms below will result in the termination of your Account. You agree to use the Software at your own risk.<\/p>\n<p><strong>Account terms<\/strong><\/p>\n<p>You must be 13 years or older to use this Software. If you are less than 18 years of age, you cannot use the JARVEE Product without the consent of your parent or guardian, who agrees, on your behalf, that you will comply with the Terms of Service.<\/p>\n<p>You must be a human. Accounts registered by “bots” or other automated methods are not permitted.<\/p>\n<p>You must provide your legal full name, a valid email address, and any other information requested in order to complete the signup process.<\/p>\n<p>Your login may only be used by one person – a single login shared by multiple people is not permitted. You may create separate logins for as many people as your plan allows.<\/p>\n<p>You are responsible for maintaining the security of your account and password. We cannot and will not be liable for any loss or damage from your failure to comply with this security obligation.<\/p>\n<p>You are responsible for all Content posted and activity that occurs under your account (even when Content is posted by others who have accounts under your account).<\/p>\n<p>One person or legal entity may not maintain more than one account.<\/p>\n<p>You may not use the Software for any illegal or unauthorized purpose. You must not, in the use of the Software, violate any laws in your jurisdiction (including but not limited to copyright laws).<\/p>\n<p><strong>Payment, Refunds, Upgrading and Downgrading Terms<\/strong><\/p>\n<p>A valid credit card or PayPal account is required for paying accounts.<\/p>\n<p>The Software is billed in advance on a monthly basis and is non-refundable. There will be no refunds or credits for partial months of service, upgrade\/downgrade refunds, or refunds for months unused with an open account. In order to treat everyone equally, no exceptions will be made.<\/p>\n<p>For any upgrade or downgrade in plan level, your credit card that you provided will automatically be charged the new rate on your next billing cycle.<\/p>\n<p>Downgrading your Service may cause the loss of Content, features, or capacity of your Account. We do not accept any liability for such loss.<\/p>\n<p><strong>Beta Participation Agreement<\/strong><\/p>\n<p>Please read and agree to the following terms and conditions, if you wish to be eligible to participate in the Closed Beta Testing for any of the new features that we will add to the JARVEE Software. <\/p>\n<p>All BETA features and platforms will be clearly marked in the software with the term BETA<\/p>\n<p>By Using the BETA FEATURES (like TikTok automation features, etc.) for FREE you acknowledge that they might not work as expected. We do our best to solve all problems via our support though so please be patient.<\/p>\n<p>All BETA features are added as extra features, they are not part of our main product while in BETA. For that reason, if something marked as BETA is not working as intended you will not be eligible for a refund of the main product (Jarvee)<\/p>\n<p><strong>Cancellation and Termination<\/strong><\/p>\n<p>You are solely responsible for properly canceling your account. An email or phone request to cancel your account is not considered cancellation. You can cancel your account at any time by clicking on provided cancellation link within your account.<\/p>\n<p>If you cancel the Service before the end of your current paid up month, your cancellation will take effect immediately and you will not be charged again.<\/p>\n<p>JARVEE, in its sole discretion, has the right to suspend or terminate your account and refuse any and all current or future use of the Software, or any other JARVEE service, for any reason at any time. Such termination of the Service will result in the deactivation or deletion of your Account or your access to your Account, and the forfeiture and relinquishment of all Content in your Account. JARVEE reserves the right to refuse service to anyone for any reason at any time.<\/p>\n<p><strong>Modifications to the Service and Prices<\/strong><\/p>\n<p>JARVEE reserves the right at any time and from time to time to modify or discontinue, temporarily or permanently, the Service (or any part thereof) with or without notice.<\/p>\n<p>Prices of all Services, including but not limited to monthly subscription plan fees to the Software, are subject to change. Such notice may be provided at any time by posting the changes to the JARVEE (jarvee.com) or the Software itself.<\/p>\n<p>JARVEE shall not be liable to you or to any third party for any modification, price change, suspension or discontinuance of the Service.<\/p>\n<p><strong>SERVICES AND ACCOUNTS <\/strong><br \/>\nTo be able to use the JARVEE Product and additional Modules or Services (the “Product”, “JARVEE products and services”, “JARVEE”), to request technical support for those applications and participating in blogs and forums that we provide, You must create an Account on the JARVEE Site by submitting certain requested information, which may include individual and\/or company name, date of birth, e-mail address, physical address, credit card and other payment information. Registration requires a valid e-mail address and payment information for subscription services and other notices.<\/p>\n<p>The JARVEE Account is necessary for the activation of the Product. You need to use your login credentials – username and password – to login into our application and avail the services. However, we will never ask for your password and we will not use your credentials without your permission. JARVEE does not share your credentials with third-parties.<\/p>\n<p>You warrant that you are the legal owner of the device and you have all the legal rights to create your account.<\/p>\n<p>You must accept and allow any permissions required by the supported Social Media Platforms to use the JARVEE Product.<\/p>\n<p>You are responsible for maintaining the security of all your Social Media accounts and passwords. JARVEE cannot and will not be liable for any loss or damage from your failure to comply with this security obligation.<\/p>\n<p>You are responsible for all Content posted and activity that occurs using the JARVEE Product.<\/p>\n<p>You are responsible for any hardware or software required to use JARVEE Product.<\/p>\n<p>Please acknowledge that installing on your device the JARVEE Product, connecting your Social Media accounts to JARVEE, and taking into consideration the security policies and rules selected by you, You may experience malfunction in the posting or sharing of your content on the supported Social Media Networks: in some cases your account may be banned by the Social Networks, your content may be posted on different hours, pages or groups than those selected, some posts may be lost. JARVEE shall not be held responsible for any damages resulting from your failure to comply with the Social Networks’ terms and services or from any activity that occurs after using the JARVEE Product. JARVEE shall not be held responsible for the JARVEE Product malfunction due to Social Networking websites changes or synchronization issues. JARVEE will make the necessary updates for the JARVEE Product to function properly and will assure synchronization with due diligence for all the supported Social Media Networks.<\/p>\n<p>The JARVEE Product was created for convenience of promoting your product, brand or service via Social Media Networking Sites supported by JARVEE. We do not encourage spamming or violation of any of these Social Network user’s rights or rules set by the networks.<\/p>\n<p>JARVEE is not affiliated with any Social Networking site or any other third party sites in any way.<\/p>\n<p>The JARVEE Product offers a Social Media planner software which shall be software installed on your device (computer running Windows) that allows you to schedule Social Media posts on specified hours throughout the day and permits You to post content on Social Media pages, accounts, and groups that you administer or you are a member of and you have access to post and share content.<\/p>\n<p>The JARVEE Product may allow you to search for specific groups, to join the selected groups and share content with other members of the groups. JARVEE shall not be held responsible for the content you share on these groups and for the activity that occurs after using the JARVEE Product. You may not use the services to gain unauthorized access, to upload, transmit, and transfer data or information to JARVEE or third parties by any means. You agree that your use of these services will be in compliance with any laws which are applicable to you.<\/p>\n<p>User behavior such as liking, following or commenting on your posts or your social accounts cannot be predicted and therefore cannot be controlled. The actual number of likes or followers you get solely depends on the quality of the content you share.<\/p>\n<p>We strongly recommend that you explore the JARVEE application during the free 5 days trial before making the decision to continue using the product.<\/p>\n<p>After the Trial period ends, no refund claims will be entertained if your profile had been active and there have been no technical glitches that prevented proper usage of the application.<\/p>\n<p>The time of voluntary inactivity – if you choose to not use JARVEE for a specific period – shall not be compensated.<\/p>\n<p>This License Agreement is a legal agreement between You (either an individual or a legal person) and JARVEE for use of JARVEE’s software product identified above, which includes software and services for your device, and may include associated media, printed materials, and “online” or electronic documentation (hereafter designated as “JARVEE Product”), all of which are protected by international copyright laws and international treaties. By installing, copying or using the JARVEE Product, you agree to be bound by the terms of this Agreement.<\/p>\n<p><strong>GRANT OF LICENSE <\/strong><br \/>\nJARVEE Product is protected by copyright laws and international copyright treaties, as well as other intellectual property laws and treaties. JARVEE Product is licensed, not sold. This agreement only gives You some rights to use JARVEE Product. JARVEE reserves all other rights. Unless applicable law gives you more rights despite this limitation, You may use the JARVEE Product only as expressly permitted in this Agreement.<\/p>\n<p>You can use only one copy of the JARVEE Product on a single device. If a greater number of copies and\/or number of devices is specified within the sale transaction documentation from the authorized distributor or reseller from which You obtained the JARVEE Product (Permitted Number), You shall have the right to copy the JARVEE Product in accordance with such specifications;<\/p>\n<p>You can make one copy of the JARVEE Product for backup or archival purposes; If the JARVEE Product supports multiple platforms or languages, if you receive the JARVEE Product on multiple media, if you otherwise receive multiple copies of the JARVEE Product, or if you receive the JARVEE Product bundled with other software, the total number of your Devices on which all versions of the JARVEE Product are installed may not exceed the Permitted Number.<\/p>\n<p><strong>TRIAL LICENSE <\/strong><br \/>\nIf You are a trial user, You may use JARVEE Product for evaluation or testing purposes in a non-production environment for five (5) days from the date You created your JARVEE account and activated the product (the “Trial Period”). During the Trial Period, You are entitled to web or email based technical support and to Updates, if applicable.<\/p>\n<p>TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, JARVEE PRODUCT AND ANY SERVICES AND RELATED DOCUMENTATION USED FOR EVALUATION PURPOSES ARE PROVIDED TO YOU “AS IS” WITHOUT WARRANTIES OF ANY KIND.<\/p>\n<p>Your right to use JARVEE Product ends when the Trial Period ends or if You violate any term of this Agreement. Upon termination of the Evaluation Period, You must delete or destroy all copies of JARVEE Product and documentation and stop using the Service. Your obligations and rights under this Agreement will continue to apply after the end of the Trial Period.<\/p>\n<p><strong>TERMS OF LICENSE<\/strong><br \/>\nYou will have certain rights to use the JARVEE Product during the License Period, which shall begin on the date when you create the JARVEE account and activate the product regardless of the number of copies that You are permitted to use, and shall last for the period of time set forth in the Documentation or the applicable transaction documentation from the JARVEE distributor or reseller from which You obtained the JARVEE Product. The JARVEE Product may automatically be deactivated at the end of the License Period, and You will not be entitled to receive any feature or content updates to the JARVEE Product.<\/p>\n<p>If you have agreed to permit JARVEE to automatically renew your subscription to JARVEE Product by charging a valid credit card number or PayPal account which you have provided to JARVEE, your subscription will be automatically renewed on the expiration date and each anniversary thereafter for a fee no greater than JARVEE’s then-current price, excluding promotional and discount pricing. You must provide current, complete and accurate information for your billing account. You must promptly update all information to keep your billing account current, complete, and accurate (such as, but not limited to a change in billing address, credit card number, or credit card expiration date), and you must promptly notify JARVEE if your credit card is canceled (such as, but not limited to for loss or theft). If you fail to provide JARVEE any of the foregoing information, you agree that JARVEE may continue charging you for any subscription automatically renewed. This Agreement will terminate automatically if you fail to comply with any of the limitations or other requirements described herein. Upon any termination or expiration of this Agreement, you must cease use of JARVEE Product and destroy all copies of JARVEE and the Documentation.<\/p>\n<p><strong>UPGRADES <\/strong><br \/>\nIf JARVEE is labeled as an upgrade, you must be properly licensed to use a product identified by JARVEE as being eligible for the upgrade in order to use JARVEE Product. A JARVEE Product labeled as an upgrade replaces and\/or supplements the product that formed the basis for your eligibility for the upgrade. You may use the resulting upgraded product only in accordance with the terms of this License Agreement. If the JARVEE Product is an upgrade of a component of a package of software programs that you licensed as a single JARVEE Product may be used and transferred only as part of that single product package and may not be separated for use by more than the total number of licensed users. The terms and conditions of this license replace and supersede any previous agreements that may have existed between you and JARVEE regarding the original product or the resulting upgraded product.<\/p>\n<p><strong>COPYRIGHT <\/strong><br \/>\nAll rights, titles and interest in and to JARVEE and all copyright rights in and to JARVEE (including but not limited to any code, images, photographs, logos, animations, video, audio, music, text, and “applets” incorporated into JARVEE), the accompanying printed materials, and any copies of JARVEE are owned by JARVEE, with the understanding that rights, titles and interest in and to certain third party software identified in the accompanying Third-Party License Terms are owned by their respective owners. JARVEE is protected by copyright laws and international treaty provisions. Therefore, you must treat JARVEE like any other copyrighted material. You may not copy the printed materials accompanying JARVEE. You must produce and include all copyright notices in their original form for all copies created irrespective of the media or form in which JARVEE exists. You may not sub-license, rent, sell, lease or share the JARVEE license. You may not reverse engineer, recompile, disassemble, create derivative works, modify, translate, or make any attempt to discover the source code for JARVEE, except as and only to the extent explicitly permitted by the licensing terms, identified in the accompanying Third-Party License Terms, governing use of the third party software.<\/p>\n<p><strong>TECHNICAL SUPPORT <\/strong><br \/>\nCertain technical support features may be offered by JARVEE for the license term of the JARVEE Product and may include live chat with a technical support consultant and\/or assistance from a technical support consultant via remote access. If such features are offered and You choose to access such Technical Support it shall be governed by the following conditions: Any such Technical Support shall be provided in JARVEE’s sole discretion without any guarantee or warranty of any kind. It is solely Your responsibility to complete a backup of all Your existing data, software, and programs before receiving any Technical Support. In the course of providing the Technical Support, JARVEE may determine that the technical issue is beyond the scope of the Technical Support. JARVEE reserves the right to refuse, suspend or terminate any of the Technical Support in its sole discretion.<\/p>\n<p><strong>LIMITED WARRANTY<\/strong><br \/>\nJARVEE warrants that the media on which JARVEE is distributed is free from defects for a period of thirty days from the date of delivery of JARVEE to you. Your sole remedy for a breach of this warranty will be that JARVEE, at its option, may replace the defective media upon receipt of the damaged media, or refund the money you paid for JARVEE. JARVEE does not warrant that JARVEE will be uninterrupted or error-free or that the errors will be corrected. JARVEE does not warrant that JARVEE will meet your requirements.<\/p>\n<p>EXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, JARVEE DISCLAIMS ALL OTHER WARRANTIES, EXPRESS OR IMPLIED, WITH RESPECT TO THE JARVEE PRODUCTS, ENHANCEMENTS, MAINTENANCE OR SUPPORT RELATED THERETO, OR ANY OTHER MATERIALS (TANGIBLE OR INTANGIBLE) OR SERVICES SUPPLIED BY IT. JARVEE HEREBY EXPRESSLY DISCLAIMS ANY IMPLIED WARRANTIES AND CONDITIONS, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, LOSS OF DATA, DEVICE FAILURE OR MALFUNCTION FITNESS FOR A PARTICULAR PURPOSE, TITLE, NON-INTERFERENCE, ACCURACY OF DATA, ACCURACY OF INFORMATIONAL CONTENT, SYSTEM INTEGRATION, WHETHER ARISING BY STATUTE, LAW, COURSE OF DEALING, CUSTOM AND PRACTICE, OR TRADE USAGE. JARVEE is acting on behalf of its suppliers and marketing partners for the purpose of disclaiming, excluding and\/or limiting obligations, warranties, and liability as provided in this Agreement, but in no other respects and for no other purpose. The foregoing provisions shall be enforceable to the maximum extent permitted by applicable law.<\/p>\n<p>JARVEE shall not be held responsible for access to your information where you have provided your password to a third party or have failed to use reasonable efforts to protect such information, password, answers to challenge questions or for user error.<\/p>\n<p><strong>DISCLAIMER OF DAMAGES <\/strong><br \/>\nAnyone using, testing, or evaluating JARVEE bears all risk to the quality and performance of JARVEE. In no event shall JARVEE be liable for any damages of any kind, including, without limitation, direct or indirect damages arising out of the use, performance, or delivery of JARVEE, even if JARVEE has been advised of the existence or possibility of such damages.<\/p>\n<p>SOME STATES DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU. IN NO CASE SHALL JARVEE’S LIABILITY EXCEED THE PURCHASE PRICE PAID BY YOU FOR JARVEE. The disclaimers and limitations set forth above will apply regardless of whether you accept to use, evaluate, or test JARVEE.<\/p>\n<p>We strongly recommend that You back up Your data frequently. You shall at all times be under a duty to mitigate Your loss.<\/p>\n<p>IMPORTANT NOTICE TO USERS. THIS SOFTWARE IS NOT FAULT-TOLERANT AND IS NOT DESIGNED OR INTENDED FOR USE IN ANY HAZARDOUS ENVIRONMENT REQUIRING FAIL-SAFE PERFORMANCE OR OPERATION. THIS SOFTWARE IS NOT FOR USE IN THE OPERATION OF AIRCRAFT NAVIGATION, NUCLEAR FACILITIES, OR COMMUNICATION SYSTEMS, WEAPONS SYSTEMS, DIRECT OR INDIRECT LIFE-SUPPORT SYSTEMS, AIR TRAFFIC CONTROL, OR ANY APPLICATION OR INSTALLATION WHERE FAILURE COULD RESULT IN DEATH, SEVERE PHYSICAL INJURY OR PROPERTY DAMAGE.<\/p>\n<p><strong>CONSENT TO ELECTRONIC COMMUNICATIONS <\/strong><br \/>\nJARVEE may send you legal notices and other communications about the Software and Maintenance subscription services or our use of the information you provide us (“Communications”). JARVEE will send Communications via in-product notices or via email to the primary user’s registered email address, or will post Communications on its Sites. By accepting this Agreement, you consent to receive all Communications through these electronic means only and acknowledge and demonstrate that you can access Communications on Sites.<\/p>\n<p><strong>General Conditions<\/strong><\/p>\n<p>This Agreement will be governed by the laws of Morocco and by international copyright regulations and treaties. The exclusive jurisdiction and venue to adjudicate any dispute arising out of these License Terms shall be of the courts of Morocco. Nothing in this License Agreement will diminish any rights You may have under existing consumer protection legislation or other applicable laws in Your jurisdiction that may not be waived by contract.<\/p>\n<p>Your use of the Software is at your sole risk. The Software is provided on an “as is” and “as available” basis.<\/p>\n<p>Technical support is only provided to paying account holders and is only available via support form.<\/p>\n<p>You understand that JARVEE uses third party vendors and hosting partners to provide the necessary hardware, software, networking, storage, and related technology required to run the Software.<\/p>\n<p>You must not modify, adapt or hack the Software or modify another website so as to falsely imply that it is associated with the Software, JARVEE, or any other JARVEE service.<\/p>\n<p>You agree not to reproduce, duplicate, copy, sell, resell or exploit any portion of the Software, use of the Software, or access to the Software without the express written permission by JARVEE.<\/p>\n<p>We may, but have no obligation to, remove Content and Accounts containing Content that we determine in our sole discretion are unlawful, offensive, threatening, libelous, defamatory, pornographic, obscene or otherwise objectionable or violates any party’s intellectual property or these Terms of Service.<\/p>\n<p>Verbal, physical, written or other abuse (including threats of abuse or retribution) of any JARVEE customer, employee, member, or officer will result in immediate account termination.<\/p>\n<p>You understand that the technical processing and transmission of the Software, including your Content, may be transferred unencrypted and involve (a) transmissions over various networks; and (b) changes to conform and adapt to technical requirements of connecting networks or devices.<\/p>\n<p>JARVEE  does not warrant that (i) the Software will meet your specific requirements, (ii) the Software will be uninterrupted, timely, secure, or error-free, (iii) the results that may be obtained from the use of the Software will be accurate or reliable, (iv) the quality of any products, services, information, or other material purchased or obtained by you through the Software will meet your expectations, and (v) any errors in the Software will be corrected.<\/p>\n<p>You expressly understand and agree that JARVEE shall not be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including but not limited to, damages for loss of profits, goodwill, use, data or other intangible losses (even if JARVEE has been advised of the possibility of such damages), resulting from: (i) the use or the inability to use the Software; (ii) the cost of procurement of substitute goods and services resulting from any goods, data, information or services purchased or obtained or messages received or transactions entered into through or from the service; (iii) unauthorized access to or alteration of your transmissions or data; (iv) statements or conduct of any third party on the Software; (v) or any other matter relating to the Software.<\/p>\n<p>The failure of JARVEE to exercise or enforce any right or provision of the Terms of Service shall not constitute a waiver of such right or provision. The Terms of Service constitutes the entire agreement between you and JARVEE and govern your use of the Software, superceding any prior agreements between you and JARVEE (including, but not limited to, any prior versions of the Terms of Service).<\/p>\n<p>Questions about the Terms of Service should be sent via the <a href=\"http:\/\/jarvee.com\/contact\/\">contact form<\/a>.<\/p>\n<p>You will NOT use JARVEE for any spam, botting and harassment.<\/p>\n<p>JARVEE will not perform any spam, botting and harassment. All requests to perform any actions like this may result in blocking your account.<\/p>\n<p>We do NOT give support to anyone who wants to use our Software to perform any kind of spam or commit other crimes.<\/p>\n<p>It is your sole responsibility to comply with each social platform’s rules and any legislation that you are subject to. You use JARVEE at your own risk.<\/p>\n<p>We are not responsible for your actions and their consequences. We are not to blame if your accounts are banned for any reason.<\/p>\n<p>You agree that upon purchasing our Software, that you clearly understand and agree what you are purchasing and will not file a fraudulent dispute via PayPal or perform a chargeback.<\/p>\n<p>We reserve the right to modify, suspend or withdraw the whole or any part of our service or any of its content at any time without notice and without incurring any liability.<\/p>\n<p>It is your sole responsibility to check whether the Terms have changed.<\/p>\n<p>JARVEE (ABC E-Commerce Services)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>BY SELECTING “I ACCEPT”, “I AGREE”, “OK”, “CONTINUE”, “YES” OR BY INSTALLING OR USING THE SOFTWARE IN ANY WAY, YOU ARE INDICATING YOUR COMPLETE UNDERSTANDING AND ACCEPTANCE OF THE TERMS OF THIS AGREEMENT. IF YOU DO NOT AGREE TO THESE TERMS AND CONDITIONS DO NOT INSTALL OR ACCESS THE SOFTWARE OR OTHERWISE INDICATE REFUSAL, MAKE [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.7.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>JARVEE Terms Of Service - undertand and agree before continuing<\/title>\n<meta name=\"description\" content=\"These are JARVEE&#039;s Terms of service. You need to fully read, understand and accept them before starting using our social media automation software.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jarvee.com\/terms-of-service\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"JARVEE Terms Of Service - undertand and agree before continuing\" \/>\n<meta property=\"og:description\" content=\"These are JARVEE&#039;s Terms of service. You need to fully read, understand and accept them before starting using our social media automation software.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jarvee.com\/terms-of-service\/\" \/>\n<meta property=\"og:site_name\" content=\"Jarvee\" \/>\n<meta property=\"article:modified_time\" content=\"2021-05-31T10:36:33+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"21 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jarvee.com\/#website\",\"url\":\"https:\/\/jarvee.com\/\",\"name\":\"Jarvee\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jarvee.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jarvee.com\/terms-of-service\/#webpage\",\"url\":\"https:\/\/jarvee.com\/terms-of-service\/\",\"name\":\"JARVEE Terms Of Service - undertand and agree before continuing\",\"isPartOf\":{\"@id\":\"https:\/\/jarvee.com\/#website\"},\"datePublished\":\"2017-07-07T22:16:44+00:00\",\"dateModified\":\"2021-05-31T10:36:33+00:00\",\"description\":\"These are JARVEE's Terms of service. You need to fully read, understand and accept them before starting using our social media automation software.\",\"breadcrumb\":{\"@id\":\"https:\/\/jarvee.com\/terms-of-service\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jarvee.com\/terms-of-service\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jarvee.com\/terms-of-service\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jarvee.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms of Service\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"JARVEE Terms Of Service - undertand and agree before continuing","description":"These are JARVEE's Terms of service. You need to fully read, understand and accept them before starting using our social media automation software.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jarvee.com\/terms-of-service\/","og_locale":"en_US","og_type":"article","og_title":"JARVEE Terms Of Service - undertand and agree before continuing","og_description":"These are JARVEE's Terms of service. You need to fully read, understand and accept them before starting using our social media automation software.","og_url":"https:\/\/jarvee.com\/terms-of-service\/","og_site_name":"Jarvee","article_modified_time":"2021-05-31T10:36:33+00:00","twitter_card":"summary","twitter_misc":{"Est. reading time":"21 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/jarvee.com\/#website","url":"https:\/\/jarvee.com\/","name":"Jarvee","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jarvee.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/jarvee.com\/terms-of-service\/#webpage","url":"https:\/\/jarvee.com\/terms-of-service\/","name":"JARVEE Terms Of Service - undertand and agree before continuing","isPartOf":{"@id":"https:\/\/jarvee.com\/#website"},"datePublished":"2017-07-07T22:16:44+00:00","dateModified":"2021-05-31T10:36:33+00:00","description":"These are JARVEE's Terms of service. You need to fully read, understand and accept them before starting using our social media automation software.","breadcrumb":{"@id":"https:\/\/jarvee.com\/terms-of-service\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jarvee.com\/terms-of-service\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jarvee.com\/terms-of-service\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jarvee.com\/"},{"@type":"ListItem","position":2,"name":"Terms of Service"}]}]}},"_links":{"self":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/pages\/202"}],"collection":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/comments?post=202"}],"version-history":[{"count":8,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/pages\/202\/revisions"}],"predecessor-version":[{"id":9162,"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/pages\/202\/revisions\/9162"}],"wp:attachment":[{"href":"https:\/\/jarvee.com\/wp-json\/wp\/v2\/media?parent=202"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}